[{"course_code":"MBB 980H","course_title":"What Disease Teaches about Cognition 001","course_title_2023":"What Disease Teaches about Cognition","course_score_mean":4.6,"rec_score_mean":4.8,"gem_score_mean":0.1428571429,"sentiment_score_median":0.7796,"best_gem_comment":"The course is split into two sections: anatomy and cases\/project presentations. Anatomy consists of Dr. Milberg giving slideshow presentations on various structures\/functions of the brain, sometimes using a human brain or a model. It can be easy to get a bit lost in this part of the course, so don't be afraid to ask questions. You'll also learn the most if you buy the workbook he recommends and actually use it. The anatomy section is tested with a relatively easy midterm. The second segment is group presentations on famous cases of abnormal cognition — think Phineas Gage, HM, ect. — that build on some anatomy knowledge but are generally interesting to work on & listen to. The take–home final was based on these cases. Our seminar was also offered an opportunity during reading period to do one last \"cutting\" of the brain to access some of the structures we weren't able to physically see earlier in the class. Overall, I'd highly recommend the course — it's a 'gem' in it's low required workload (again, you get the most if you do work outside of class that's not required) BUT it is also extremely interesting. Dr. Milberg is a gem of an instructor. He is incredibly knowledgable, friendly, accessible, and has a lot of interesting personal stories about cases he's seen throughout his career. This is a low–stakes way to learn brain anatomy (which is surprisingly lacking in the College's neuroscience department) because the workload is very low and Milberg is very willing to entertain questions. Even if anatomy is not the most interesting subject for you (as it wasn't for me), examining a real human brain is a unique opportunity that is hard to come by. The cases were also very interesting with a good mix of diversity. I didn't think I had retained that much from the anatomy section but I was surprised at how much I actually remembered when we came to the cases.","workload_score_mean":2.2,"best_gem_comment_short":"Overall, I'd highly recommend the course — it's a 'gem' in it's low required workload (again, you get the most if you do work outside of class that's not required) BUT it is also extremely interesting.","course_id":"109866","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c4d23fc548fdf238167bfbff217eb28a498111847b393d0ce1a18dd3bf1e614f411a5d90cb5225cb3b8eb1e0341fce99&ReportType=2&regl=en-US"}]