[{"course_code":"COMPSCI 96","useful_title":"System Design Projects: Machine Learning for Social Impact","course_score_mean":4.45,"rec_score_mean":4.45,"gem_score_mean":0.125,"sentiment_score_median":0.9018,"best_gem_comment":"This course has the potential to be really fulfilling \/ enjoyable, but I think that since it was the first year it was being offered, some general kinks and organization still need to be ironed out. It is definitely a gem though, and your experience will depend a lot on the teammates that you have and the TF in charge of your project.","workload_score_mean":5.09,"best_gem_comment_short":"It is definitely a gem though, and your experience will depend a lot on the teammates that you have and the TF in charge of your project.","course_id":"121508","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c2974ea72dfd49f382db5cd096eb2ea2c8b1525d98f455ca1d006336d79dbd74b4942fefb56d467624220f4b83d02306&ReportType=2&regl=en-US"},{"course_code":"COMPSCI 191","useful_title":"Classics of Computer Science","course_score_mean":4.02,"rec_score_mean":4.17,"gem_score_mean":0.0333333333,"sentiment_score_median":0.78995,"best_gem_comment":"This class is an absolute gem, and super interesting if you're generally interested in the history of computer science and reading CS papers. It is a bit stressful that the entire grade comes down to the video project, though at least the course staff makes it pretty clear what the expectations for the video are and also there are two possible submission deadlines (so if you do bad on the first, you can submit another to bring your grade up potentially). Also, the quality of conversations can either be really good or just okay depending on the table group you get.","workload_score_mean":3.79,"best_gem_comment_short":"This class is an absolute gem, and super interesting if you're generally interested in the history of computer science and reading CS papers.","course_id":"204964","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=44c288ea536f071562276744d80a90f673e0091aafb7159686254803490ba707e937abc01084f83b0a8b9732572eb7f7&ReportType=2&regl=en-US"},{"course_code":"COMPSCI 20","useful_title":"Discrete Mathematics for Computer Science","course_score_mean":3.67,"rec_score_mean":3.81,"gem_score_mean":0.010989011,"sentiment_score_median":0.5106,"best_gem_comment":"This course was advertised as a gem, but don't take that for granted. You will have to spend a significant amount of time for the class, especially when midterms roll around because there is a hefty amount of material in the class, and it is easy to forget specific formulas or niche topics. The teaching staff is great and office hours are a great tool for getting help for pets\/understanding the material.","workload_score_mean":6.56,"best_gem_comment_short":"This course was advertised as a gem, but don't take that for granted.","course_id":"128073","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=43cae4cd18dfd1cc7f923f6f015ec4eee1028c2b1c1f3f99213cef607387be953fd6f5a41f6e5b491968d97a6c0a787a&ReportType=2&regl=en-US"}]