[{"course_code":"GENED 1025","course_title_2025":"Happiness","course_score_mean":4.28,"rec_score_mean":4.39,"gem_probability_mean":0.0843373494,"sentiment_score_median":0.9287,"best_gem_comment":"Professor Rinard is the best! She is always connecting the sometimes overly intellectual philosophy topics to real world examples and anecdotes from her life to help our understanding. She was super engaging to listen to and I would highly recommend meeting with her to discuss the topics further; she is a wealth of knowledge. I originally took this class just to get the gened requirement out of the way but ended up truly loving the readings and material I learned. If you do the readings, the quizzes are very easy, and I would definitely call this class a gem. TAKE THIS CLASS even if only to hear Prof. Rinard's interesting and amusing lectures! You won't regret having a deeper understanding of finding fulfillment as a human.","workload_score_mean":4.7,"best_gem_comment_short":"If you do the readings, the quizzes are very easy, and I would definitely call this class a gem.","course_id":"218240","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=224a0a2adbe6c9563366a865026ed01444538a4210b76db8639dfbcfb464baa0b208a571a80fa1259b4e099b946f746a&ReportType=2&regl=en-US"},{"course_code":"GENED 1031","course_title_2025":"Finding Our Way","course_score_mean":4.45,"rec_score_mean":4.33,"gem_probability_mean":0.0833333333,"sentiment_score_median":0.93625,"best_gem_comment":"I don't know if this course would be considered a gem but it is definitely one of the more interesting gened courses, especially if you are interested in the outdoors, backpacking, etc. It gives a basic understanding of wayfinding and pathfinding through tools that you can bring with you on your trips (i.e., compass and map). Many of the assignments use the skills you learned and then apply them to the outdoors so you can actually see your understanding of the topic come to fruition. The course derails sometimes into an environmental science and history course, but I personally enjoyed that, and it was fun to learn what Dr. Huth had to offer. Overall, Dr. Huth is a great professor, and his gened course was fun. Even if you have no interest in wayfinding, you will still come out of the class with useful skills.","workload_score_mean":3.67,"best_gem_comment_short":"I don't know if this course would be considered a gem but it is definitely one of the more interesting gened courses, especially if you are interested in the outdoors, backpacking, etc.","course_id":"126603","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c055108157be3e0a7ca546eb97d2d860a6ce0cc18e3ad1a11ce9a5f7d76253a373e8b5b795e60c78001a500c0e08b169&ReportType=2&regl=en-US"},{"course_code":"GENED 1071","course_title_2025":"African Spirituality and the Challenges of Modern Times","course_score_mean":4.06,"rec_score_mean":4.32,"gem_probability_mean":0.0821917808,"sentiment_score_median":0.7424,"best_gem_comment":"This class is definitely what you make of it. Section is what determines how fun the class can be because it can be super engaging. The material is really interesting, so I encourage you to pay some attention to it even though the class is a gem.","workload_score_mean":4.53,"best_gem_comment_short":"The material is really interesting, so I encourage you to pay some attention to it even though the class is a gem.","course_id":"212849","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d271cf043fbc8b27f7e0353cdded8004e9e64fd378af00e04cead046a7c3bf851feab70cc96429a32e8f659047cd069f&ReportType=2&regl=en-US"},{"course_code":"GENED 1074","course_title_2025":"The Ancient Greek Hero","course_score_mean":3.96,"rec_score_mean":4.13,"gem_probability_mean":0.0576923077,"sentiment_score_median":0.61865,"best_gem_comment":"This GENED is a prime example of why the GENED system is broken. Every week, a hundred students trudge in to sit in lecture and do other work with some rambling as background ambient noise. This might literally be a study hall for homework.Now Greg is a sweetheart and obviously an expert at what he does, but he also looks like he personally knew some of the Greek heroes back in the day. So, the main teaching is mostly left to the TFs, who are EXTREMELY hit or miss. I have heard of several people enjoying their sections, but for the most part, they are pretentious, snotty, sleep–deprived, burnt–out grad students trying to force a group of uninterested, busy undergrads to yap about some incoherent analysis.Also, if Hannah is a TF, AVOID HANNAH AT ALL COSTS—this woman is literally the words pedantic, neurotic, and main–character syndrome come to life. Every time she co–led class, an audible groan could be heard from the auditorium, and whenever she was involved in lecture, it was a circus of Hannah imagining herself a deep intellectual and emanating cringe at nuclear levels.That being said, the course is still definitely a gem—like actually close to zero workload. There are a lot of little assignments, but they’re things you can grind out in a couple of minutes, and the quizzes are extremely doable just by skimming through the reading. Genuinely, the most time I ever spent on this outside of class was like an hour.So if you need a gem to balance out your schedule, take it. But if you have any self–respect or want to avoid the grievance of observing the carnival of insufferable people this course for some reason attracts—don’t do it.","workload_score_mean":5.28,"best_gem_comment_short":"Every time she co–led class, an audible groan could be heard from the auditorium, and whenever she was involved in lecture, it was a circus of Hannah imagining herself a deep intellectual and emanating cringe at nuclear levels.That being said, the course is still definitely a gem—like actually close to zero workload.","course_id":"113501","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8caeb884a9897cab0cdcadc07fe44cd3e7b2d4c35a519917a560221f6004051b6b5f347e1a5cb0df1f0beeb6fffd6dda&ReportType=2&regl=en-US"},{"course_code":"GENED 1196","course_title_2025":"Tradition in Everyday Life","course_score_mean":3.7,"rec_score_mean":3.62,"gem_probability_mean":0.04,"sentiment_score_median":0.8639,"best_gem_comment":"The class in comparison to other GENEDs is low workload and an enjoyable class to take with a heavy course load. I would consider it a gem as long as you do the assignments and keep up with the perusall you should be fine.","workload_score_mean":5.19,"best_gem_comment_short":"I would consider it a gem as long as you do the assignments and keep up with the perusall you should be fine.","course_id":"224414","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=bf36ea8e96b3ce0e31aec8a9dc07de41a57b1f07ce938c3f712950879dc9a73e83c3ec8fdd8f20d8b8e361a0f26773b3&ReportType=2&regl=en-US"}]