[{"course_code":"SLAVIC 97","course_title_2026":"Introduction to Slavic Literatures and Cultures","course_score_mean":5.0,"rec_score_mean":4.8,"gem_probability_mean":0.0,"sentiment_score_median":0.70135,"best_gem_comment":"","workload_score_mean":5.6,"best_gem_comment_short":"","best_comment":"Kremer is awesome and truly an expert in Slavic literature. I really enjoyed the diverse range of reaings in this class, and and very satisfied with the amount of history, literature, and arts consumed. Would definitely recommend this course, even if you're not a Slavic concentrator","best_comment_short":"Kremer is awesome and truly an expert in Slavic literature.","best_comment_first":"Kremer is awesome and truly an expert in Slavic literature.","course_id":"121681","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=99512c44a4384f2638219d11c3c9696ef877d89f8fb349a972c068c7034f001e3bb6fd82289bc133921548ff3911a140&ReportType=2&regl=en-US"},{"course_code":"AFVS 152F","course_title_2026":"The Bolex: Working in Film","course_score_mean":5.0,"rec_score_mean":5.0,"gem_probability_mean":0.0,"sentiment_score_median":0.7845,"best_gem_comment":"","workload_score_mean":7.63,"best_gem_comment_short":"","best_comment":"AFVS is an amazing place. Classes like this where you use physical materials and get instruction from the BEST OF THE BEST, are what make it so. Robb will forever be my favorite professor at this school and one of my favorite people. He makes you feel insane and sane at the same time, makes you feel like you can be a filmmaker. I am forever grateful for the time I had with him.","best_comment_short":"Classes like this where you use physical materials and get instruction from the BEST OF THE BEST, are what make it so.","best_comment_first":"AFVS is an amazing place.","course_id":"220435","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6b9f98df5dcf22b028c6942f47dbbe70a20d03c03633259c3f9d1f48d6e067eea61bb9830d0547b7d271a0553760614d&ReportType=2&regl=en-US"},{"course_code":"CHNSHIS 146","course_title_2026":"The Modern History of Rural China","course_score_mean":5.0,"rec_score_mean":4.75,"gem_probability_mean":0.0,"sentiment_score_median":0.95435,"best_gem_comment":"","workload_score_mean":6.17,"best_gem_comment_short":"","best_comment":"Take this class! This class has everything you could want: great content where you will actually learn a lot, fun assignments that are challenging in a good way, fair and clear grading, amazing lectures, and interesting discussions in class and in section. This is really a class that does everything right, so I highly highly recommend.","best_comment_short":"This class has everything you could want: great content where you will actually learn a lot, fun assignments that are challenging in a good way, fair and clear grading, amazing lectures, and interesting discussions in class and in section.","best_comment_first":"Take this class!","course_id":"224291","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=bb699423a9c6a1a59fb9076f9202b071115d467be939cef3263c35ca849b56a2405ac74f7c6d5046762e1ed507a237df&ReportType=2&regl=en-US"},{"course_code":"JAPAN 140B","course_title_2026":"Advanced Modern Japanese","course_score_mean":5.0,"rec_score_mean":5.0,"gem_probability_mean":0.0,"sentiment_score_median":0.66115,"best_gem_comment":"","workload_score_mean":6.63,"best_gem_comment_short":"","best_comment":"Japanese 140b with Asakura先生 and Higurashi先生 was an absolute blast! I had so much fun in this class because (1) the homework assignments are pretty straightforward and fast, (2) the content is genuinely interesting (rakugo, traditional Japanese stories, subculture, dialects, short stories), (3) I had SOOOO many friends in the class (since I continued from 130ab), and (4) the outside–class events were insanely fun (making mochi, presenting final reports, end–of–year party). Both the teachers are great at engaging the class and sparking interesting discussions. Even tho I took this class mostly 9 am, I never felt sleepy or bored, and I always got a chance to speak. For me, I feel like Japanese language classes have been a consistent highlight of my time at harvard.","best_comment_short":"I had so much fun in this class because (1) the homework assignments are pretty straightforward and fast, (2) the content is genuinely interesting (rakugo, traditional Japanese stories, subculture, dialects, short stories), (3) I had SOOOO many friends in the class (since I continued from 130ab), and (4) the outside–class events were insanely fun (making mochi, presenting final reports, end–of–year party).","best_comment_first":"Japanese 140b with Asakura先生 and Higurashi先生 was an absolute blast!","course_id":"123963","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=52a0957a2e29d680af09fd76ee02d1ef1d102fe22240d46b8246eed991ae2b39bcc4795a396e91541aed2dc06989793f&ReportType=2&regl=en-US"},{"course_code":"RELIGION 33","course_title_2026":"Indigenous Pacific Islander Wellbeing and Spirituality","course_score_mean":5.0,"rec_score_mean":5.0,"gem_probability_mean":0.0,"sentiment_score_median":0.9429,"best_gem_comment":"","workload_score_mean":4.78,"best_gem_comment_short":"","best_comment":"This class will do so much for you, not only academically, but also encourage personal growth. I feel like many of the readings had me think about how I would intentionally like to engage with the Western medical system. The various texts talking about Pacific Indigenous approaches to well–being demonstrated care that recognizes the humanity and dignity of a person. It was particularly the section on motherhood that caused me to reflect on how my mother was treated in American hospitals and how I would like to be treated when the time comes for me to have babies.","best_comment_short":"This class will do so much for you, not only academically, but also encourage personal growth.","best_comment_first":"This class will do so much for you, not only academically, but also encourage personal growth.","course_id":"225923","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9730597bba2a06616742a45f8fd848713baa810e8af6a33528fddf43731e5442a8c48419db286f3cf291fbc7e4cf19a9&ReportType=2&regl=en-US"},{"course_code":"SOC-STD 98WN","course_title_2026":"Mental Health & Society","course_score_mean":5.0,"rec_score_mean":4.86,"gem_probability_mean":0.0,"sentiment_score_median":0.9513,"best_gem_comment":"","workload_score_mean":6.14,"best_gem_comment_short":"","best_comment":"If you're interested in why mental health or mental healthcare in the USA is the way it is, then you need to take this class. Matt is an AMAZING professor – he brings a wealth of experience from both psychiatry and econ, and he's great at using that experience to facilitate a class discussion. He's also genuinely interested in supporting students and genuinely concerned for our well–being. The syllabus is awesome, but also manageable; I took the class as a non–concentrator and was able to keep up pretty well in discussions despite not having seen most of it before. It was really cool to put \"canonical\" authors like Durkheim, Foucault, and Fanon in conversation with more modern authors who focus on mental health, like Arthur Kleinman, Anne Becker, Case and Deaton, and Thomas Insel. One caveat I would mention is that if you're more interested in social theory than you are in mental health, this class may not be for you. We talked about some pretty heavy topics every class (especially suicide), and it can burn you out if you're not prepared to engage with it. As someone who's kind of obsessed with the social environment surrounding mental illness, this was one of my favorite classes I've taken at Harvard, and I loved talking with other people who think about it as much as I do, but it might not be everyone's cup of tea. If it is your cup of tea, though, it's a really good one.","best_comment_short":"Matt is an AMAZING professor – he brings a wealth of experience from both psychiatry and econ, and he's great at using that experience to facilitate a class discussion.","best_comment_first":"If you're interested in why mental health or mental healthcare in the USA is the way it is, then you need to take this class.","course_id":"225830","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d0c3478d58fa6356f6cb3042991ad51267d32c8a1df18e3e27b7f4c8fb988512d559dab1128b6f6d188092e03865f8b7&ReportType=2&regl=en-US"},{"course_code":"E-PSCI 99B","course_title_2026":"Tutorial - Senior Year","course_score_mean":5.0,"rec_score_mean":5.0,"gem_probability_mean":0.0,"sentiment_score_median":0.9493,"best_gem_comment":"","workload_score_mean":14.0,"best_gem_comment_short":"","best_comment":"Writing a thesis was one of my most rewarding undertakings at Harvard! Do not be afraid, choose a topic you care about, and embrace the ups and downs! Some advice I have for future thesis writers … 1. Choose a project or topic that means something to you (i.e. a physical location \/ earth system you’re interested in, a project with policy implications you care about, a methodology that would be challenging but rewarding for you to master). I found this went a long way in energizing me to work on my thesis. 2. Think about when you’ll have pockets of time to really focus on your thesis. For me, it was helpful to carve out designated days or couple day stretches to put other things aside and really focus on my thesis (senior year winter break was an especially important stretch for me). Also, choose a designated thesis cave location (thank you Peet’s Coffee and Ernst Mayr library)! 3. Reading as much of the existing literature on your topic as possible will help you gain confidence and feel like the project is your own. I felt like I gained the most traction with my thesis when I started actively bringing new ideas and questions to meetings with my advisors. 4. Lean on other people (even in other concentrations who are writing a thesis) — it is a communal experience and it is fun talking \/ learning about other people’s little intellectual worlds!","best_comment_short":"Reading as much of the existing literature on your topic as possible will help you gain confidence and feel like the project is your own.","best_comment_first":"Writing a thesis was one of my most rewarding undertakings at Harvard!","course_id":"159619","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=26fa9b890a3da2ad3b28028028819f340421f0529f7259e6acbdbd9a949f04c2f17021e99919f3e86e61dac8f5d2416b&ReportType=2&regl=en-US"},{"course_code":"SCRB 135","course_title_2026":"Reproductive Biology","course_score_mean":5.0,"rec_score_mean":5.0,"gem_probability_mean":0.0,"sentiment_score_median":0.96695,"best_gem_comment":"","workload_score_mean":4.33,"best_gem_comment_short":"","best_comment":"As an HDRBer, this is the BEST COURSE I'VE TAKEN AT THIS SCHOOL!!! Please take it. Reproductive biology is such a niche, underfunded, understudied sector of science, and Kara is the most knowledgeable person you could find about this topic. She does a great job of breaking down content in a way that is palatable, but also leaves you wanting to know more. I have learned so much in this class, from experimental techniques, developmental pathways, and even socioeconomic factors about reproductive biology – things like misogyny in science, to intersex\/transgender healthcare, and more. If you haven't taken SCRB 10\/SCRB 50, the first couple of weeks are a great crash course for experimental design, which is important for PSETs. Lecture is much more informational (but still very interesting!). PSETs are very manageable, as long as you take the time to show up to office hours (there is no collaboration with peers allowed, only TFs\/Kara). The TFs were also both very amazing, approachable, and dedicated people! Lastly, if youre reading this lottery ASAP for the course – it's very hard to get into, so if you demonstrate interest early, you have a higher chance of getting into the class earlier. The majority of the class was juniors\/seniors, and they are from a good mix of backgrounds (mostly premed, but not all HDRB). There also are some grad students, too, which provides a wonderful light to the course in terms of experience and interest!","best_comment_short":"The TFs were also both very amazing, approachable, and dedicated people!","best_comment_first":"As an HDRBer, this is the BEST COURSE I'VE TAKEN AT THIS SCHOOL!!!","course_id":"218928","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e268e792448bc3456c047b9a31f35823fd04a720f5756a93347ceee688b5622295d2f563f1159183e7debc8167939def&ReportType=2&regl=en-US"},{"course_code":"OEB 52","course_title_2026":"Biology of Plants","course_score_mean":4.93,"rec_score_mean":4.93,"gem_probability_mean":0.0,"sentiment_score_median":0.9521,"best_gem_comment":"","workload_score_mean":4.85,"best_gem_comment_short":"","best_comment":"This is a really excellent course here. The teaching staff is awesome ( and do a wonderful job lecturing), field trips are a great opportunity to get off campus ( and also very fun), lab is really just getting to see how cool plants are, and the assignments are not terribly stressful. This has made this class a wonderful science class to take at Harvard. The organization and course format is very well done, making this a great class for students. The content is also very interesting. As a side note: I took this class with OEB 103 and found this class and OEB 103 to go hand and hand. What I learned in OEB 103 was incredibly helpful for this class and vice versa. If you are thinking about taking both classes, they both inform and help each other. It was a great plant semester.","best_comment_short":"The teaching staff is awesome ( and do a wonderful job lecturing), field trips are a great opportunity to get off campus ( and also very fun), lab is really just getting to see how cool plants are, and the assignments are not terribly stressful.","best_comment_first":"This is a really excellent course here.","course_id":"131579","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e12408b3ca8989151f915ca3540777f17075bfe77f9f824e590d26b59b033abacb3237414f071006bfca7f42a6140d32&ReportType=2&regl=en-US"},{"course_code":"STAT 117","course_title_2026":"Data Analysis in Modern Biostatistics","course_score_mean":4.92,"rec_score_mean":4.92,"gem_probability_mean":0.0,"sentiment_score_median":0.9749,"best_gem_comment":"","workload_score_mean":8.45,"best_gem_comment_short":"","best_comment":"Stat 117 was fantastic!!!! Definitely my favorite elective course I've taken. The discussions we had in class were always thoughtful, engaging, and nuanced, which were made possible because of our incredible professor! Dr. Parmigiani has put so much thought and care into the semi–flipped structure of the class, as well as the class notes and materials for each lesson, and his extensive experience in this field adds so much depth to our discussion. All the homeworks and projects contribute uniquely to our understanding of the material––the homeworks do an awesome job helping us to digest the material, and then the projects give us the opportunity to take our understanding and innovate on it even further. Overall, this class is very, very well–designed and has taught me so much about biostatistics as well as a general intuition around how to handle data and use it to the best of our ability!","best_comment_short":"All the homeworks and projects contribute uniquely to our understanding of the material––the homeworks do an awesome job helping us to digest the material, and then the projects give us the opportunity to take our understanding and innovate on it even further.","best_comment_first":"Stat 117 was fantastic!!!!","course_id":"203104","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=62c94a28ad5bdc44f516eecb0d8229791d58a2fac73919b4191f8f91d52d7f05b2467ae686027025a4330272772cb34e&ReportType=2&regl=en-US"},{"course_code":"MATH LS","course_title_2026":"Mathematics of Biological Systems: a Calculus-Based Approach","course_score_mean":4.92,"rec_score_mean":4.92,"gem_probability_mean":0.0,"sentiment_score_median":0.9667,"best_gem_comment":"","workload_score_mean":8.92,"best_gem_comment_short":"","best_comment":"If you are pre–med and don't need\/want to take math further than the Ma\/Mb sequence, TAKE THIS CLASS OVER MB!!! I have had the best time this semester! Janet is AMAZING and so so helpful. You can tell that she wants you to succeed!! Also, they pick the best CAs for this class! Not only are they there to help you with the math, but they are prob pre–med too so they provide really useful insight on pre–med stuff at Harvard. with all that said TAKE THIS!! If you are going between LS and Mb pls pls choose LS! I have applied myself 100 times more than last semester in MA and I lowkey think its because i'm interested in what is going on. If I am doing math using a situation I will most likely encounter as a doctor of course I'm going to pay more attention. My test scores are better, my pset scores are better, my life is better. I have friends who switched to LS from Mb and they also love it!! Come join the LS fam!!","best_comment_short":"Janet is AMAZING and so so helpful.","best_comment_first":"If you are pre–med and don't need\/want to take math further than the Ma\/Mb sequence, TAKE THIS CLASS OVER MB!!!","course_id":"224377","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=84ccb62e892b96454a4db1d88837a3871eb2d36aea11502152b35b7f1afb80cc7f77df58094a61dcb6a056935c34b87e&ReportType=2&regl=en-US"},{"course_code":"TDM 140DL","course_title_2026":"Dance Lineages","course_score_mean":4.92,"rec_score_mean":5.0,"gem_probability_mean":0.0,"sentiment_score_median":0.9393,"best_gem_comment":"","workload_score_mean":4.45,"best_gem_comment_short":"","best_comment":"This class is incredible! Laura is a fantastic teacher who is incredibly knowledgeable about the field (and so accomplished with her own research!) Each week, you will learn about a different choreographic lineage and the class covers a multitude of different dance styles and genres. The workload is incredibly manageable with weekly readings\/videos and the assignments are super fun–you get to attend free live performances and write about what you see. I would definitely recommend this course to both TDM concentrators and anyone with an interest in dance–it is an incredible opportunity to learn about how to study dance as an academic discipline.","best_comment_short":"I would definitely recommend this course to both TDM concentrators and anyone with an interest in dance–it is an incredible opportunity to learn about how to study dance as an academic discipline.","best_comment_first":"This class is incredible!","course_id":"225885","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=5b098e7d72e5716b9f7d9a4622ac332ef445bfc801132c5c4796a3b1550a3653abeb145cd506ca71002fadd428e87ed9&ReportType=2&regl=en-US"},{"course_code":"MUSIC 189R","course_title_2026":"Chamber Music Performance","course_score_mean":4.9,"rec_score_mean":4.84,"gem_probability_mean":0.0,"sentiment_score_median":0.7712,"best_gem_comment":"","workload_score_mean":5.82,"best_gem_comment_short":"","best_comment":"This class is a great way to continue being involved with music at Harvard with peers who probably also did music at a high level before Harvard. The one thing I will say is: do not underestimate the amount of time you have to put into the class. Of course, it is possible to breeze through by barely rehearsing, since the only mandatory thing is a 1 hour weekly coaching (and if your group wants to do this class this way that's totally valid). But after taking this class 4 times, I have realized most groups do actually want to sound good by the final concert, and are pretty serious about rehearsing. For my group, we had regular weekly rehearsals but also extra rehearsals for the performance classes, the final jury, and the final concert, and all that rehearsal time builds up—our group also had extra coaching sessions (so more time again). So ultimately whether this class is a 5th class gem or a pretty substantial class in itself really depends on how serious your group is about sounding good and rehearsing a lot (and note how much your group cares could change DURING the semester). As for the new policy removing pre–formed groups (starting Fall 2025), I understand it may be unpopular—but I agree with the decision. (For context, the status quo is that if you have a pre–formed group, you essentially get into the course automatically, without much consideration to the individual level of the players, and people who applied individually despite essentially being professional–level musicians have gotten rejected due to pre–formed groups having priority). I don't think this is fair, especially for students with professional–level training\/performing experience. I think the audition process should be merit–based and not based on social connections and ultimately, whoever is a better musician gets to take the course. Moreover, yes, it is nice to play with your friends, but I think the purpose of a class like this should be personal and musical development. I think playing with people you don’t know—especially ones at a similar level—can actually be a better means to achieve this goal and can challenge you in different and productive ways. Of course, it works when a pre–formed group is compatible, but I believe that the overall pre–forming process often results in several unbalanced groups with players of different levels, resulting in a worse 189 experience for people in these unbalanced groups. I've also seen a fair amount of politicking with the pre–forming process e.g. people trying to “lock in” players early, or abandoning one group for a better one mid–process, which can get messy. I think the staff have a good idea of which players are similar in ability and compatible with others and will ultimately create more balanced groups, resulting in a better overall 189 experience for everyone. The counter of course is that this assumes the staff know better than the students which musicians will be more compatible with each other, which might be difficult in a 10–minute audition. BUT, at least they get to hear everyone directly and assess musical levels side–by–side and for me, that puts them in a better position than students to create balanced, compatible ensembles. Also, stepping back a bit, I don't think the policy is unreasonable—at chamber music festivals the norm is for the organizers\/coaches to assign the groups, and in the industry groups are often pieced together last–minute and musicians often have no say in who they play with.Aside from this digression, this is a brilliant course that any classical musician at Harvard should consider taking! The Parker Quartet is amazing and the course is a huge value–add for the overall music environment and music community at Harvard.","best_comment_short":"So ultimately whether this class is a 5th class gem or a pretty substantial class in itself really depends on how serious your group is about sounding good and rehearsing a lot (and note how much your group cares could change DURING the semester).","best_comment_first":"This class is a great way to continue being involved with music at Harvard with peers who probably also did music at a high level before Harvard.","course_id":"153042","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=398acb75a449c0a422edc0d1accd8bb61c139e5735d3bf1db7e597c8b5618811c2e922845fa4d97d570d5c34ab49d923&ReportType=2&regl=en-US"},{"course_code":"COMPSCI 1960","course_title_2026":"Designing K–12 Computer Science Learning Experiences","course_score_mean":4.9,"rec_score_mean":4.9,"gem_probability_mean":0.0,"sentiment_score_median":0.9414,"best_gem_comment":"","workload_score_mean":5.33,"best_gem_comment_short":"","best_comment":"AMAZING COURSE! This class provides a robust overview of different tools and topics in the K12 CS space. Each class they follow a different structure discussing the case studies. All resources and classes are incredibly well–thought out and fascinating. KB and Brian (sad that he's left) really make this course special. They're endless support for each person's projects and each person's progression through life is truly incredible. They foster an amazing class community, and really embody great teaching. If you can get the opportunity, I would highly encourage anyone interested to take this class. It's so worth it! The final project has a lot of freedom and I really encourage you to pick something you really want to learn about and to run with it. Make sure to make progress each week :)","best_comment_short":"The final project has a lot of freedom and I really encourage you to pick something you really want to learn about and to run with it.","best_comment_first":"AMAZING COURSE!","course_id":"221939","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6c1a4fb3d2ffef54786ac90a72480e2525eaab27abf963aa133add763c43d1454255da3688199c8073318013482530a9&ReportType=2&regl=en-US"},{"course_code":"ENGLISH CHCR","course_title_2026":"Advanced Poetry: Workshop","course_score_mean":4.9,"rec_score_mean":4.9,"gem_probability_mean":0.0,"sentiment_score_median":0.9245,"best_gem_comment":"","workload_score_mean":4.71,"best_gem_comment_short":"","best_comment":"Best class at Harvard. This workshop is the perfect opportunity to hone your craft and thoughtfully contribute to your classmates’ work. More than any other workshop, this class gives you great feedback, especially critique and suggestions for improvement. Josh is the GOAT.","best_comment_short":"This workshop is the perfect opportunity to hone your craft and thoughtfully contribute to your classmates’ work.","best_comment_first":"Best class at Harvard.","course_id":"130000","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=66ee0730f4783f12206cfc16b9a637fb87162088dee7377f0bffa26b0e8b2901a12b9e237274dba399bd43ad2272ef6a&ReportType=2&regl=en-US"},{"course_code":"AFVS 61","course_title_2026":"Sight and Sound: Introduction to Narrative Filmmaking","course_score_mean":4.89,"rec_score_mean":4.78,"gem_probability_mean":0.0,"sentiment_score_median":0.95,"best_gem_comment":"","workload_score_mean":9.0,"best_gem_comment_short":"","best_comment":"This class with Tala Hadid and Madison Howard (TF) is incredible. The mini assignments we have before working on our final films help a lot in developing our understanding of the filmmaking process with low stakes and super helpful feedback. They do a really great job of showing us a variety of films. And they’re super helpful as we work through the process of making our final films. Both Tala and Madison are incredibly kind and passionate about their work. If you’re interested or curious about filmmaking in any capacity (fiction or not) definitely enroll in this course. You learn the basic fundamentals of cinematography, sound, editing, and color correction while also learning how to best execute the story you want to tell. I’d say go into the class having an open mind and some ideas of what film you want to make. The last thing I’ll say is Tala brings incredible directors and producers as guests to speak with the class. If for nothing else, having the opportunity to speak to people who work in the industry full time is pretty awesome especially if that’s what you want to do.","best_comment_short":"If for nothing else, having the opportunity to speak to people who work in the industry full time is pretty awesome especially if that’s what you want to do.","best_comment_first":"This class with Tala Hadid and Madison Howard (TF) is incredible.","course_id":"224547","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=aa828d4cc0e85761514633586e9d5d80386f9140690e2a90f153e730416257adc5dc8bcdcf00ba2ef31326476b8edcf5&ReportType=2&regl=en-US"},{"course_code":"ENGLISH 90KA","course_title_2026":"The Brontës","course_score_mean":4.89,"rec_score_mean":4.89,"gem_probability_mean":0.0,"sentiment_score_median":0.91295,"best_gem_comment":"","workload_score_mean":8.72,"best_gem_comment_short":"","best_comment":"One of my favorite seminars taken within the English department. Professor Scarry is so welcoming, engaging, and attentive to her students, and the overall class engagement felt very genuine and exciting. It is, of course, on the heavier side with reading — but it's run almost as a book club, in the sense that it encourages you to read genuinely interesting literature every week, and sets a great motive for reading consistently throughout the semester.  The professor leaves detailed feedback on all of the reading responses, and encourages you to follow your own niche areas of interest; it's overall a very encouraging class, could not recommend enough.","best_comment_short":"It is, of course, on the heavier side with reading — but it's run almost as a book club, in the sense that it encourages you to read genuinely interesting literature every week, and sets a great motive for reading consistently throughout the semester.","best_comment_first":"One of my favorite seminars taken within the English department.","course_id":"109348","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=fdef44c12070ebab64bbfe179a577cd7d6d558affbd057c71f999f85a36f265389c011ff85c626fdfe24ef7fcf49e913&ReportType=2&regl=en-US"},{"course_code":"ENGLISH CLAR","course_title_2026":"Getting the Words Right: The Art of Revision","course_score_mean":4.88,"rec_score_mean":4.88,"gem_probability_mean":0.0,"sentiment_score_median":0.66815,"best_gem_comment":"","workload_score_mean":6.5,"best_gem_comment_short":"","best_comment":"This is possibly my favorite course I've taken at Harvard. It's just amazing and such a rare and unique experience. Laura is phenomenal and I felt like I grew exponentially as a writer. My peers were so thoughtful and passionate and it was such a wonderful space to be in this semester. I cannot recommend this course enough!","best_comment_short":"My peers were so thoughtful and passionate and it was such a wonderful space to be in this semester.","best_comment_first":"This is possibly my favorite course I've taken at Harvard.","course_id":"222517","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=42e972e844b781ccbf7e23b93683a49e94b6074ca5778ec3d5a1425efffde5e508a6b755397bd68083722939930611d9&ReportType=2&regl=en-US"},{"course_code":"GOV 94SAF","course_title_2026":"E&L Safra Undergraduate Ethics Fellowship Seminar","course_score_mean":4.88,"rec_score_mean":4.88,"gem_probability_mean":0.0,"sentiment_score_median":0.9809,"best_gem_comment":"","workload_score_mean":7.75,"best_gem_comment_short":"","best_comment":"Please take this course. It is not easy, and it is not all smooth, but it is a fantastic academic experience. You will learn a lot, including valuable academic skills, and you will gain an inquisitive perspective into many issues. Professor Applbaum will push your limits but he cares a great deal about his students doing well, is very insightful, and is incredibly kind. He challenges his students in a unique way that might feel overwhelming sometimes but it is incredibly thoughtful, thought–provoking, and helpful.","best_comment_short":"Professor Applbaum will push your limits but he cares a great deal about his students doing well, is very insightful, and is incredibly kind.","best_comment_first":"Please take this course.","course_id":"109942","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c7bf288183610190be4fb21a8472b5e9db201d4b5acb74cdef392254dea9ff0fd2db935f47c72cdaed252bf4d628f273&ReportType=2&regl=en-US"},{"course_code":"FYSEMR 23K","course_title_2026":"Insights from Narratives of Illness","course_score_mean":4.88,"rec_score_mean":4.75,"gem_probability_mean":0.0,"sentiment_score_median":0.9302,"best_gem_comment":"","workload_score_mean":4.13,"best_gem_comment_short":"","best_comment":"This was my favorite course I've taken at Harvard, and one of my favorite educational experiences ever  — it's a perfect blend of medicine, ethics\/philosophy, and literary\/journalistic analysis,  so there's something for everyone and you get to meet all types in this class. Dr. G is so kind and knowledgable, and is an incredible guide, mentor, and resource. I would 100% recommend this course to anyone — regardless of if you're interested in medicine, you'll get something really meaningful out of it.","best_comment_short":"This was my favorite course I've taken at Harvard, and one of my favorite educational experiences ever  — it's a perfect blend of medicine, ethics\/philosophy, and literary\/journalistic analysis,  so there's something for everyone and you get to meet all types in this class.","best_comment_first":"This was my favorite course I've taken at Harvard, and one of my favorite educational experiences ever  — it's a perfect blend of medicine, ethics\/philosophy, and literary\/journalistic analysis,  so there's something for everyone and you get to meet all types in this class.","course_id":"117969","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=85e8cee4f638093ce351d1e623e3029c34c04740606494efbcb2ac47c30e489146960b547a2ecf0768a4d146a93ba02e&ReportType=2&regl=en-US"},{"course_code":"ANE 120B","course_title_2026":"Introduction to the Hebrew Bible\/Old Testament 2: Latter Prophets and Writings","course_score_mean":4.88,"rec_score_mean":4.63,"gem_probability_mean":0.0,"sentiment_score_median":0.8765,"best_gem_comment":"","workload_score_mean":4.71,"best_gem_comment_short":"","best_comment":"If you are at all interested in the Hebrew Bible \/ Old Testament, please take this class. Prof. Teeter is so knowledgeable and is so skilled at drawing out the rich tapestry or literary art and meaning in these texts. He is a pioneer in his approach to reading the Hebrew Bible, and it is a privilege to learn from him. You should consider taking this course even if you have already learned the Old Testament in a personal religious context. As an evangelical, I grew in my faith and appreciation for God's Word through this text. You may not agree with everything Prof. Teeter or your classmates say (you will agree with a lot of it though!), and it will be time well spent learning about and engaging with these ideas.","best_comment_short":"As an evangelical, I grew in my faith and appreciation for God's Word through this text.","best_comment_first":"If you are at all interested in the Hebrew Bible \/ Old Testament, please take this class.","course_id":"126065","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7798483af9b2677c1b361c4fa96610e3bca624ac3ffed10988e9810fe6fe7932af9fc4cada312a9b103e34dad037734e&ReportType=2&regl=en-US"},{"course_code":"FT 101B","course_title_2026":"Elementary Filipino (Tagalog) II","course_score_mean":4.88,"rec_score_mean":4.88,"gem_probability_mean":0.0,"sentiment_score_median":0.9099,"best_gem_comment":"","workload_score_mean":4.71,"best_gem_comment_short":"","best_comment":"Elementary Tagalog has been one of the best experiences of my college career so far. This course gave me so much room to grow in my language proficiency and connect with my culture while meeting peers who were trying to do the same. Ate Lady is one of the most caring, engaged educators at Harvard, and taking any class with her is a privilege. I look forward to continuing to learn Tagalog because of the passion and enthusiasm she shows for her work. If you have ever wanted to learn the language and learn more about the Philippines while you're at it, this is the best place for you.","best_comment_short":"Ate Lady is one of the most caring, engaged educators at Harvard, and taking any class with her is a privilege.","best_comment_first":"Elementary Tagalog has been one of the best experiences of my college career so far.","course_id":"223825","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=5f12c5d5bcdad4e6af2785b906a14d1c50947272685bc0b58ac2ed3ca606df8dce52bd751e70a841ba862a7ab95dd1ed&ReportType=2&regl=en-US"},{"course_code":"AFVS 53AR","course_title_2026":"Fundamentals of Animation","course_score_mean":4.88,"rec_score_mean":4.88,"gem_probability_mean":0.0,"sentiment_score_median":0.9544,"best_gem_comment":"","workload_score_mean":7.0,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS!!!!!! As a fundamentals\/beginners class, you don't need any prior art experience or even need to know how to draw. This class is all about learning from scratch in all sorts of different mediums. Some of them are:– 2D animation (drawn)– sand– clay– puppets– paper on layered glass (very cool)– stop motionJust so so cool. Every week there are exercises (not assignments, and as far as I could tell, not graded) where you learn a new medium. So one class will be dedicated to learned how to use Adobe After Effects, and the exercise that week will be to create a short (maybe 30 second?) long video with some of the stuff you learned. You're not graded on how good the thing you made is, just the fact that you learned how to use anything at all. It's literally the perfect environment for learning because you're encouraged to just mess around.The second–ish half (or maybe last third? time has all muddled up for me now) of the semester is dedicated to the final project. So the first half is working on a specific new tool each week and the second one is mostly self–work. After each week you will have ended up learning a bunch of new techniques and you'll have so many new tools at your disposal, that you can start pitching and idea for a final project. Some people made films that were 2–3 minutes long, and others under a minute. Every single student, with or without prior art experience, made amazing works and I'm so glad to have been able to see them all (and see them being made!)There are weekly screenings every Friday from 12pm–2pm (unless the schedule changes, but it's roughly 2 hours) where we watch a bunch of short animations. Just so so cool. If you can't go, you can make it up by watching them on your own time and submitting your thoughts on each one, but I can't recommend enough to show up in person because 1. you won't have to write anything, and 2. the in–person discussions are just so great.Lastly, the 4–hour long class can seem daunting, but it really does fly by. We take breaks half–way through (I use mine to get lunch lol) and plus it's not 4 hours of intense work, you're mostly sitting around comfortably working on your animation or messing around with puppets or clay.I've learned so much from this class from specific skills to how animation works as a process in general. I feel so much more prepared to animate more in the future, and will be taking the intermediate class too next semester!Ruth is AMAZING, and so is Michael!! They are so kind, patient and knowledgeable and it was just an honor to have been able to learn so much from them. I had a hard time with my final project because I'm a perfectionist, completely overestimated how much I could get done in the time I had AND started way too late (horrible combo), but Ruth and Michael helped me so much throughout the process. They really guided me on how to make my animation better, what to cut, and just generally how to go about it. I seriously cannot recommend enough that you take this class. Even if you're not an AFVS concentrator, you'll have such a fun time taking this as an elective and you'll be able to say you made animations during college lol!ONCE MORE TAKE THIS CLASS IT'S AWESOME !!!!","best_comment_short":"Even if you're not an AFVS concentrator, you'll have such a fun time taking this as an elective and you'll be able to say you made animations during college lol!ONCE MORE TAKE THIS CLASS IT'S AWESOME !","best_comment_first":"TAKE THIS CLASS!!!!!!","course_id":"110676","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f1a72eaa70626f2fe3ba582f67f13c891671d7ebfe1535ec16e8e47295727be822f845e55624973bcbd7e1907a18f7af&ReportType=2&regl=en-US"},{"course_code":"GOV 1090","course_title_2026":"Biotech Ethics","course_score_mean":4.87,"rec_score_mean":4.89,"gem_probability_mean":0.0,"sentiment_score_median":0.8908,"best_gem_comment":"","workload_score_mean":4.79,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS! No assignments, lectures are super interesting, and sections are engaging. I am a CS person so was quite apprehensive going into this class, but I found it easy to participate and the course is perfectly designed to give you a nice intro to a philosophy–esque course. Professor Imparato is SO AWESOME and he truly cares about each and every student. Definitely take advantage of his meals and office hours! He is sooooo amazing.","best_comment_short":"I am a CS person so was quite apprehensive going into this class, but I found it easy to participate and the course is perfectly designed to give you a nice intro to a philosophy–esque course.","best_comment_first":"TAKE THIS CLASS!","course_id":"225825","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3ae77a527f3cc1ca524cde0a845bd9c598e4078706983153b38e997c1aa438a3fd249f3fa06e0f6685f07839fe98986e&ReportType=2&regl=en-US"},{"course_code":"EDST 135","course_title_2026":"Education Across Cultures: Beliefs and Practices in Schools and Families","course_score_mean":4.87,"rec_score_mean":4.78,"gem_probability_mean":0.0,"sentiment_score_median":0.9134,"best_gem_comment":"","workload_score_mean":4.13,"best_gem_comment_short":"","best_comment":"Very easy course that can also be very personally fulfilling. Class is long, but they try ot make it engaging. Assignments are easy and also pretty fun if you are genuinely interested in the topic. I think personal interest in the subject of education is really important for how much you enjoy and get out of this class. I had very strong personal reasons for being interesting in the subject, which I had many opportunities to explore through class assignments – that is a really valuable and hard to find opportunity!!The class definitely has an objective in mind, which is to make you more culturally sensitive. I think that's important, but if you aren't interested in learning about that, this class will be annoying to you.","best_comment_short":"I had very strong personal reasons for being interesting in the subject, which I had many opportunities to explore through class assignments – that is a really valuable and hard to find opportunity!","best_comment_first":"Very easy course that can also be very personally fulfilling.","course_id":"223835","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1b982fc1fa669fce4c93945d47d96d25f77e67666cd6b048e23400f34245f65ae222c174584d5f99b0764d0a054ba09a&ReportType=2&regl=en-US"},{"course_code":"HEB 110","course_title_2026":"Research in Human Biomechanics and Physiology","course_score_mean":4.86,"rec_score_mean":4.71,"gem_probability_mean":0.0,"sentiment_score_median":0.876,"best_gem_comment":"","workload_score_mean":6.0,"best_gem_comment_short":"","best_comment":"This class is a great way to get started in HEB and science research, especially if you're interested in Prof. Lieberman's work (which is wide–ranging and varies by semester, so feel free to ask). You get to have your own project (as part of a larger one of a grad student or completely new one), collect data, and present the results in a very casual, low–stakes setting. There isn't much class structure since everyone is working on different timelines, which adds nice flexibility to your weekly schedule. Only point is that research does not care that you're taking a class. I had no presentable\/publishable data at the end, though it was still good practice to write an intro and methods and present \"results.\"","best_comment_short":"This class is a great way to get started in HEB and science research, especially if you're interested in Prof. Lieberman's work (which is wide–ranging and varies by semester, so feel free to ask).","best_comment_first":"This class is a great way to get started in HEB and science research, especially if you're interested in Prof. Lieberman's work (which is wide–ranging and varies by semester, so feel free to ask).","course_id":"127206","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0590ca34379317cea14b61516281d405382d61c785e88cd7d520f8cb34495a1ccea7edfa7bae6d2dafc73d144ab5a368&ReportType=2&regl=en-US"},{"course_code":"AFRAMER 223","course_title_2026":"Storied Lives: Methods in Oral History","course_score_mean":4.85,"rec_score_mean":4.95,"gem_probability_mean":0.0,"sentiment_score_median":0.3612,"best_gem_comment":"","workload_score_mean":6.47,"best_gem_comment_short":"","best_comment":"Take it! It's beautiful. A strong emphasis on method with rich thought–provoking readings and a professor who is thoughtful, warm, capable, and invested in your well–being. You won't be disappointed.","best_comment_short":"A strong emphasis on method with rich thought–provoking readings and a professor who is thoughtful, warm, capable, and invested in your well–being.","best_comment_first":"Take it!","course_id":"225837","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ea4b6fdffd31e0120d2c01dd51ea0e7c50548353ccfc32b70e5c18d40c3a4ee5b3fa1767016828fabc83d703435e322b&ReportType=2&regl=en-US"},{"course_code":"WOMGEN 1311","course_title_2026":"Race, Gender, and Medicine","course_score_mean":4.85,"rec_score_mean":4.69,"gem_probability_mean":0.0,"sentiment_score_median":0.9392,"best_gem_comment":"","workload_score_mean":5.58,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS NOW! Best class I have ever taken at Harvard hands down. Roberto is excellent and such a thoughtful human; he is extremely knowledgeable not only about this topic but all the interdisciplinary approaches that come with it. He gave us such amazing feedback and really championed our intellectual pursuits and contributions. Taking this class was such a blessing and absolutely changed the way I view medicine and many of the political movements of today. It was truly the transformative experience Harvard advertises!","best_comment_short":"He gave us such amazing feedback and really championed our intellectual pursuits and contributions.","best_comment_first":"TAKE THIS CLASS NOW!","course_id":"224952","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e6c5e72f7e3d0a6976e44d79665f4b35b3078cdf10524d14d97b5959414585e7d074432670d2cd228adb15cac141a240&ReportType=2&regl=en-US"},{"course_code":"MBB 980EE","course_title_2026":"Neuroscience of Music: Clinical Applications across the Lifespan","course_score_mean":4.83,"rec_score_mean":4.82,"gem_probability_mean":0.0,"sentiment_score_median":0.9626,"best_gem_comment":"","workload_score_mean":5.3,"best_gem_comment_short":"","best_comment":"TAKE THIS COURSE!! First and foremost, Dr. Maria Pranjic is just the most wonderful teacher: she is so incredibly versed in neuroscience of course, but as a musician herself she brings a unique and holistic perspective to this course (which has made it such an incredible experience).  She is kind and cultivates community, as well as making sure class runs efficiently and seriously – I have gone from essentially a neuroscience beginner to generating multiple projects and a final paper within one semester because of her investment in my learning. Secondly, this topic is so very important, and Harvard having this discipline (music\/arts\/creativity and the brain) as a course in the MBB department is absolutely essential. Come prepared to work hard and you will reap the benefits of this amazing course! I sincerely hope the MBB department will continue adding and supporting more courses like this one (for everyone's sake, but selfishly so I can take them too!) :)","best_comment_short":"She is kind and cultivates community, as well as making sure class runs efficiently and seriously – I have gone from essentially a neuroscience beginner to generating multiple projects and a final paper within one semester because of her investment in my learning.","best_comment_first":"TAKE THIS COURSE!!","course_id":"225882","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c0c5c3d7f10163ff86d813fee8a528d0fe8c9a3989e0b08c0794a988fcd125aaf649b7431d3d67f2256e162bc0e7e20a&ReportType=2&regl=en-US"},{"course_code":"HIST 97B","course_title_2026":"\"What is Intellectual History?\"","course_score_mean":4.83,"rec_score_mean":4.73,"gem_probability_mean":0.0,"sentiment_score_median":0.9344,"best_gem_comment":"","workload_score_mean":9.83,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS! Prof. Blair is one of the best professors you'll get to meet at Harvard. She's super knowledgeable about a variety of topics (even tho she specializes in French intellectual history) and has always been so delightful and willing to help. Saffron is a wonderful tutor and this class is much more fun and approachable because of her. One thing I really appreciated about this class was the amount of feedback you get. First you attend a 4–person peer review session every 3 weeks and get feedback from your classmates and very detailed comments from Saffron. After you submit the draft you get another detailed feedback from Prof. Blair before you actually submit the final version of each essay. The final paper also allows a lot of freedom when you choose the topic because intellectual history is super broad. Really happy that I was able to spend about 2 months on a topic I'm super interested in and eventually craft and polish it with my classmates, Saffron, and Prof. Blair.","best_comment_short":"She's super knowledgeable about a variety of topics (even tho she specializes in French intellectual history) and has always been so delightful and willing to help.","best_comment_first":"TAKE THIS CLASS!","course_id":"109927","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=de19362478db86877d45b7b1f42e75b7c5b10b14a4f56119db0f581ceeca75ebc5b94740c7db553bbc5a37f2b1ee5393&ReportType=2&regl=en-US"},{"course_code":"HIST 16N","course_title_2026":"The Neoliberal Age","course_score_mean":4.82,"rec_score_mean":5.0,"gem_probability_mean":0.0,"sentiment_score_median":0.94595,"best_gem_comment":"","workload_score_mean":6.2,"best_gem_comment_short":"","best_comment":"*** This class is AMAZING. Highly recommend to all. Danny is an amazing teacher, one of the best I have had during my time at Harvard. He really engaged the class and encouraged all to speak their mind. Kept all conversations and classes relevant and value–add. Really really really enjoyed this class.","best_comment_short":"Danny is an amazing teacher, one of the best I have had during my time at Harvard.","best_comment_first":"*** This class is AMAZING.","course_id":"225966","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=836894d6987f7ab72ec10ab3f88584ebd9317b9e388bb13f83340c46359335772af5f724d40d3d008453d6ee6e775b76&ReportType=2&regl=en-US"},{"course_code":"GOV 94EM","course_title_2026":"Crime, Responsibility, and the Law","course_score_mean":4.82,"rec_score_mean":5.0,"gem_probability_mean":0.0,"sentiment_score_median":0.9126,"best_gem_comment":"","workload_score_mean":5.5,"best_gem_comment_short":"","best_comment":"Gabe is one of the best professors I have had at Harvard and this Gov 94 is one of the best classes I have taken (and his other Gov 94 is another one of my favorite classes as well). This course is everything you could want: the reading isn't too consuming, but it's immensely engaging and you learn a lot from it; the discussions are rich, very related to real world events, and they push your thinking; the material is exciting to think about especially if you're interested in the American legal system; Gabe is an encouraging instructor who provides great feedback and makes himself very available for office hours; Gabe also uses Poll Everywhere to direct class discussion quite often which I think is very effective. In short, being a part of both his seminars was a highlight of this past school year and I think anyone would be really lucky to take this class. I hope you will enjoy it as much as I did!","best_comment_short":"This course is everything you could want: the reading isn't too consuming, but it's immensely engaging and you learn a lot from it; the discussions are rich, very related to real world events, and they push your thinking; the material is exciting to think about especially if you're interested in the American legal system; Gabe is an encouraging instructor who provides great feedback and makes himself very available for office hours; Gabe also uses Poll Everywhere to direct class discussion quite often which I think is very effective.","best_comment_first":"Gabe is one of the best professors I have had at Harvard and this Gov 94 is one of the best classes I have taken (and his other Gov 94 is another one of my favorite classes as well).","course_id":"213657","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4cda27bad8349c1c4a8eb5ea905a676931720ebd7b93fe10284af9fa562b2c1d6fa1cc80006d6d7e5c2d40ccff2d3c2d&ReportType=2&regl=en-US"},{"course_code":"SLAVIC 118","course_title_2026":"Reading Tolstoy’s War and Peace","course_score_mean":4.82,"rec_score_mean":4.78,"gem_probability_mean":0.0,"sentiment_score_median":0.9251,"best_gem_comment":"","workload_score_mean":6.14,"best_gem_comment_short":"","best_comment":"This was among the best courses I've taken at Harvard and I strongly recommend taking it. Prof. Buckler and Nadia really deeply cared about everyone in the class – they went out of their way to learn everyone's names in the first few weeks of class, and the vibes were always incredibly friendly and collegial, especially in section. If you've ever considered reading War and Peace or been daunted by the size, this is your perfect chance to take it with friendly and supportive teaching staff and peers to really enhance your experience. None of the assignments are particularly daunting (there's just two short response papers, an oral exam, and an open–nended final project), and Prof. Buckler and Nadia are super interested in helping you and making sure you do well on those assignments. The depth of Prof. Buckler's knowledge of War and Peace, and of Russian literature more broadly, is staggering, and it was a truly awe–inspiring experience to sit in lecture and listen to her speak about it. My one warning would be: be prepared to do ~120 pages of reading every week, consistently, because you don't want to fall behind on the reading. I would recommend carving out several 1–hour slots throughout the week to sit down and read.","best_comment_short":"None of the assignments are particularly daunting (there's just two short response papers, an oral exam, and an open–nended final project), and Prof. Buckler and Nadia are super interested in helping you and making sure you do well on those assignments.","best_comment_first":"This was among the best courses I've taken at Harvard and I strongly recommend taking it.","course_id":"218532","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=5efea21a3b40d19340b5612235d2e80e6a4ba8565f6dfe6788835fc313b771dc2747e812f8520b56b0003cd517b34491&ReportType=2&regl=en-US"},{"course_code":"HIST-LIT 93AH","course_title_2026":"Music, Politics, and Protest in the United States","course_score_mean":4.8,"rec_score_mean":4.89,"gem_probability_mean":0.0,"sentiment_score_median":0.9358,"best_gem_comment":"","workload_score_mean":5.75,"best_gem_comment_short":"","best_comment":"This was a wonderful class! The seminars were varied and interesting, though I do wish we did more historical analysis rather than just a survey of many different types of sonic protests. The highlight was the assignments; the term paper and final project were both fascinating and really rewarding experiences, and Caitlin did a great job of ensuring we gained the background to make such ambitious works.","best_comment_short":"The highlight was the assignments; the term paper and final project were both fascinating and really rewarding experiences, and Caitlin did a great job of ensuring we gained the background to make such ambitious works.","best_comment_first":"This was a wonderful class!","course_id":"224872","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=31b363587bc44a465c17ef4c5e64ccec0935ee993e41c8220adce9fc23090db87eabdb0a676fa628878bb3bb0c68bdbc&ReportType=2&regl=en-US"},{"course_code":"FYSEMR 42C","course_title_2026":"The Role of Government","course_score_mean":4.8,"rec_score_mean":4.78,"gem_probability_mean":0.0,"sentiment_score_median":0.928,"best_gem_comment":"","workload_score_mean":5.0,"best_gem_comment_short":"","best_comment":"DO WHATEVER YOU CAN TO TAKE THIS CLAS!!! ITS AMAZING!! One thing is it is more work than any other semnar I have heard of, but it is so worth it.  It takes a group of diverse students from Harvard's first year class and brings them together to debate relevant topics. Getting to meet and hear different people's perspectives was extremely beneficial for my semester and my learning overall. This course is the best example of academic vitality that I have experienced while at Harvard. I felt comfortable expressing my views and I think others did as well.  Furthermore,  I felt like I was surrounded by the nation's best and brightest and I learned as much from them as I learned from the course material.  I think this course also did a great job of fostering interpersonal relationships between students, and I feel like I gained several friends from taking this course. Honestly, I think university officials and professors across the university should look to this course as the epitome of what a Harvard course should be. Professor Hart is so funny and is a great facilitator of discussions. To be honest, I think I was not passionate about some of the topics, and some of the topics felt a little less relevant to me. For example, I didn't love the weeks about government nudges or citizens assemblies, but overall the topics were so intersting. Professor Hart is actually the best he is just so wholesome and has an English accent which makes the class really fun to listen to.","best_comment_short":"I think this course also did a great job of fostering interpersonal relationships between students, and I feel like I gained several friends from taking this course.","best_comment_first":"DO WHATEVER YOU CAN TO TAKE THIS CLAS!!!","course_id":"160196","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c85356702eb7b7df80a8833f109236b135c1cbc882a5e721f328a26efbf5dfc8755c4fca38b3b15961bd8b61d17c451c&ReportType=2&regl=en-US"},{"course_code":"ITAL 50","course_title_2026":"Advanced Italian II: Advanced Written Expression - Writing for Social Justice","course_score_mean":4.8,"rec_score_mean":4.9,"gem_probability_mean":0.0,"sentiment_score_median":0.9289,"best_gem_comment":"","workload_score_mean":7.0,"best_gem_comment_short":"","best_comment":"This is a really worthwhile class if you’re looking to improve your Italian and talk about meaningful topics. You’ll do a lot of speaking and discussion, which can feel intimidating at first, but it really helps your confidence. The topics are super relevant (things like feminism, social justice, Italian culture today, etc etc) so it’s not just textbook stuff.Professoressa Chiara Trebaiocchi is great. She’s really understanding and supportive, but she also expects you to put in the effort and will definitely push you to get better. The workload can be a lot at times, so just stay on top of things and don’t leave stuff for the last minute. If you’re willing to participate and put in the work, you’ll get a lot out of this course.","best_comment_short":"The topics are super relevant (things like feminism, social justice, Italian culture today, etc etc) so it’s not just textbook stuff.Professoressa Chiara Trebaiocchi is great.","best_comment_first":"This is a really worthwhile class if you’re looking to improve your Italian and talk about meaningful topics.","course_id":"127889","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=bd19a2e6d1e440d3836c231799d37853cb0eb040c45d84c9f2466dc4767fe3530d1155d7b6f182f11cfe503a50a9e538&ReportType=2&regl=en-US"},{"course_code":"RUSS AAB","course_title_2026":"Elementary Russian (Intensive)","course_score_mean":4.8,"rec_score_mean":4.5,"gem_probability_mean":0.0,"sentiment_score_median":0.8654,"best_gem_comment":"","workload_score_mean":14.3,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS!!! If you are at all interested in Russian, take this class absolutely!! Pastushenkov is such an amazing teacher and makes it so worth it to get up every day. Don't feel horrified by the M–F 9am schedule – it gets you into a great routine and gets your day started early. I made such strong relationships with all the other kids in my class – by the end of the semester, we were doing study sessions together in the library and hanging out outside of class. I learned more Russian than I thought was possible in a few months, and I am already enrolled in the Intermediate for next semester. This is an incredibly engaging and rewarding class. Make sure you have the time to commit to the courseload, though – they don't call it an intensive for nothing. It is the effort and time of two classes, that's why it's 8 credits. Make sure you are committed to spending the time to doing homeworks and studying for the tests, because it doesn't just pay off in grades, it pays off in how much of the language you actually end up learning.","best_comment_short":"Don't feel horrified by the M–F 9am schedule – it gets you into a great routine and gets your day started early.","best_comment_first":"TAKE THIS CLASS!!!","course_id":"113925","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7fd8051eef07b571a4a263d0d47a1c7cc9a5e7d33fffc7528827cde7b4a770e31ecadda26501dcba7615e609c2983a9e&ReportType=2&regl=en-US"},{"course_code":"SOC-STD 50","course_title_2026":"Foundations of Social Science Research","course_score_mean":4.78,"rec_score_mean":4.71,"gem_probability_mean":0.0,"sentiment_score_median":0.8235,"best_gem_comment":"","workload_score_mean":5.5,"best_gem_comment_short":"","best_comment":"This course is fantastic!!! Matt is such an incredible teacher. I literally have never had an instructor at Harvard that has cared more about their class or students than Matt. On every assignment he gives way more feedback than you could have expected, he's always incredibly available and helpful when you meet with him, and makes a methods course as engaging as possible. He is incredibly well versed in a wide range of literature, and gave me so many great suggestions about scholarly schools to look at that might be helpful to apply to my research context. If you put in the work, engage in the classes, and do a good job with the scaffolding assignments, this can be such an incredible course for building to your thesis.","best_comment_short":"He is incredibly well versed in a wide range of literature, and gave me so many great suggestions about scholarly schools to look at that might be helpful to apply to my research context.","best_comment_first":"This course is fantastic!!!","course_id":"213384","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b45303dd4ba8b198d4127448bca3e0a0540daf22f6e7cc040dfba18219fda4df7e0efebcd224d16b1243b7f41165bcfc&ReportType=2&regl=en-US"},{"course_code":"HIST-LIT 90GZ","course_title_2026":"Magic and Mythology in Latin America and the Caribbean","course_score_mean":4.78,"rec_score_mean":4.75,"gem_probability_mean":0.0,"sentiment_score_median":0.7845,"best_gem_comment":"","workload_score_mean":6.22,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS! The course materials are so interesting, meaningful, and must be treated with care. The group of students are wonderful and the work you do in the class is truly special and super self–led in that you get a lot of creative freedom.  I was able to learn so much about my own culture and identity, and this is all due to the wonderful teaching of Professora Cristina Garcia Navas. I am so grateful that courses like this exisit!","best_comment_short":"The group of students are wonderful and the work you do in the class is truly special and super self–led in that you get a lot of creative freedom.","best_comment_first":"TAKE THIS CLASS!","course_id":"224871","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e826c2e1131d0ff7e81f6b2623ab16c1a8731e0ef7c5db508bc5c7dbd128adfb863fa1cbfbcabeaca8c68b0968a17c2d&ReportType=2&regl=en-US"},{"course_code":"BIOSTAT 231","course_title_2026":"Statistical Inference I","course_score_mean":4.78,"rec_score_mean":4.63,"gem_probability_mean":0.0,"sentiment_score_median":0.8796,"best_gem_comment":"","workload_score_mean":15.63,"best_gem_comment_short":"","best_comment":"This was, without doubt, one of my favorite classes at HSPH. It was uncomfortable, fast–paced, and I needed to work (very slowly) through the calculus and linear algebra to understand what Professor Wang was teaching. Doing the homework and exams was a truly humbling experience, but I came out of the course with a newfound sense of confidence in understanding advanced mathematical and statistical concepts, and with an insatiable desire to learn more. I loved that every morsel of knowledge in this class was earned – there was no other way to learn asymptotic theory without, for example, sitting down and understanding how Taylor series are involved. If you are in search of a class that is taught by a wonderful (and very funny!) professor and TFs, with ample support, and in a manner that will change the way you see models and estimation (the bread and butter of many public health disciplines), please do this class. It is so incredibly rewarding.","best_comment_short":"Doing the homework and exams was a truly humbling experience, but I came out of the course with a newfound sense of confidence in understanding advanced mathematical and statistical concepts, and with an insatiable desire to learn more.","best_comment_first":"This was, without doubt, one of my favorite classes at HSPH.","course_id":"119845","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d79116126882891d6699725ac2823b5936243a95b92d94b2ef7d0887221a5cd4432f7a5c842623e9f2871cfc549d897d&ReportType=2&regl=en-US"},{"course_code":"PSY 1325","course_title_2026":"The Emotional, Social Brain","course_score_mean":4.77,"rec_score_mean":4.77,"gem_probability_mean":0.0,"sentiment_score_median":0.94095,"best_gem_comment":"","workload_score_mean":4.42,"best_gem_comment_short":"","best_comment":"Take take take! This course topic is so interesting, the assignments were all fair, and Dr. Phelps is a wonderful, accommodating teacher. There are four essays, each about 2–3 pages, and they can be revised based on Dr. Phelps' feedback. The final project is creative (I made a video, lots of people made podcasts or presentations), which is super fun and made me even more engaged in my topic. You read papers for each class, and then get to hear from the first authors as guest speakers during class, which was a super cool opportunity. Highly recommend!","best_comment_short":"The final project is creative (I made a video, lots of people made podcasts or presentations), which is super fun and made me even more engaged in my topic.","best_comment_first":"Take take take!","course_id":"216792","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0e1ddf4e0649b1b6409eb5490e7fb29d7cbc987187c1988b0f266ce1f1bb39ef4f39ed0ae3f257a92c741477c9d834ff&ReportType=2&regl=en-US"},{"course_code":"HAA 100R","course_title_2026":"Sophomore Excursion Course","course_score_mean":4.75,"rec_score_mean":4.88,"gem_probability_mean":0.0,"sentiment_score_median":0.9089,"best_gem_comment":"","workload_score_mean":4.25,"best_gem_comment_short":"","best_comment":"Even though you might not study the field, I’d still recommend taking HAA100r. It’s such a great opportunity to meet other concentrators and really get to know them well – I’ve become close friends with many of them since the excursion. It was also so nice to know the professors who are all really kind and approachable!","best_comment_short":"It’s such a great opportunity to meet other concentrators and really get to know them well – I’ve become close friends with many of them since the excursion.","best_comment_first":"Even though you might not study the field, I’d still recommend taking HAA100r.","course_id":"124385","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f37d0114bad58a1aa40bba3fc8606448bd3abfce56e60743a744db5761dc8d2db4f2ae0bfefe370791914346eb109f1b&ReportType=2&regl=en-US"},{"course_code":"SOC-STD 68LS","course_title_2026":"Land, Space, and Politics","course_score_mean":4.75,"rec_score_mean":4.75,"gem_probability_mean":0.0,"sentiment_score_median":0.9246,"best_gem_comment":"","workload_score_mean":6.75,"best_gem_comment_short":"","best_comment":"A fantastic course with a truly meaningful final project. The final is what you make of it, it has a lot of creative freedom, with great encouragement from the course to engage in valuable academic inquiry. The course material comes together well at the end for a valuable understanding of how we conceptualize the space we exist in and how our definitions and understanding of land are extremely valuable to our history and how we function in the world. I recommend this class to students in any field, STEM, social sciences, or humanities. Of course a social science background is helpful, but I believe the format and content of the course could be really valuable to someone from a different field wishing to gain perspective. I highly recommend this course.","best_comment_short":"The final is what you make of it, it has a lot of creative freedom, with great encouragement from the course to engage in valuable academic inquiry.","best_comment_first":"A fantastic course with a truly meaningful final project.","course_id":"225845","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c1e4637e12eda54d82e1859d9bdaa86fccb2200595fffcdfa3211166b119149ac9fddaa55da341946479393efc198c3e&ReportType=2&regl=en-US"},{"course_code":"MATH 55B","course_title_2026":"Studies in Real and Complex analysis","course_score_mean":4.74,"rec_score_mean":4.44,"gem_probability_mean":0.0,"sentiment_score_median":0.84015,"best_gem_comment":"","workload_score_mean":17.85,"best_gem_comment_short":"","best_comment":"PLEASE TAKE THIS CLASS! If you're reading this, you probably took 22a or 25a last semester, and considering moving up because of whatever. If so, please please please take the class. I was in the exact same situation having not taken 55a last semester, and wanted to challenge myself further with more math. Switching to 55b was probably the absolute best decision I made this semester and I have absolutely zero regrets about doing so. Yes, the workload was pretty insane at points (prepare for a LOT of all nighters), but you will definitely get through it. You also won't need much content from 55a. There's a bit of algebra when it comes to algebraic topology, but it is completely learnable when you get to that point. There was an in person midterm which was pretty brutal, but it was a small percentage of the grade so it really didn't matter in the end. Most of your grade will be from psets, so if you invest a lot of time into those and find a good group of friends to work on them with, you will be absolutely fine. Prof. Auroux gives really good lectures, and I would try go to them as much as possible, but the lecture notes are also a very very good resource (pretty much all I used).Basically, if you took 22a or 25a and want more, just take the class and don't think about it anymore. The first few weeks might be a bit rough as you get used to the workload and find people to work with, but once things settle down, it will probably end up being your favorite class, as this is exactly what happened in my case.  Taking the class allowed me to meet who I now consider my best friends, so I owe so much to the class for that.Just try it! You won't regret it!","best_comment_short":"Taking the class allowed me to meet who I now consider my best friends, so I owe so much to the class for that.Just try it!","best_comment_first":"PLEASE TAKE THIS CLASS!","course_id":"112871","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2fd31d8a98222007e5a56d891cec1ed98fc63f25eccf531ea4548ee4318e2cba9e7bb80b1e22ce647550181b06b83f73&ReportType=2&regl=en-US"},{"course_code":"SOCIOL 1023","course_title_2026":"Political Sociology","course_score_mean":4.73,"rec_score_mean":4.77,"gem_probability_mean":0.0,"sentiment_score_median":0.9565,"best_gem_comment":"","workload_score_mean":5.64,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS!! This was by far my favorite class this semester. Big concepts like power and the state can feel so confusing but this class breaks things down incredibly well. Mandic is the best and is the most engaging lecturer I have ever had. The coursework is super manageable and tests are fair. This being said the section lead is super important. Kyle––who unfortunately is not staying at Harvard––was 2025 TF and was wonderful. He perfectly balanced Mandic's teaching style. Mandic can get a bit too exited and forget to go over some concepts from class but Kyle always regrounded us and made sure everything made sense.","best_comment_short":"Mandic is the best and is the most engaging lecturer I have ever had.","best_comment_first":"TAKE THIS CLASS!!","course_id":"159779","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=15fd9b5c1d8f5ba22337ed81db07076a4d449fa4360eaf30571c6b5f63140863df86dded6e30b96a40b350ff461152e4&ReportType=2&regl=en-US"},{"course_code":"SOCIOL 2204","course_title_2026":"Classical Social Theory","course_score_mean":4.73,"rec_score_mean":4.8,"gem_probability_mean":0.0,"sentiment_score_median":0.875,"best_gem_comment":"","workload_score_mean":10.18,"best_gem_comment_short":"","best_comment":"I learned a lot from this course, and I definitely recommend it. Chris is a phenomenal professor who clearly cares about his students and goes above and beyond to support them. Be prepared to read and write reflections on your reading on core classical social theorists. Class is very engaging and helpful to solidify core concepts.","best_comment_short":"Chris is a phenomenal professor who clearly cares about his students and goes above and beyond to support them.","best_comment_first":"I learned a lot from this course, and I definitely recommend it.","course_id":"117877","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=104d58a056520d292f64b7e96cca5915a2f677329c1a3f90cfb63b64901866e4a281f158c8b00e0b79b0e705df772f58&ReportType=2&regl=en-US"},{"course_code":"MATH 25B","course_title_2026":"Theoretical Linear Algebra and Real Analysis II","course_score_mean":4.71,"rec_score_mean":4.57,"gem_probability_mean":0.0,"sentiment_score_median":0.9575,"best_gem_comment":"","workload_score_mean":12.14,"best_gem_comment_short":"","best_comment":"Wes is THE GOAT. He is a phenomenal lecturer who is capable of explaining complicated material in a very accessible way. His enthusiasm and devotion to his class and the students in it are very inspiring. That being said, 25b is a hard class, definitely harder than 25a and one that is likely to kill your GPA, but you come of it with increased mathematical maturity and independence as well as proof stamina. Personally, I preferred the content of 25a, but I am more of an algebra guy, so take this as you will. If you're on the fence between 25b and 55b, I would definitely shop both especially given that next year's 25b will be taught by a different instructor. But personally, I feel like I gained a better understanding of real analysis in 25b than I would have in 55b. All in all, this was a great class with a fantastic community and an incredible instructor.","best_comment_short":"But personally, I feel like I gained a better understanding of real analysis in 25b than I would have in 55b.","best_comment_first":"Wes is THE GOAT.","course_id":"110855","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=da7c3084d7bcf226abdeca541560630837ab1bff2a8c8395da2cafad2b8598ade3ccf15448d7e509983bcb3f8e4c1252&ReportType=2&regl=en-US"},{"course_code":"ECON 980MM","course_title_2026":"Field Experiments","course_score_mean":4.71,"rec_score_mean":4.86,"gem_probability_mean":0.0,"sentiment_score_median":0.9409,"best_gem_comment":"","workload_score_mean":4.5,"best_gem_comment_short":"","best_comment":"This was one of the most fun and interesting courses I have taken at Harvard and highly highly recommend to any ec concentrators or anyone interested in research! In core economics classes, they always throw around the term \"RCT\" but rarely ever look at experiments in practice. This class is super interactive because you actually get to design those experiments and think through all the logistics as if you were going to conduct them. If you love problem–solving, this course is definitely a great fit for you. You also get to know your peers as a lot of work in class is in groups, and I have made friends through that. Finally, a significant portion of this class is presentations. People get really creative with them, and they are a ton of fun to listen to! Professor Pallais and Wilbur were amazing and always made themselves available through email and office hours, so you have a ton of support too.","best_comment_short":"If you love problem–solving, this course is definitely a great fit for you.","best_comment_first":"This was one of the most fun and interesting courses I have taken at Harvard and highly highly recommend to any ec concentrators or anyone interested in research!","course_id":"212568","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=aa522c4d9792f66acad50f4e95db1a9cecfd92d155fecbeac1d8c260c72a4105899536cfef5f901a54cc4bf8f3fc0fda&ReportType=2&regl=en-US"},{"course_code":"SOCIOL 1186","course_title_2026":"Refugees in Global Perspective","course_score_mean":4.71,"rec_score_mean":4.76,"gem_probability_mean":0.0,"sentiment_score_median":0.89235,"best_gem_comment":"","workload_score_mean":5.7,"best_gem_comment_short":"","best_comment":"TAKE TAKE TAKE this class. You will love it so much. The topics are fascinating and the lectures extremely engaging. The teaching staff is very passionate about the subject, and actively incorporate feedback from the class to ensure an open learning environment. What I especially liked about this course is how much the teaching staff genuinely cares about the students and issues studied. Prof. Mandic and Achraf are the most involved educators I met here at Harvard both in the classroom and beyond, through  the programs they organize or the opportunities they promote to students in section. The Refugee Fieldwork Program offers a possibility for students to deepen the knowledge accumulated in this course while serving communities in need for it over the summer. Only a human who cares deeply about both the topic, not just as something he teaches, but as a part of society he lives to shine light upon would be so invested to create an opportunity like this at Harvard for undergraduates. I cannot imagine a class more worth taking here than this one. You will learn so much about various aspects of forced migration and gain a deep understanding of how different asylum systems work. You will begin to see the issues surrounding forced migration from multiple perspectives and be encouraged to think about feasible solutions to address them. The assignments are super fun and engaging, and quite flexible in the way that you can research deeper the topic in the class that you are most intrigued by, while also being held to the academic standards of how Achraf would call it, \"the next big thing\". This is an amazing class and my favorite one at Harvard so far (convinced me to do sociology), so TAKE IT!!!!!!","best_comment_short":"Only a human who cares deeply about both the topic, not just as something he teaches, but as a part of society he lives to shine light upon would be so invested to create an opportunity like this at Harvard for undergraduates.","best_comment_first":"TAKE TAKE TAKE this class.","course_id":"203272","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ded41cbe601091845ccf31296c5c650959465c7a4653f7f69f1c92b16afac11f4ecde93f809c6c6aa0096abb26628691&ReportType=2&regl=en-US"},{"course_code":"ECON 2020B","course_title_2026":"Microeconomic Theory II","course_score_mean":4.7,"rec_score_mean":4.5,"gem_probability_mean":0.0,"sentiment_score_median":0.8268,"best_gem_comment":"","workload_score_mean":7.45,"best_gem_comment_short":"","best_comment":"This course is excellent.  Some PhD theory courses have the feel of \"more than you can handle, 80% material mastery is good benchmark,\" but not so with this course.  You really do have a chance to learn everything, and you have the materials and guidance to understand it all.  Bravo to Chris and Sam for an excellently designed and equally well–delivered course on game theory and equilibrium analysis.  The lectures are engaging, sections are also very useful, problem sets are fun, and the supplemental materials (Chris had shared draft textbook chapters that were just fantastic) bring you the rest of the way.  I recommend the course very highly, you will enjoy yourself and find challenges that are approachable, encouraging, and fulfilling to tackle.","best_comment_short":"I recommend the course very highly, you will enjoy yourself and find challenges that are approachable, encouraging, and fulfilling to tackle.","best_comment_first":"This course is excellent.","course_id":"113615","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=99305c0c95e33d1fae0dc8bd580e863a1c68f9ac5067f22c43634e9737bd6e92a337ac13dd4c08e19f63d6f246480347&ReportType=2&regl=en-US"},{"course_code":"HIST 1945","course_title_2026":"Slavery and Public History","course_score_mean":4.69,"rec_score_mean":4.62,"gem_probability_mean":0.0,"sentiment_score_median":0.836,"best_gem_comment":"","workload_score_mean":7.62,"best_gem_comment_short":"","best_comment":"One of the best history courses I have taken as a senior concentrator. Prof. Miles and Hannah are an incredible pair. Taking a course with Prof. Miles is a must, but especially a seminar, as she is truly fantastic at leading one – beginning with some time to know each other (not ice–breakers, but really understanding your \"why\" for the course and for caring about history in general...it built trust between us quickly, which showed in our discussions), setting high expectations for the rigor of our conversations off the bat – asking follow up questions, synthesizing our conversations, and pushing our ideas. She is truly the best at cultivating conversations that not only bring the readings to life while also pushing your critical thinking skills.Discussions were genuinely rigorous, readings were always relevant and illuminating, and the final project was a fulfilling challenge to actually put our seminar discussions into practice our discussions by having to think critically in an applied way (since the final projects were shared with the Arboretum to be implemented). If you want to be challenged in a new way as a history concentrator by being pushed to think creatively and practically (I would not recommend this to freshman\/sophomores or anyone not already familiar with history), then absolutely take this course. Prof. Miles is one of the few professors on this campus who really cares for you as a person. Yes, she brings snacks to class (which is genuinely a gesture to be grateful for), but she also wants you to come to know yourself more through this course – the course challenged me to think critically about my own morals and future as a historian, because of Prof. Miles's genuine care for how history does, can, and should exist for the public. There were a few times when she asked us at the start of class to reflect about what we want to contribute to the world, and it honestly makes me emotional to remember. It's easy to lose sight of why you're studying at Harvard, but Prof. Miles will not let you forget it. This class shifted the way I think as a historian, but it was also was philosophical in a way that was fulfilling for me beyond being a historian. I will continue to think about the questions raised in this class as I go throughout my life, which is not something I can say for many courses at this school.","best_comment_short":"Miles is a must, but especially a seminar, as she is truly fantastic at leading one – beginning with some time to know each other (not ice–breakers, but really understanding your \"why\" for the course and for caring about history in general...it built trust between us quickly, which showed in our discussions), setting high expectations for the rigor of our conversations off the bat – asking follow up questions, synthesizing our conversations, and pushing our ideas.","best_comment_first":"One of the best history courses I have taken as a senior concentrator.","course_id":"212674","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6400c54b03759556bcb316939f3864ecedbd17f10e4cd80967ad5fc4c846a334151b31a09d8a4a7827d4d494dd4b4ce6&ReportType=2&regl=en-US"},{"course_code":"GHHP 20","course_title_2026":"Maternal & Reproductive Health and Health Policy","course_score_mean":4.68,"rec_score_mean":4.74,"gem_probability_mean":0.0,"sentiment_score_median":0.9339,"best_gem_comment":"","workload_score_mean":4.53,"best_gem_comment_short":"","best_comment":"One of the best courses I've taken ever! We learned a lot of maternal health in terms of global health and health policy. Jessica is a great lecturer and kept things interesting by bringing in amazing guest speakers from many different fields from OBs to Health Ministers from Sierra Leone to researchers from the Public Health School, they were so relevant and fascinating to hear from. Readings each week are very manageable, very interesting and actually helps for lecture the next day. Three assignments overall, which are pretty chill and Marema (TF) will help you if you ever have questions. I highly recommend this course, it was such a fun time!","best_comment_short":"Jessica is a great lecturer and kept things interesting by bringing in amazing guest speakers from many different fields from OBs to Health Ministers from Sierra Leone to researchers from the Public Health School, they were so relevant and fascinating to hear from.","best_comment_first":"One of the best courses I've taken ever!","course_id":"223975","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0fd32187ee50daeffbbafe46c825b492fa949d7f27484a144f3a7f5ffc0d441fc0ceb2c023a52404bcfd5d0675a3631e&ReportType=2&regl=en-US"},{"course_code":"RELIGION 97","course_title_2026":"Tutorial - Sophomore Year","course_score_mean":4.67,"rec_score_mean":4.8,"gem_probability_mean":0.0,"sentiment_score_median":0.9907,"best_gem_comment":"","workload_score_mean":7.5,"best_gem_comment_short":"","best_comment":"TAKE THIS COURSE! I know it's optional for secondaries but you would do yourself an injustice by not taking this class. It's an absolute gold mine. You'll meet really amazing people with such niche interests and you'll have a blast talking to them about religion. Tbh I was scared about this class because I didn't think I was interested enough to do well. But turns out I liked it way more than I thought I would. It's a great course, the reading material is great, and Dr. Lamberth is so passionate and wonderful. She is so knowledgeable and excited and it's so fun to talk for hours with her and your peers every week.","best_comment_short":"It's a great course, the reading material is great, and Dr. Lamberth is so passionate and wonderful.","best_comment_first":"TAKE THIS COURSE!","course_id":"117043","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1148fdfbfbfd69df28bb96ad034ce266088f9c685611dfed2d30dc916e5686f3ab5132d6950f20382e3b5516e6518548&ReportType=2&regl=en-US"},{"course_code":"CHEM 20","course_title_2026":"Organic Chemistry","course_score_mean":4.66,"rec_score_mean":4.58,"gem_probability_mean":0.0,"sentiment_score_median":0.96445,"best_gem_comment":"","workload_score_mean":11.23,"best_gem_comment_short":"","best_comment":"Take this class. It was not easy, but I LOVED it. It's an amazingly well supported, well organized, well taught class. Logan is awesome and so are all the TFs and CAs. They're so passionate about chemistry and want to help you learn and succeed. There is a LOT of material to learn (including a fair amount of memorization), but the course also provides a huge amount of practice material. (This does make feel like there's always more studying you could be doing, but ultimately it's super useful.) Collaboration is highly encouraged –– in fact, psets and exams always have a group portion. It is a hard course and took a lot of time and energy, but I am so so glad I took it. Would absolutely recommend. Also, labs are super fun and you often get out early.","best_comment_short":"They're so passionate about chemistry and want to help you learn and succeed.","best_comment_first":"Take this class.","course_id":"124312","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2b5b394aeb91bd5eb470b6f560968d7187cbe732c519f34b136dc16679b74104e954cc37d28125bbcdd4c7f0a227ae2e&ReportType=2&regl=en-US"},{"course_code":"MCB 68","course_title_2026":"Cell Biology Through the Microscope","course_score_mean":4.65,"rec_score_mean":4.55,"gem_probability_mean":0.0,"sentiment_score_median":0.92915,"best_gem_comment":"","workload_score_mean":6.45,"best_gem_comment_short":"","best_comment":"To future students taking FAS–MCB 68, be prepared for a challenging but rewarding experience. The course provides a great balance of theory and hands–on learning, especially through the lab sessions where you’ll work with advanced microscopy tools like confocal and fluorescence microscopes. These tools are key to understanding cell biology at a deeper level, so make the most of your time in the lab. Stay engaged with the material, ask questions when you’re unsure, and take advantage of office hours and peer discussions. The course is fast–paced, but it’s also a fantastic opportunity to develop skills that are essential for future research. Don’t be afraid to troubleshoot and experiment—it’s all part of the learning process!","best_comment_short":"The course is fast–paced, but it’s also a fantastic opportunity to develop skills that are essential for future research.","best_comment_first":"To future students taking FAS–MCB 68, be prepared for a challenging but rewarding experience.","course_id":"109851","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9eaf1cafd349dd4e84469313184127805e133918d0b35e1912ed396c504a28a80ea592f7dc2b86329047a4b600faebc5&ReportType=2&regl=en-US"},{"course_code":"COMPSCI 1610","course_title_2026":"Operating Systems","course_score_mean":4.63,"rec_score_mean":4.53,"gem_probability_mean":0.0,"sentiment_score_median":0.93545,"best_gem_comment":"","workload_score_mean":15.95,"best_gem_comment_short":"","best_comment":"If you enjoy systems (taking CS 61 will probably help you make an informed opinion about systems), enjoy long hours of programming and debugging and not having a life, this is the class for you :DIn all seriousness, I loved 161. I think it's truly a transformative and fun experience working on low–level systems programming. Assignments were long but definitely very enjoyable and give you both a lot to learn and the opportunity to really sharpen your skills as a programmer and solidify your understanding of lecture concepts. Mickens is an incredible instructor and lecturer and there is not a single dull moment in his lectures. Remember to appreciate his incredible PowerPoint skills as you explore the lecture slides with great awe. There are diagrams – quite a lot of them. But fear not, they'll become your friends (maybe). You'll be acquainted with quite a few recurrent characters, such as the pagetable walk diagram, Bob and Alice, angry\/condescending Linus Torvalds, The Internet™©, the great address space VOID, struct proc, the Duolingo streak and Bitmoji James. All characters that you will remember in the years to come as you smile and reminisce about an unforgettable 161 experience. This class is definitely legendary to me and I am thoroughly glad I had the opportunity to take it. Highly recommended!","best_comment_short":"If you enjoy systems (taking CS 61 will probably help you make an informed opinion about systems), enjoy long hours of programming and debugging and not having a life, this is the class for you :DIn all seriousness, I loved 161.","best_comment_first":"If you enjoy systems (taking CS 61 will probably help you make an informed opinion about systems), enjoy long hours of programming and debugging and not having a life, this is the class for you :DIn all seriousness, I loved 161.","course_id":"113847","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=757bb56e1aeec6f1b12177f49401b96a9c7b01dedce1cea67e46263c0db19d68a2e28779be5831e326230fe7b7447600&ReportType=2&regl=en-US"},{"course_code":"PHIL 173E","course_title_2026":"Is Ethics Objective?","course_score_mean":4.63,"rec_score_mean":4.53,"gem_probability_mean":0.0,"sentiment_score_median":0.9645,"best_gem_comment":"","workload_score_mean":6.2,"best_gem_comment_short":"","best_comment":"This class is absolutely wonderful! Zoe is one of the best professors I have had here at Harvard. Not only is she super funny, but she knows her philosophy so well and does a great job breaking it down during lectures. Zoe's lectures are super engaging– she is very bubbly and enthusiatic, and she always have activities during lecture! One thing I would say about this class is it's super important to stay on top of the readings. The reading summaries (while they may annoy you in the moment), will be your absolute best friend when it comes to that final! This is a class both undergraduates and graduate students can take, and I highly recommend it as an undergraduate myself– what I will say is that the readings are very complexed, so you have to be committed to sitting there and putting in the effort to understand. Zoe and Jing Hwan are fantastic and are readily available, which is great. The two papers are very short (1500 words), and make sure you come to class to get your participation points! Overall, this has been one of my favorite classes, and I'm really going to miss it!","best_comment_short":"Not only is she super funny, but she knows her philosophy so well and does a great job breaking it down during lectures.","best_comment_first":"This class is absolutely wonderful!","course_id":"225918","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=37d1c36d6d57cd25c4c6e0a1977faab7a276006069942673e693c5f314d07e05a0061fd9ea9c77ee40a3201bebe92df0&ReportType=2&regl=en-US"},{"course_code":"ECON 1042","course_title_2026":"Sports Economics","course_score_mean":4.61,"rec_score_mean":4.63,"gem_probability_mean":0.0,"sentiment_score_median":0.83955,"best_gem_comment":"","workload_score_mean":4.16,"best_gem_comment_short":"","best_comment":"Would definitely recommend this class to fulfill the theory requirement for ec. The content was super interesting even if you aren't very familiar with mainstream sports. The lectures could get boring sometimes, but overall Judd is super nice and is super helpful if you want help brainstorming project ideas or just to talk about sports. The AI policy is also super nice.","best_comment_short":"The lectures could get boring sometimes, but overall Judd is super nice and is super helpful if you want help brainstorming project ideas or just to talk about sports.","best_comment_first":"Would definitely recommend this class to fulfill the theory requirement for ec.","course_id":"211392","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7e2f74a710d92109e559c971009a1add01e3ab2480a359094f3151af71d54ed5deacde3694ef1f28ef45ddb6febcadd3&ReportType=2&regl=en-US"},{"course_code":"WOMGEN 1283","course_title_2026":"Love's Labors Found: Uncovering Histories of Emotional Labor","course_score_mean":4.57,"rec_score_mean":4.64,"gem_probability_mean":0.0,"sentiment_score_median":0.9461,"best_gem_comment":"","workload_score_mean":6.0,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS. I genuinely got the most out of this class than any other class I have taken at Harvard. I'm so serious. Professor Light is so so so incredible and genuine and gives amazing feedback and advice academically, but also cares so much about her students and gets to know everyone personally. The material was all very interesting, and while you should definitely prepare to do a lot of reading, as long as you keep up, it's not incredibly difficult. Class discussions were so interesting and really expanded my perspective.  I can't say enough amazing things about this class. Best part of my year!","best_comment_short":"The material was all very interesting, and while you should definitely prepare to do a lot of reading, as long as you keep up, it's not incredibly difficult.","best_comment_first":"TAKE THIS CLASS.","course_id":"207804","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d1c4591f01f93eca75903e7fafc71e27488ba8dd891c2b9b0fcca2cf12fac1033fdee3ed001c1874003da8f0f9f59581&ReportType=2&regl=en-US"},{"course_code":"BCMP 213","course_title_2026":"Behavioral Pharmacology","course_score_mean":4.57,"rec_score_mean":4.57,"gem_probability_mean":0.0,"sentiment_score_median":0.8982,"best_gem_comment":"","workload_score_mean":5.14,"best_gem_comment_short":"","best_comment":"It is super helpful to have an excellent grasp on scientific literature prior to beginning this course. There are a lot of assigned readings and they can get lengthy and complex, so having a general understanding of the layout and rhythm of scientific papers beforehand will allow for more efficient learning. Also, pay attention to what the professor highlights about each reading in the weekly email. The themes he emphasizes often appear on the quizzes, worth a large portion of your final grade. That being said, as long as you read each reading in full and understand their implications, you will do well on the quizzes. There are no tricks.","best_comment_short":"It is super helpful to have an excellent grasp on scientific literature prior to beginning this course.","best_comment_first":"It is super helpful to have an excellent grasp on scientific literature prior to beginning this course.","course_id":"141859","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0e29a7d563fb1a58b33d0553d195e74843499f2080d0b3ba7fcc8630948338b8b421d004088e602157286612a61a00ee&ReportType=2&regl=en-US"},{"course_code":"CPB 99B","course_title_2026":"Laboratory Research for Honors Thesis","course_score_mean":4.57,"rec_score_mean":4.57,"gem_probability_mean":0.0,"sentiment_score_median":0.7365,"best_gem_comment":"","workload_score_mean":21.43,"best_gem_comment_short":"","best_comment":"The workshops are quite helpful for keeping you on track and accountable, and the spring workshop in particularly was helpful for suggesting programs\/software you could use to make your figures, and for giving you time to start working on them. It was also nice to be in the same space as other thesis writers, where we could share our struggles and feel less alone in the process. I will say that needing to email your PI the results of each workshop feels kind of silly, especially when it doesn't seem to merit any response from them – I feel like it would've been sufficient for me to email it to my direct mentor. It feels like the course's expectations of how invested your PI is is rather idealized in comparison to reality. In terms of the thesis–writing experience, I ended up hella grinding all my experiments in the two months before the deadline, and (other than the introduction I wrote in the fall\/winter break) wrote most of it in like two weeks.  During the summer before, I should've realized how much harder it would be to get things done during the school year – if you can, get as much as possible done during the summer and don't bank on making too much progress during the fall. Also, if you're going to leave your writing to the last minute, at least pretend like your thesis is due a day before it's actually do – the extra 24 hours left gave me time to do so much editing, and to write a whole extra section in my results (using data with inconclusive results that I had previously decided I didn't have time to include).","best_comment_short":"The workshops are quite helpful for keeping you on track and accountable, and the spring workshop in particularly was helpful for suggesting programs\/software you could use to make your figures, and for giving you time to start working on them.","best_comment_first":"The workshops are quite helpful for keeping you on track and accountable, and the spring workshop in particularly was helpful for suggesting programs\/software you could use to make your figures, and for giving you time to start working on them.","course_id":"159732","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=bcfc0321f5f9bff97d7043c30401860301bf9de0a22685b981a1abaaa0ed9eb8ffd869ec9ad70351104a31af4d66a243&ReportType=2&regl=en-US"},{"course_code":"STAT 149","course_title_2026":"Introduction to Generalized Linear Models","course_score_mean":4.54,"rec_score_mean":4.39,"gem_probability_mean":0.0,"sentiment_score_median":0.8968,"best_gem_comment":"","workload_score_mean":7.25,"best_gem_comment_short":"","best_comment":"STAT 149 is a very well–organized and straightforward class that I would recommend to any stat concentrator or secondary. I'll discuss the pros and cons of this class, and why you might (not) want to choose it over 139\/244. This review will be quite long but should answer basically any question you have about the course and be sufficient to decide whether it is a course that you'd like to take.Required preparation: You can do well in this class even if your only preparation is STAT 110. We do use likelihoods and MLEs quite a bit throughout the class, so 111 would definitely be helpful, but is not completely necessary. Presumably you're taking this class if you're a stat concentrator though, so you will have probably taken 111 anyway. Lastly, 139 is by no means needed for this class, hence why 149 can substitute for it in the modeling requirement for the stats concentration. I think around half of the people in 149 this semester did not take 139. However, I would strongly recommend taking 139 as well if you plan to take this course, as it really does not make conceptual sense to learn basically every type of generalized linear model except for a standard linear regression with normally–distributed errors (which is the focus of 139). This course will also be far more satisfying having completed 139 and you will be able to more clearly see why we are doing certain things. Some topics are also retaught from scratch from 139, so you'll be slightly ahead having completed that before this course.Content: The course covers different generalized linear models (e.g. logistic regression, Poisson regression, multinomial regression) as well as some extensions beyond these models, including some more ML–related topics (smoothers, GAMs, decision trees) and related non–GLMs (negative binomial, beta–binomial, proportional odds). The theoretical basis for this class is rooted in exponential dispersion families (essentially NEFs if you remember those from 111), and their log–likelihoods\/MLEs. We touch on topics such as model selection, diagnostics, and missing data methods as well.Course structure: Mark is a great professor and is very well–organized. Lecture notes are well–written and contain basically everything you need to complete the homeworks and do well on exams. If you don't want to attend a 9 AM lecture twice a week, the lecture notes (or the Panopto recording) are entirely sufficient. In fact, you can complete nearly everything on the homework assignments solely with the lecture notes (and associated R script provided on Canvas). Lecture notes and homeworks will be posted far in advance in contrast to some other stats courses where homeworks are released late or not at all. There are office hours and sections provided, though sections were sparsely attended since the lecture notes are so well–written and self–contained, and since the course enrollment was relatively small. If you come to lecture or watch the recordings, you will probably not need to go to section.Homeworks: There are 6 regular homework assignments throughout the semester, due roughly every other week on Monday. As I mentioned, they can be completed basically with just the lecture notes. They are mostly applied and in R, though there will occasionally be more theoretical questions. However, these assignments are very straightforward and should not require that much stress or time. Mark guides you through the applied problems and so you'll almost never have to look up an obscure command to do something. These assignments should take no more than 2 or 3 hours if you're referring to the lecture notes for guidance.Mini–projects: In addition to the 6 regular homeworks, there are also 3 \"mini–projects\" which are really just additional psets, but the mini–projects have you explore one dataset 3 times throughout the second half of the semester to implement tools as we learn them in class. So in reality this class has 9 homework assignments, but these mini–projects are slightly shorter than regular homeworks and usually due in the weeks in between the due dates of two homeworks. They also only start in the second half of the class, following spring break and the first midterm.Exams: This class has 2 exams: a midterm and a final. However, it's more accurate to describe them as Midterm 1 and Midterm 2, as they are both the same length (75 minutes). Midterm 2 is notably not cumulative which is why it is still only 75 minutes long (though still held during finals period), though in reality you learn so many more things in the second half of the class that it not being cumulative doesn't really change anything, and you will still need to have a strong understanding of many of the concepts from the first half anyway. The exams are not really that tricky and mostly test interpretation of model outputs and related concepts. There are some theoretical concepts covered on exams, though no more so than computing a log likelihood or an MLE. However, there are some more obscure formulas required to complete certain parts that are not provided to you, so it's a good thing that you're allowed to bring in a cheat sheet for the exams. Make sure that you make a good cheat sheet or you may lose out on a large number of points because you didn't have the right formula written down on your cheat sheet (i.e. Newton–Raphson or an F test statistic). Exam averages hovered around 70 percent, not too much different from 110\/111, though the exams in this class were definitely far easier and more predictable than those. If you take the practice exams, review the lecture notes, and make a good cheat sheet, you should be fine.Grade distribution: About half the class gets a final grade in the A range, and about half in the B range. But again, if you put in a decent level of effort and stay on top of the class, you should be able to get an A range grade. Mark is very fair in how he determines and curves grades, so it is really only if you are unable or unwilling to dedicate enough time and effort to the class (which is again, far less than 110\/111) that you would do worse than you'd have liked to.Overall workload: I rarely spent more than 2 or 3 hours each week outside of class on 149. Homework assignments were very straightforward and could be quickly completed using the lecture notes. This workload increased the weeks of the two exams, though you probably don't need to do much more than review the lecture notes and homeworks, make your cheat sheet, and complete the practice exams.Now that I've summarized the class, I'll address whether one should take it over 139 or 244.139  vs 149: 149 is essentially an extension of 139 and allows for far more flexibility in modeling than what 139 does with OLS regression. That being said, 149 can reasonably be taken without any knowledge from 139 and is actually an easier\/less time consuming class than 139 (you can verify this by comparing Q guides). So if you just want to get this modeling requirement out of the way and maybe if you have a very busy fall schedule, 149 may be preferable. But if you want to have a complete, widely–applicable knowledge base of understanding, you'd be best off taking both 139 and 149. While there are some redundancies between the two, taking both gives you basically everything you need to statistically model basically anything. Another little–discussed note of importance is that 149 is approved as an Econ elective (as of Spring 2025) while 139 is not, which may be of interest to Stat–Econ double concentrators.149 vs 244: 149 is a very applied class and does not get too much into the weeds of the more theoretical concepts. It is mainly focused on interpreting results and choosing the appropriate model. While this means 149 is very applicable, if you're more theory–oriented you may want to take 244 instead, which combines 139 and 149 into one graduate–level class heavy in linear algebra, calculus, and proofs. It also meets the modeling requirement, but does not cover all of the application discussed in 139 and 149. So I'd recommend 244 only if you're more interested in the theory (and perhaps going for advanced course track honors\/concurrent masters). Though you can of course take 139\/149 and then take 244 as well if you'd like, which is what I plan to do.Overall, you should consider taking 149 if you want a low–stress yet extremely useful class where you'll learn a lot without having the class feel like a burden on your schedule.","best_comment_short":"This course will also be far more satisfying having completed 139 and you will be able to more clearly see why we are doing certain things.","best_comment_first":"STAT 149 is a very well–organized and straightforward class that I would recommend to any stat concentrator or secondary.","course_id":"118974","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=fe902391eecc22ac6c7da0a4203ad1ab0445cafb471e092ddc6d6579af72db75f79df40c90cf73d6b237bca37a2ef995&ReportType=2&regl=en-US"},{"course_code":"GOV 51","course_title_2026":"Data Analysis and Politics","course_score_mean":4.54,"rec_score_mean":4.31,"gem_probability_mean":0.0,"sentiment_score_median":0.8953,"best_gem_comment":"","workload_score_mean":8.0,"best_gem_comment_short":"","best_comment":"The first few weeks may feel overwhelming, but it really gets better. It is a challenging course if you don't have a strong quantitative background, but there is a lot of support available. I came out of the course with stronger quantitative skills, I highly recommend it if this is something you want to work on.","best_comment_short":"I came out of the course with stronger quantitative skills, I highly recommend it if this is something you want to work on.","best_comment_first":"The first few weeks may feel overwhelming, but it really gets better.","course_id":"123443","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8edbc33d4f8a317563ce9571f333defb51d82f538eeaef5f21b347620ae7e839fafb3b4ec01c4ac2785c654c34b0165f&ReportType=2&regl=en-US"},{"course_code":"SCRB 167","course_title_2026":"Stem Cell Therapeutics: Exploring the Science and the Patient Experience","course_score_mean":4.54,"rec_score_mean":4.42,"gem_probability_mean":0.0,"sentiment_score_median":0.9037,"best_gem_comment":"","workload_score_mean":4.27,"best_gem_comment_short":"","best_comment":"This is a great class to learn about super interesting research from leaders in the field, and the patient perspectives are amazing! Because there are so many topics covered (it was generally divided by organs\/diseases,  like brain, cardiovascular, diabetes, embryos, etc) , it means there's something for everyone. The paper also talks about some social\/public policy concerns that have arisen with stem cell therapy, like equitable access, non–FDA approved therapies in the Caribbean, 'my sister's keeper'–esque family planning with IVF, and more, so it's not just hard science 24\/7 which I appreciated. The weekly paper write–ups are graded semi–harshly with the goal of helping you refine your analysis of papers—I actually feel like I improved a lot in this aspect over the course of the semester and my grade was generally fine. The professors are both very well–connected in the medical\/research\/pharma world so the guest speakers are highly credentialed and super interesting. The con of this is that the professors are really busy and your actual learning (weekly paper roundtables, advice on your proposal) are all directed by a TF. It's harder to build a relationship with the professors. The patient stories are incredibly moving and diverse, and something that you'll really only otherwise get in medical school 'patient as professor' sessions. Take this class for a great survey in stem cell research!","best_comment_short":"This is a great class to learn about super interesting research from leaders in the field, and the patient perspectives are amazing!","best_comment_first":"This is a great class to learn about super interesting research from leaders in the field, and the patient perspectives are amazing!","course_id":"125200","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4152f5c33c3ff20844b28dbdf6392c5f3a007bf77c8b0711a30d7b4689130cfd5fa8965fe43481fa922004b8b9b4321f&ReportType=2&regl=en-US"},{"course_code":"HIST 1602","course_title_2026":"Modern China: 1894-Present","course_score_mean":4.53,"rec_score_mean":4.47,"gem_probability_mean":0.0,"sentiment_score_median":0.9061,"best_gem_comment":"","workload_score_mean":5.29,"best_gem_comment_short":"","best_comment":"This class gives a great sweep through modern Chinese history! At first, it was a bit overwhelming, coming from a background of little Chinese history, but by a couple of weeks in I was able to more clearly navigate lectures and readings to advance my knowledge. One of the highlights of the class, for me, was the Survey of China Mainland Press Project, where we got to look through the different books and do group research on a topic. Xiaorui was a WONDERFUL TF and went out of her way to answer questions, offer guidance, and make section as fun as possible. Besides being brilliant, she is always superbly kind and welcoming, without a doubt adding to the course with her intense knowledge. The review guides\/outlines were immensely helpful in preparing for the exams and consolidating the topics covered.","best_comment_short":"Besides being brilliant, she is always superbly kind and welcoming, without a doubt adding to the course with her intense knowledge.","best_comment_first":"This class gives a great sweep through modern Chinese history!","course_id":"109621","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d341b5fb94c51b979615e3e94ee862ec46e16e83201b8fa2234b2a589b5fc2b5f6a999f78a2615c558709af487aa2a18&ReportType=2&regl=en-US"},{"course_code":"PSY 11","course_title_2026":"Cognition: How the Mind Works","course_score_mean":4.52,"rec_score_mean":4.5,"gem_probability_mean":0.0,"sentiment_score_median":0.9219,"best_gem_comment":"","workload_score_mean":5.08,"best_gem_comment_short":"","best_comment":"Definitely one of the more challenging foundational psych classes available but also one of the most fulfilling if you enjoy academic rigor and learning new things. I would honestly say this is one of the more difficult non–PSET classes I've taken overall as a student at Harvard simply because of the depth and technical details of the materials we learn as it is a bit neuroscience heavy at the start of the course–– but this is not to say at all that I would not recommend the course. As someone who enjoys an easier class here and there, I would still recommend this class to any psych student interested in cognition \/ language acquisition because I honestly learned so so much in this course that I don't think I would have been able to get in such depth elsewhere in the courses I've already taken. Absolutely fantastic class and the structure\/organization is so clear and upfront. I absolutely applaud Dr. B and Srijani (one of my fav TFs of all time!) for their hard work this semester. I have honestly never seen a TF work harder than Srijani. Love them both! They are also both very fair and empathetic educators, which makes me respect this course even more. They are understanding of any unique circumstances you face while ensuring they accommodate you in a fair manner for all students in the course. This course has transformed the way I perceive everything in my everyday life and I highly recommend if you have the bandwidth to put in the effort and learn!","best_comment_short":"As someone who enjoys an easier class here and there, I would still recommend this class to any psych student interested in cognition \/ language acquisition because I honestly learned so so much in this course that I don't think I would have been able to get in such depth elsewhere in the courses I've already taken.","best_comment_first":"Definitely one of the more challenging foundational psych classes available but also one of the most fulfilling if you enjoy academic rigor and learning new things.","course_id":"224144","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=74e4a4fabefb76fcfc731564d33e8554b02bcc7f8847a067e88d95bc420fb12299f6e8301a881f8c9c2adbe0d5128ad3&ReportType=2&regl=en-US"},{"course_code":"MCB 130","course_title_2026":"The pharmacy of life – exploring the function and biochemistry of natural products","course_score_mean":4.52,"rec_score_mean":4.68,"gem_probability_mean":0.0,"sentiment_score_median":0.98,"best_gem_comment":"","workload_score_mean":7.92,"best_gem_comment_short":"","best_comment":"All the feedback being given must be taken with a grain of salt because the TFs and CAs were very aware all throughout of the semester of how much our feedback as first time class takers would influence the course's overall structure. Kudos to them for being very open minded about it and really wanting students to give their feedback. They adjusted PSET length mid–semester which was very fair and they were all overall very open to suggestions even within the course's syllabus. Overall, great teaching coming from Ryan, Hisham, and Jaime.Grading scheme: Loved that there were no exams, making the class very enjoyable and light. Especially if you want to explore something so nuanced and difficult like natural products, not having exams was great. The part about graded on effort I thought was a bit inconsistent with some of the grades I had friends getting given we did the PSETs together and put in the same effort. I think you have to be very clear if it is graded on effort or correctness and if its by effort, have very good feedback so that student understands they got the point for doing the question but have room to understand where they can grow. Also grading highly varied among CAs which is always difficult to understand and unfair, so finding a way to make that more standard is essential, especially if taking the effort–based route because then it just doesn't make sense if the same effort was placed on all PSETs that they wouldn't receive the similar grades.PSETs: The exposure to Pymol and Alphafold is super fun and those PSETs were very enjoyable, whereas the others just seemed very long and tedious. I feel like there are better ways of engaging with the course content than those 10 page PSETS. They did slowly change this up during the semester and condensed into more thought out questions which was great (perhaps just not the last PSET that had 20 pages and most people just dropped it especially because of final project presentations and other finals). I honestly think having more Pymol and Alphafold PSETs would've been a super enjoyable route and very rewarding too building those skills nowadays. Lectures: They leaned much more towards chemistry than bio which would make sense given it says pharmacy in the name of the course but I expected a perhaps more higher overview of the content on the chem side. A focus on understanding why certain plants are explored, their compound effect on the body, classes of plants to explore, etc was what I expected vs learning about terpenoids etc. I think these kinda do walk hand–in–hand so I'd just add that Chem27 is also a pre–req for the class because then the chem part isn't overwhelming and taking away from the experience, despite not having Chem27 hindering my experience completely.  Some of the first PSETs had questions more focused on the chemistry side that which is what we learned in Chem27 4 weeks later or something.Final Project: Super enjoyable putting into practice everything you learned in class and analyzing something of your choice. Highly recommend taking their early deadlines seriously and really planning out what you want to talk about vs last minute cramming because this is meant to be enjoyable and you understanding how your favorite natural product's mechanism and its 3D structure.","best_comment_short":"I honestly think having more Pymol and Alphafold PSETs would've been a super enjoyable route and very rewarding too building those skills nowadays.","best_comment_first":"All the feedback being given must be taken with a grain of salt because the TFs and CAs were very aware all throughout of the semester of how much our feedback as first time class takers would influence the course's overall structure.","course_id":"225811","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=14807ae0fd8a734ea466d171e8a687d96c33c65f64238e866a2138b7aa41cc8b336898de88230b77e8f26b3bcd2c9432&ReportType=2&regl=en-US"},{"course_code":"COMPLIT 290","course_title_2026":"Migration and the Humanities","course_score_mean":4.5,"rec_score_mean":4.42,"gem_probability_mean":0.0,"sentiment_score_median":0.743,"best_gem_comment":"","workload_score_mean":6.44,"best_gem_comment_short":"","best_comment":"This class is incredible. The professors are so wonderful and smart, hearing them speak is probably the best part of it. They really foster an open and safe environment where people can feel comfortable speaking on difficult topics. The class was very warm and felt almost like a family. It’s a great class.","best_comment_short":"The professors are so wonderful and smart, hearing them speak is probably the best part of it.","best_comment_first":"This class is incredible.","course_id":"134075","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=26fdcaf56a89782082b214a249c708d8d80216076922d001f308118a18b2f47726d99247c5999da8edc70aafadb83765&ReportType=2&regl=en-US"},{"course_code":"MCB 102","course_title_2026":"Creativity, Innovation, and Entrepreneurship in the Life Sciences","course_score_mean":4.5,"rec_score_mean":4.54,"gem_probability_mean":0.0,"sentiment_score_median":0.89595,"best_gem_comment":"","workload_score_mean":4.22,"best_gem_comment_short":"","best_comment":"*******Alain is an incredibly lovely person and the speakers he brought in every week were truly very helpful and insightful about venturing into biotech and all the different ways in doing so. I highly highly recommend  this class if you are interested in biotech and want dedicated time to listen to speakers, create a project, and have the support of a very lovely professor in doing so and understanding if this is for you.","best_comment_short":"I highly highly recommend  this class if you are interested in biotech and want dedicated time to listen to speakers, create a project, and have the support of a very lovely professor in doing so and understanding if this is for you.","best_comment_first":"*******Alain is an incredibly lovely person and the speakers he brought in every week were truly very helpful and insightful about venturing into biotech and all the different ways in doing so.","course_id":"224947","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=fbdd8da1c4ec758bf8f239838f32b02a16617ce5175026f17760f106de90ce933ae74afbd7798d3ef1a0c201dba9aefb&ReportType=2&regl=en-US"},{"course_code":"SOCIOL 1170","course_title_2026":"Sociology of Childhood","course_score_mean":4.5,"rec_score_mean":4.55,"gem_probability_mean":0.0,"sentiment_score_median":0.9493,"best_gem_comment":"","workload_score_mean":4.27,"best_gem_comment_short":"","best_comment":"FYRE CO CHAIR CERTIFIED: This class is extremely interesting! There is so much opportunity to relate to what the course is teaching because you yourself were once a kid too! This class did so much to validate me and my childhood experiences. This course is in the  top 2 of my favorite courses I have ever taken at Harvard, and I am a computer science major! The content was extremely interesting and relevant , but Dr.Daniel is also just an excellent, super eloquent, intelligent lecturer ––– She should be a professor !!!! Harvard do better. This course is not difficult, but its not unchallenging either. You usually have to read 60 pages a week, which is so fair, and the readings are always super relevant to what is taught in the course. You get a really good survey of the sociology of childhood and how its changed throughout history. The written assignments are fun and 4–5.5 pages which means you're not slapping on words to a google doc trying to get to the page limit. The final exam is also super fair, although you did need to study to do well. It was very much like an AP exam. I think the most challenging part of this course to me was being able to identify social constructions of children while reading or consuming media. This definitely came with practice for me. To me its analogous to trying to correct an essay but your brain keeps autocorrecting any errors you come across. Overall such a wholesome course! I was never bored, and I was always excited to come to class.","best_comment_short":"The content was extremely interesting and relevant , but Dr.Daniel is also just an excellent, super eloquent, intelligent lecturer ––– She should be a professor !","best_comment_first":"FYRE CO CHAIR CERTIFIED: This class is extremely interesting!","course_id":"218262","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4c2b097047a58da09ab004edc448b4315dc5625e38af35ae8705ad3692397e5e339568d06ad5279aff46576c5da4a3ff&ReportType=2&regl=en-US"},{"course_code":"MUSIC 161R","course_title_2026":"Advanced Composition","course_score_mean":4.5,"rec_score_mean":4.5,"gem_probability_mean":0.0,"sentiment_score_median":0.8924,"best_gem_comment":"","workload_score_mean":4.63,"best_gem_comment_short":"","best_comment":"This class was really cool! But it was not really what I expected. Chaya is a very modern composer (she has music online you can listen to for a sense); super atonal, and she is all about getting you out of the box. People in our class had really different music backgrounds, and it was so fun seeing what that meant for everyone. This isn't a class that will refine your understanding of super technical aspects of composition, (harmony, voicing, whatever), it's much more about the broad, artistic aspects of what you're writing. Very little direction is given because Chaya and Ali want you to just write what you're going too write, which can be scary or it can be super fun.Anyway take it if you want to just write a lot and take a pretty chill class and hear what other people are writing","best_comment_short":"Very little direction is given because Chaya and Ali want you to just write what you're going too write, which can be scary or it can be super fun.Anyway take it if you want to just write a lot and take a pretty chill class and hear what other people are writing","best_comment_first":"This class was really cool!","course_id":"119812","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2567702876a790cfc4795cead5a7a84d0dd61b3b59105de29a4061cd0a4c641435a577c1b9742a7038d3f7f93962e087&ReportType=2&regl=en-US"},{"course_code":"ECON 1800","course_title_2026":"The Economics of Cities","course_score_mean":4.49,"rec_score_mean":4.48,"gem_probability_mean":0.0,"sentiment_score_median":0.8934,"best_gem_comment":"","workload_score_mean":5.18,"best_gem_comment_short":"","best_comment":"There are definitely easier Econ electives out there, but I personally found this class to be very interesting! You learn some of the most foundational models in urban economics (even if they appear very stylized), and just hear about a host of issues facing cities today — as well the successes of cities. Both professors bring a wealth of experience, and really made the lectures very engaging. For grading purposes, you can probably get by just by understanding the models (which the sections really help for) and nothing else, but the interesting content is all in lecture so make sure to go to lecture!","best_comment_short":"For grading purposes, you can probably get by just by understanding the models (which the sections really help for) and nothing else, but the interesting content is all in lecture so make sure to go to lecture!","best_comment_first":"There are definitely easier Econ electives out there, but I personally found this class to be very interesting!","course_id":"111292","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ea15ad4aa174da5d00a263ffef3390c29b96946088d68c57f65a1c0b6f689aa0b80579dc47998c43108d3d73cc8f8672&ReportType=2&regl=en-US"},{"course_code":"COMPSCI 1360","course_title_2026":"Economics and Computation","course_score_mean":4.46,"rec_score_mean":4.26,"gem_probability_mean":0.0,"sentiment_score_median":0.9128,"best_gem_comment":"","workload_score_mean":7.28,"best_gem_comment_short":"","best_comment":"You will learn fundamental results like the G–S theorem: that it is mathematically impossible for a voting rule to have all three following properties: free from manipulation, any candidate can theoretically win, and voters are incentivized to report honest rankings of their preferred candidates. Or that for two–sided matchings, it is mathematically impossible to have a rule that incentivize both sides to be honest–reporting, while resulting in a matching that is stable (where pairs won’t want to switch partners). Or that for allocating schools to students, it’s impossible to have a mechanism that satisfy all the following properties together: incentivizes honest–reporting, equal treatment of students with equal preferences, and doesn’t result in a subpar matching that a better matching exists. Incredibly fundamental results with extremely practical results.Probably the best class I have taken at Harvard (but this is conditioning on me as a junior and after taken some proof classes, and is interested in voting and allocating resources and fairness) (I am not a 55 kid though)Time split by week, rounded up by hour2, 5, 4, 2, 13, 6, 3, 7, 5, 7, 8, 4, 13, 2, 5, 3The two spikes are 2\/23–3\/3 (one week before midterm) and 4\/20–4\/28 (one week before reading period, last pset, I think I was doing some catching–up studying during this week).Lectures are required, but Ariel’s lectures are the best I have had at Harvard. I really like the pace, and I can understand everything at that pace without feeling bored. Attendance is monitored through in class quizzes about new material, which are honestly quite fun. The slides are also well–made and beautiful. The material is well–motivated and presented logically, with definitions clearly defined, and examples to illustrate. Ariel is also very responsive Ed.I think the value to effort ratio is pretty high, given that I spend <7 hours per week. Note that the value is intellectual value though.All in all, highly recommend!","best_comment_short":"You will learn fundamental results like the G–S theorem: that it is mathematically impossible for a voting rule to have all three following properties: free from manipulation, any candidate can theoretically win, and voters are incentivized to report honest rankings of their preferred candidates.","best_comment_first":"You will learn fundamental results like the G–S theorem: that it is mathematically impossible for a voting rule to have all three following properties: free from manipulation, any candidate can theoretically win, and voters are incentivized to report honest rankings of their preferred candidates.","course_id":"128164","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ecc142920421b62705e22b93897a911b39afd0c5219b35628ec0d337eb386622af19103a6d6f89c11bf5981f291bfd88&ReportType=2&regl=en-US"},{"course_code":"APMTH 120","course_title_2026":"Applied Linear Algebra and Big Data","course_score_mean":4.45,"rec_score_mean":4.44,"gem_probability_mean":0.0,"sentiment_score_median":0.9211,"best_gem_comment":"","workload_score_mean":8.35,"best_gem_comment_short":"","best_comment":"AM 120 is one of the best math classes I have taken at Harvard. If you liked 21b, you will definitely also like this class (although 21b is a more conventional pure math class whereas AM 120 is heavy with applications as the name suggests). Eli is an awesome instructor—he's funny, he explains concepts well, his textbook is very thorough, and he is fair with the exams he writes. The problem sets can definitely take some time (especially with some of the hand calculations), but I never found the problem sets to be useless or tedious. I always walked away with a better understanding of the material because of the questions that were asked. This course contains some of the most useful applications of linear algebra (dimensionality reduction, unsupervised learning, supervised learning etc.) that are relevant to pretty much any focus field, so it's definitely worth taking whether you're an AM concentrator or not. Overall, this is definitely a class I would recommend to anyone who has the relevant preparations and certainly to any AM students. Work hard, learn a lot, and I hope you enjoy it as much as I did!","best_comment_short":"Eli is an awesome instructor—he's funny, he explains concepts well, his textbook is very thorough, and he is fair with the exams he writes.","best_comment_first":"AM 120 is one of the best math classes I have taken at Harvard.","course_id":"113876","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=53291227cc355db349c0962c26f602cd3a62da36e0c2cda2a63751d3bd3f198af1f76ad915eccd6e6c6ec994d97cdebe&ReportType=2&regl=en-US"},{"course_code":"PHYSICS 137","course_title_2026":"Philosophy of Quantum Theory","course_score_mean":4.45,"rec_score_mean":4.43,"gem_probability_mean":0.0,"sentiment_score_median":0.9314,"best_gem_comment":"","workload_score_mean":7.64,"best_gem_comment_short":"","best_comment":"If you have a chance, TAKE THIS CLASS.  I can not tell you exactly what you will learn, since the course is improved upon each semester, but I can tell you that it will be fundamentally fascinating. We spent the first half of the semester essentially rederiving linear algebra, and the second rederiving all of the axioms of quantum mechanics, all from base principles with very little prior math knowledge needed. Readings included many paper from the original proposal\/formulations of quantum mechanics, and section\/OH helped a lot with interpretation, so that prior philosophy knowledge requirements were also minimal. Though I took the course as Phil 151, there was a fairly even distribution of people who took it as a physics course, and one could consistently rely on others who had more experience in either physics or philosophy for perspective. The class is small (30ish people), competitive to get into (because the subject and professor are both well liked by students), and takes all years\/levels of experience (everything is self contained\/taught within the course). This is also a wonderful class for a more logical\/formulaic philosophy experience and a more questions\/interpretation–based experience physics. I would definitely recommend attending section\/OH if possible, the material is fascinating and teaching staff are very willing to discuss related topics. The course generally follows the professors own formulation of quantum mechanics, has no exams (only a final essay), and has only one pset a week (with a reading section and a very straightforward math section). Overall, I had a wonderful time in this class and would absolutely choose to take it again. I seriously can not overstate how interesting and welcoming this class is!TLDR; Best class, heavily consider taking it","best_comment_short":"I would definitely recommend attending section\/OH if possible, the material is fascinating and teaching staff are very willing to discuss related topics.","best_comment_first":"If you have a chance, TAKE THIS CLASS.","course_id":"218289","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=5f1e186d1a03ae0571fe2567a2408e4f60b43810ae2ede5785a1818145fef32f032d083a6f932f46e0f1d64d432a4a14&ReportType=2&regl=en-US"},{"course_code":"PHIL 151","course_title_2026":"Philosophy of Quantum Theory","course_score_mean":4.45,"rec_score_mean":4.43,"gem_probability_mean":0.0,"sentiment_score_median":0.9314,"best_gem_comment":"","workload_score_mean":7.64,"best_gem_comment_short":"","best_comment":"If you have a chance, TAKE THIS CLASS.  I can not tell you exactly what you will learn, since the course is improved upon each semester, but I can tell you that it will be fundamentally fascinating. We spent the first half of the semester essentially rederiving linear algebra, and the second rederiving all of the axioms of quantum mechanics, all from base principles with very little prior math knowledge needed. Readings included many paper from the original proposal\/formulations of quantum mechanics, and section\/OH helped a lot with interpretation, so that prior philosophy knowledge requirements were also minimal. Though I took the course as Phil 151, there was a fairly even distribution of people who took it as a physics course, and one could consistently rely on others who had more experience in either physics or philosophy for perspective. The class is small (30ish people), competitive to get into (because the subject and professor are both well liked by students), and takes all years\/levels of experience (everything is self contained\/taught within the course). This is also a wonderful class for a more logical\/formulaic philosophy experience and a more questions\/interpretation–based experience physics. I would definitely recommend attending section\/OH if possible, the material is fascinating and teaching staff are very willing to discuss related topics. The course generally follows the professors own formulation of quantum mechanics, has no exams (only a final essay), and has only one pset a week (with a reading section and a very straightforward math section). Overall, I had a wonderful time in this class and would absolutely choose to take it again. I seriously can not overstate how interesting and welcoming this class is!TLDR; Best class, heavily consider taking it","best_comment_short":"I would definitely recommend attending section\/OH if possible, the material is fascinating and teaching staff are very willing to discuss related topics.","best_comment_first":"If you have a chance, TAKE THIS CLASS.","course_id":"119414","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=5f1e186d1a03ae0571fe2567a2408e4f60b43810ae2ede5785a1818145fef32f032d083a6f932f46e0f1d64d432a4a14&ReportType=2&regl=en-US"},{"course_code":"BE 124","course_title_2026":"Biomechanics of Movement and Assistive Robotics","course_score_mean":4.44,"rec_score_mean":4.28,"gem_probability_mean":0.0,"sentiment_score_median":0.9246,"best_gem_comment":"","workload_score_mean":7.66,"best_gem_comment_short":"","best_comment":"This is a great course. It's a really good opportunity to learn about the field of biomechanics, with Prof Patrick Slade, who's a fun, down to earth, and really invested in everyone's learning. It also has a good opportunity to experiment and build something of your own, fairly rudimentary but nonetheless a good way to do some actual building. It's less on the hardware and more on understanding human motion and human augmentation and touches on exoskeletons but not necessarily in the sci–fi way (the field is not that evolved yet). Regardless, it is a bit intense on the workload, but manageable, and a good experience. Great to do with friends, but also great to do solo and learn from others.","best_comment_short":"Great to do with friends, but also great to do solo and learn from others.","best_comment_first":"This is a great course.","course_id":"222521","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=269af534d73cf6d49f05b7094258373c3a7673eabacaa32cf2a580e94e462db298834b326998047ceb621f619eb77773&ReportType=2&regl=en-US"},{"course_code":"PHYSICS 247","course_title_2026":"Laboratory Course in Contemporary Physics","course_score_mean":4.43,"rec_score_mean":4.43,"gem_probability_mean":0.0,"sentiment_score_median":0.9165,"best_gem_comment":"","workload_score_mean":8.36,"best_gem_comment_short":"","best_comment":"This course takes a lot of time (8 hours of classes a week ends up feeling much longer than you expect) but is worth it. You'll become comfortable with basic lab techniques and get a feel for doing data analysis and writing papers. Joe and Jieping will be your best friends at the end of the semester. 2 very important recommendations: make sure to come into the class with a lab partner that you know you work well with, and always start the papers early – they take a LOT of time.","best_comment_short":"Joe and Jieping will be your best friends at the end of the semester.","best_comment_first":"This course takes a lot of time (8 hours of classes a week ends up feeling much longer than you expect) but is worth it.","course_id":"145024","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=78175f44393b90b68de465218af7eb39b7b965e29dc2c6003d11fec46c6a87f54c517124c89405ccdd70275f8d809b17&ReportType=2&regl=en-US"},{"course_code":"CE 11","course_title_2026":"StudioLab on Creativity and Entrepreneurship","course_score_mean":4.42,"rec_score_mean":4.58,"gem_probability_mean":0.0,"sentiment_score_median":0.9099,"best_gem_comment":"","workload_score_mean":6.33,"best_gem_comment_short":"","best_comment":"I enjoyed the opportunities that this course brought to us as students.  Many of our guest speakers were fabulous, but that was definetly the highlight of the course.  In terms of work and growing a venture I would say this course is a bit rigid and sometimes seemed like it was assigning certain work and making certain rules (like the complicated late policy and attendance quizzes) just to be annoying.  This course seemed to baby it's students in a somewhat patronizing way. Overall it was a good experience, but I hope that things get improved for next year","best_comment_short":"Overall it was a good experience, but I hope that things get improved for next year","best_comment_first":"I enjoyed the opportunities that this course brought to us as students.","course_id":"220705","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=43e23a07cefd58a3c41b423de13f12212d135b2c6238a1ee2db8cdfb96045b2ee38719df9df3086ac0bad1591997af99&ReportType=2&regl=en-US"},{"course_code":"APPHY 216","course_title_2026":"Quantum and Classical Electromagnetic Interaction with Matter","course_score_mean":4.41,"rec_score_mean":4.59,"gem_probability_mean":0.0,"sentiment_score_median":0.8547,"best_gem_comment":"","workload_score_mean":8.3,"best_gem_comment_short":"","best_comment":"Donhee is a great lecturer and this class is super well designed. Homework generally aligns well with what we are learning in lecture and is often a repeat of derivations or calculations covered in class—usually very approachable save a few questions here and there. Definitely recommend having a strong background in quantum mechanics. There’s a lot of mathematical tools and notations (Dirac notation, phasors, etc) that you are assumed to be familiar with.","best_comment_short":"Donhee is a great lecturer and this class is super well designed.","best_comment_first":"Donhee is a great lecturer and this class is super well designed.","course_id":"141253","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=feab00375a61b7e52570a4a329271533bcf3c22546b3a48a23976cce2dcf3c0559edbd507929584d51a5359cadfd1a78&ReportType=2&regl=en-US"},{"course_code":"CLS-STDY 112","course_title_2026":"Regional Study: Sicily","course_score_mean":4.4,"rec_score_mean":4.6,"gem_probability_mean":0.0,"sentiment_score_median":0.8442,"best_gem_comment":"","workload_score_mean":4.6,"best_gem_comment_short":"","best_comment":"The trip makes this class worthwhile and brings the readings to life! The first half of the class was a bit dry, but after we returned from Sicily, our discussions became much richer, and students were more willing to participate (since we had gotten to know each other much better during spring break).Readings are very archaeology heavy,  which can be frustrating. (I would have appreciated more historical\/literary sources.)Overview of Sicilian history was a bit cursory, and class discussions were often repetitive. Professor sometimes seemed underprepared for lectures.Still, the trip and the final paper gave me a solid understanding of Sicilian history and culture and motivation to continue learning.","best_comment_short":"The first half of the class was a bit dry, but after we returned from Sicily, our discussions became much richer, and students were more willing to participate (since we had gotten to know each other much better during spring break).Readings are very archaeology heavy,  which can be frustrating.","best_comment_first":"The trip makes this class worthwhile and brings the readings to life!","course_id":"156313","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=108d66600853a2732c7a2945638707a809ed9f204a291997fb59ac487dd5a1583daa896918db518ecad28522f17b3c39&ReportType=2&regl=en-US"},{"course_code":"STAT 213","course_title_2026":"Statistical Inference II","course_score_mean":4.4,"rec_score_mean":4.33,"gem_probability_mean":0.0,"sentiment_score_median":0.54575,"best_gem_comment":"","workload_score_mean":12.67,"best_gem_comment_short":"","best_comment":"I originally told my friends that I would joke around and put nothing but “Gem” on my Qguide review, but as the only undergrad in the course this year (now Pragya knows exactly who is writing this so I better watch what I say), I feel like I should accept at least a little bit of responsibility and give an actual review for any undergrads who are thinking of taking this course. So here are my thoughts (mostly for undergrads, PhDs are welcome to skip this essay as you are forced to take this class):My preparation: I am a junior who took Math 25A\/B, Stat 210, and 211. I had not taken Stat 212 or any other math course before taking 213. I don’t think a deep understanding of measure theory is really needed for this course, but I’m sure it helps if you have one.Material: 4.6\/5. The material is very foundational and if you are very interested in statistics (which you probably are given you are reading the 213 Qguide in the first place), you will love it. The course is broadly divided into three parts: estimation (the longest one comprising most of the semester), hypothesis test, and Bayesian inference (which lasts for about a week).Starting with estimation, the first few weeks on the unit can be rather dry. In the words of Pragya herself, she doesn’t exactly like the material in these weeks due to them feeling more analysis–y than statistics–y and I completely agree; the number of assumptions in some theorems is so large that they become a pain to check through whenever you are working on homework. I don’t think these weeks were bad by any means, but they were definitely not the best either.These problems mostly end by the time we discuss QMD, which may seem like the bashiest, why–does–this–exist definition when you first learn them, but you will quickly learn how useful they are for the rest of the semester; it’s actually astonishing how much QMD gets used as the most important assumption in so many theorems despite how ugly the definition is. So the estimation unit is basically divided into two halves: the first half which is dry and the second half which utilizes QMD. So if you have hatred for analysis, you may not like the course at the beginning, but I do promise that it will get better as it goes on.For the hypothesis test unit, Pragya does a great job at explaining why we should test the asymptotic power of different hypothesis testing methods using an alternative that gets harder and harder as the sample size increases. The motivation is great, and using LeCam’s Third Lemma to get results for this is pretty satisfying. The one issue I had however is that we don’t exactly derive many ways to get the asymptotic power under the alternatives in class nor in the notes. For example, for the Likelihood–Ratio Test, we learned about the asymptotic distribution of the test statistic under the null, but we didn’t really discuss what happens under a sequence of alternatives except in the problem set where we did it only for the Gaussian case. It would have been helpful to better integrate the measure theory that came before this because as it stands, it doesn’t feel like I learned that much about how to find the power under sequences of alternatives. Nonetheless, a great unit; also extending the idea of a most powerful test to an asymptotically most powerful test was very interesting.Finally, for the Bayesian unit: It needs to be longer. One week of Bayesian statistics that virtually only aims to prove the Bernstein–von–Mises Theorem really doesn’t provide much at all for Bayesian statistics. I do get that this is supposed to be a foundational course and statistics began mostly from a frequentist perspective, but I definitely think that as a class that is supposed to prepare PhDs for research, it should give a wider view of Bayesian inference. This may be difficult to do since the material is pretty packed already, but I definitely think that the estimation unit was too long and some parts of it (example: perhaps proof of asymptotic normality of MLE? It is an important result but the proof was long and felt unmotivated for the most part.) can be cut to give some more room for Bayesian stuff. I enjoyed what existed of Bayesian inference in the course nevertheless.Lectures: 4.8\/5. Pragya is a great lecturer and makes it incredibly obvious that she knows what she is talking about. She also occasionally makes jokes that integrate into what she was talking about perfectly, which gives the lectures a little spark that I’ve only seen Pragya be able to accomplish. The only complaint I have is that the lectures can be a bit dry sometimes (especially in the estimation unit), but this mostly just occurs on topics that are dry in the first place.Problem Sets: 4.3\/5. There are biweekly problem sets, and there are 5 total with one drop. Let me make this clear: Unless you are more of a math major than a statistics major (even then I feel this may apply), Stat 213 is NOT easier than Stat 211. The problem sets are less of “find the one hard–to–see trick” that Stat 211 often employed. The difficulty of Stat 213 homework comes from the difficulty of the material itself (not to say Stat 211 had easy material, but it was definitely easier than 213). Stat 213 material is packed and we don’t go over applications to all of the theorems; these applications are moved to the problem sets, and this can make the homework very difficult. This isn’t really problematic, but just something you should be aware of going into this course. As for grading, I would sometimes lose points for “formality,” but I’m not sure exactly where the formality points lie as they can be very subjective and the staff solutions can seem short and less formal as well. Another thing to be aware of.One thing I should mention though: I utterly failed to befriend PhD students in this class, so I basically worked on the problem sets alone. I’m sure the homework is a lot easier if you are less introverted than me and actually get to know some PhD students lol.However, one big problem that makes my opinion of problem sets be lower than it deserves: The first two problems in the fourth assignment were in the section notes. I didn’t realize this, so I basically had to solve this from scratch. This leads to two outcomes, both of which are problematic: 1. Someone who didn’t read the section notes tries to solve the problem. Then they are disadvantaged by those who did read it. 2. Someone who did read the section notes copies the solution. Then they are disadvantaged by the fact they didn’t really learn from the problem. Either way, this is a problem; I strongly believe that no problem presented in section should be on the homework. These two problems weren’t exactly the hardest problems in problem sets so it isn’t as bad as it could have been, but something to keep in mind for the course heading forward.My advice for undergrads: TL;DR: If you are in the following set, I would recommend taking the course:{Took analysis} \\cap (({Interested in stats} \\cap {Took measure theory}) \\cup {REALLY interested in stats}) \\cap {Have time for this course}. I was in the {REALLY interested in stats} set and not in the {Took measure theory} set (which made it more challenging for me), and I have no regrets about taking this course. It’s very foundational and the material is legitimately interesting. I still love the way sequences of more difficult alternative hypotheses were presented as well as how much QMD can be used for good results. If you really love statistics, I can’t see yourself not enjoying this course. So unless you think this course will be too much of a hassle with your schedule, take it! I would also recommend taking it your sophomore\/junior year as it can be difficult to manage this your senior year especially if you want to write a thesis. But definitely have a Plan B in case you find this class to be overwhelming.And be warned: There are 24 hour take–home midterm and final, and those are brutal.That concludes my essay. Hopefully any undergrads reading this found it helpful.For Pragya: Thank you for a great semester! I’m sure I wasn’t the most talented undergrad you’ve had during your time teaching this course (I would actually bet I’m the least talented undergrad you’ve had in this course lol), but I truly enjoyed Stat 213 and the material was so interesting. I got a lot out of this class, and I hope you continue to teach Stat 213 as you are amazing!","best_comment_short":"I’m sure I wasn’t the most talented undergrad you’ve had during your time teaching this course (I would actually bet I’m the least talented undergrad you’ve had in this course lol), but I truly enjoyed Stat 213 and the material was so interesting.","best_comment_first":"I originally told my friends that I would joke around and put nothing but “Gem” on my Qguide review, but as the only undergrad in the course this year (now Pragya knows exactly who is writing this so I better watch what I say), I feel like I should accept at least a little bit of responsibility and give an actual review for any undergrads who are thinking of taking this course.","course_id":"159802","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=67581e5807a3adb0227e4536aca9fe3ba2070226fbbe6625efcb2f1c08e359f9d62247b7a0eb3edeb356ef92d04a0151&ReportType=2&regl=en-US"},{"course_code":"GOV 1430","course_title_2026":"Tech Science to Save the World","course_score_mean":4.37,"rec_score_mean":4.58,"gem_probability_mean":0.0,"sentiment_score_median":0.8799,"best_gem_comment":"","workload_score_mean":4.89,"best_gem_comment_short":"","best_comment":"Take this course! Professor Sweeney is such an engaging speaker and has such great knowledge and experience on the topics we discuss. Our unit projects were a great way to explore the topics deeper, but also allowing us to tie in our own interests. The support for our final projects was great, and I loved the final project fair where we got to see what other peers had found for their research projects.","best_comment_short":"The support for our final projects was great, and I loved the final project fair where we got to see what other peers had found for their research projects.","best_comment_first":"Take this course!","course_id":"110053","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=93a1fa24d237ac0cc75de70889fc34ba4636d3370c32e89c0648194415e2172d2d4bf5e49f2badaf7ee0cd71e482abb8&ReportType=2&regl=en-US"},{"course_code":"PHYSICS 153","course_title_2026":"Electrodynamics","course_score_mean":4.34,"rec_score_mean":4.36,"gem_probability_mean":0.0,"sentiment_score_median":0.8765,"best_gem_comment":"","workload_score_mean":9.33,"best_gem_comment_short":"","best_comment":"Physics 153 with Girma is an incredible experience. Although Girma is not the clearest of lecturers, this is compensated by his boundless enthusiasm and love for electrodynamics which he radiates (no EM pun intended) at every lecture! Girma is a very accessible instructor whom you can ask any question without fear of judgment, and it was always a pleasure to attend his office hours during which I gained a lot of physical insight. The subject–matter of the course — electrodynamics — is an extremely beautiful subject, and knowledge and mastery thereof is crucial to any budding theoretical physicist. Unfortunately, we did not cover the entirety of Griffiths in sufficient depth due to temporal constraints — which is a shame — but in future renditions of the course, this can be easily remedied by adding a third lecture every week. In terms of prior background and preparation, 153 is a self–contained course that builds up the theory of classical electrodynamics from scratch, so you really do not need a ton of prior knowledge in EM (contrary to what the course prerequisites might say). That being said, such knowledge is useful insofar as it makes the fast pace of 153 more manageable. Personally, I came into the class with only AP Physics C and physics 19 under my belt and did just fine (incidentally, this just goes to show that physics 16 really is unnecessary for more advanced courses like 153). If you're considering taking 153, my suggestion would be to study chapter 1 of Griffiths over winter break if you have never seen multi–variable calculus before. If you have time, you should also take a look at chapters 2 and 3 just so that you don't get lost in the first few weeks. To end this QGuide, I'd like to give some advice on how to get the most out of 153 during the semester. Besides going to all the lectures, I strongly recommend that you read Griffiths (by read, I mean read it religiously). Due to lack of time, I did not read Griffiths in its entirety, which in hindsight I regret given the phenomenal amount of physical insight that this book contains. I think the best strategy is to read Girma's lecture notes before coming to lecture to get a brief overview of the material that will be covered (otherwise, you will easily get lost, because oftentimes Girma skips a lot of the mathematical steps and refers you to the lecture notes), and then after lecture you can read the corresponding sections\/chapters in Griffiths to solidify your understanding. I cannot stress the importance of doing this, because with the take–home format of the exams, it is very easy to get away with fragmented understanding of the material, whereas what you should be aiming for is a robust grasp on electrodynamics. TL;DR: Fantastic course, beautiful material, wonderful instructor. Not a lot of background is required. Just read the first chapter(s) of Griffiths over winter break, and make an effort to read the textbook throughout the semester to get the most out of this course.","best_comment_short":"TL;DR: Fantastic course, beautiful material, wonderful instructor.","best_comment_first":"Physics 153 with Girma is an incredible experience.","course_id":"111822","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=08441061125b6df412693117a9e0ffab3c91184b7b1d0b7d847e733302bb27408effd9c2012b3c9253c0870cdfdc05e9&ReportType=2&regl=en-US"},{"course_code":"CHEM 171","course_title_2026":"Biological Synthesis","course_score_mean":4.33,"rec_score_mean":4.3,"gem_probability_mean":0.0,"sentiment_score_median":0.9337,"best_gem_comment":"","workload_score_mean":8.67,"best_gem_comment_short":"","best_comment":"Chem 171 is a great class overall, but it does have its quirks. Here are some notable pros and cons:Pros:– Professor Balskus is great! She is incredibly knowledgeable and friendly, and genuinely wants everyone to learn– The TFs are also quite good– they gave very useful feedback, held frequent office hours, and genuinely wanted everyone to succeed– The course material is quite interesting– the first 1\/2 of the course is pretty much a speedrun of Chem 27 (how organisms make all kinds of biomolecules) but more in–depth and with some added categories, and the second 1\/2 of the course is how to apply your knowledge of how biomolecules are made to do interesting science (such as identifying the genes responsible for making the molecule, identifying the molecule made by a set of genes, and using biocatalysis to engineer new ways to make molecules)– The class is a good mix of Undergrads and Grad students, so you will definitely meet new people– The class takes ~7 hours per week, which is pretty standard– There are a few guest lectures from people in Biochem \/ Biocatalysis who come and visit, so you will see industrial applications of the topics and maybe even build useful connectionsCons:– The sections are not very engaging. The sections are quite interesting in theory– each section, you learn about and use a new Bioinformatic tool, and in your final project, you use 3 of those tools you learned about. However, the sections do not have enough structure in my opinion, as most of the time was spent just playing around with the bioinformatic tool yourself– The grading on psets was incredibly harsh– multiple points are taken off for simple \/ non–understanding mistakes, such as not writing water or acid\/base co–products. This detracted from finding where my understanding was lacking– The psets, tests, and projects took a while to be returned (but the feedback was good, so this is not the biggest deal)– No information was provided about the grading curve at any point in the semesterTL;DR: Chem 171 is a good class and I would recommend it to anyone interested in biochemistry. It has some quirks, such as the grading being harsh and the sections not having enough structure, but overall, I learned a lot and had a great time in the class!","best_comment_short":"She is incredibly knowledgeable and friendly, and genuinely wants everyone to learn– The TFs are also quite good– they gave very useful feedback, held frequent office hours, and genuinely wanted everyone to succeed– The course material is quite interesting– the first 1\/2 of the course is pretty much a speedrun of Chem 27 (how organisms make all kinds of biomolecules) but more in–depth and with some added categories, and the second 1\/2 of the course is how to apply your knowledge of how biomolecules are made to do interesting science (such as identifying the genes responsible for making the molecule, identifying the molecule made by a set of genes, and using biocatalysis to engineer new ways to make molecules)– The class is a good mix of Undergrads and Grad students, so you will definitely meet new people– The class takes ~7 hours per week, which is pretty standard– There are a few guest lectures from people in Biochem \/ Biocatalysis who come and visit, so you will see industrial applications of the topics and maybe even build useful connectionsCons:– The sections are not very engaging.","best_comment_first":"Chem 171 is a great class overall, but it does have its quirks.","course_id":"107702","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=20a4df32a3cd6cb3e55caed548e7a385ec707f35a22790eff7a8d4773ec037a9f1af38a3a0027c598f705923bf7bec70&ReportType=2&regl=en-US"},{"course_code":"ESE 101","course_title_2026":"Global Warming Science 101","course_score_mean":4.32,"rec_score_mean":4.39,"gem_probability_mean":0.0,"sentiment_score_median":0.5296,"best_gem_comment":"","workload_score_mean":5.45,"best_gem_comment_short":"","best_comment":"Be prepared to do the work, if you stay on top of it, you will cruise. I wasn’t a fan of the in class format personally but I could see how it works well for some. Eli is a fantastic lecturer, very entertaining and open minded. I would recommend this course for anyone interested in climate change and the math behind the science.","best_comment_short":"Eli is a fantastic lecturer, very entertaining and open minded.","best_comment_first":"Be prepared to do the work, if you stay on top of it, you will cruise.","course_id":"214500","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3a1a56bb520c0b0194f9831cd240b17220c84242146ce3f1a9f6f42e351b6e89483dd4930231dd21187eebf9704203f3&ReportType=2&regl=en-US"},{"course_code":"E-PSCI 101","course_title_2026":"Global Warming Science 101","course_score_mean":4.32,"rec_score_mean":4.39,"gem_probability_mean":0.0,"sentiment_score_median":0.5296,"best_gem_comment":"","workload_score_mean":5.45,"best_gem_comment_short":"","best_comment":"Be prepared to do the work, if you stay on top of it, you will cruise. I wasn’t a fan of the in class format personally but I could see how it works well for some. Eli is a fantastic lecturer, very entertaining and open minded. I would recommend this course for anyone interested in climate change and the math behind the science.","best_comment_short":"Eli is a fantastic lecturer, very entertaining and open minded.","best_comment_first":"Be prepared to do the work, if you stay on top of it, you will cruise.","course_id":"214499","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3a1a56bb520c0b0194f9831cd240b17220c84242146ce3f1a9f6f42e351b6e89483dd4930231dd21187eebf9704203f3&ReportType=2&regl=en-US"},{"course_code":"STAT 109B","course_title_2026":"Data Science 2: Advanced Topics in Data Science","course_score_mean":4.29,"rec_score_mean":4.29,"gem_probability_mean":0.0,"sentiment_score_median":0.7296,"best_gem_comment":"","workload_score_mean":11.41,"best_gem_comment_short":"","best_comment":"209b is really fantastic, and the topics we discuss feel very relevant and current. I had mixed feelings about 209a, but I really enjoyed 209b. I'd say that while the general workload of the homework is roughly the same in 209b as in 209a, I found the homework in 209b to be more interesting and enjoyable to complete. I believe that 209a and 209b truly built the foundation for the SM in Data Science program, and I'm glad I took both. Pavlos, Chris, and Nitesh are all fantastic instructors, and I am grateful that I had the opportunity to learn from them.","best_comment_short":"Pavlos, Chris, and Nitesh are all fantastic instructors, and I am grateful that I had the opportunity to learn from them.","best_comment_first":"209b is really fantastic, and the topics we discuss feel very relevant and current.","course_id":"203102","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0bd3be7e7943c569eaeaf3399d336f5b9dba81069b8d1665ba52add0cf5f5dd0d64c5476ddc9c8cf184c9923c59b47db&ReportType=2&regl=en-US"},{"course_code":"APCOMP 209B","course_title_2026":"Data Science 2: Advanced Topics in Data Science","course_score_mean":4.29,"rec_score_mean":4.29,"gem_probability_mean":0.0,"sentiment_score_median":0.7296,"best_gem_comment":"","workload_score_mean":11.41,"best_gem_comment_short":"","best_comment":"209b is really fantastic, and the topics we discuss feel very relevant and current. I had mixed feelings about 209a, but I really enjoyed 209b. I'd say that while the general workload of the homework is roughly the same in 209b as in 209a, I found the homework in 209b to be more interesting and enjoyable to complete. I believe that 209a and 209b truly built the foundation for the SM in Data Science program, and I'm glad I took both. Pavlos, Chris, and Nitesh are all fantastic instructors, and I am grateful that I had the opportunity to learn from them.","best_comment_short":"Pavlos, Chris, and Nitesh are all fantastic instructors, and I am grateful that I had the opportunity to learn from them.","best_comment_first":"209b is really fantastic, and the topics we discuss feel very relevant and current.","course_id":"203547","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0bd3be7e7943c569eaeaf3399d336f5b9dba81069b8d1665ba52add0cf5f5dd0d64c5476ddc9c8cf184c9923c59b47db&ReportType=2&regl=en-US"},{"course_code":"MATH 121","course_title_2026":"Linear Algebra","course_score_mean":4.29,"rec_score_mean":4.43,"gem_probability_mean":0.0,"sentiment_score_median":0.40695,"best_gem_comment":"","workload_score_mean":8.43,"best_gem_comment_short":"","best_comment":"This course is great! And Gage is an amazing lecturer.","best_comment_short":"This course is great!","best_comment_first":"This course is great!","course_id":"120228","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e80dc5aed0f869eadf3e20055fe1376d1b3bdeceec65b1c2f0e4ae7d560eed416a9681be87644d6137fb68dd55198eeb&ReportType=2&regl=en-US"},{"course_code":"COMPSCI 1090B","course_title_2026":"Data Science 2: Advanced Topics in Data Science","course_score_mean":4.29,"rec_score_mean":4.29,"gem_probability_mean":0.0,"sentiment_score_median":0.7296,"best_gem_comment":"","workload_score_mean":11.41,"best_gem_comment_short":"","best_comment":"209b is really fantastic, and the topics we discuss feel very relevant and current. I had mixed feelings about 209a, but I really enjoyed 209b. I'd say that while the general workload of the homework is roughly the same in 209b as in 209a, I found the homework in 209b to be more interesting and enjoyable to complete. I believe that 209a and 209b truly built the foundation for the SM in Data Science program, and I'm glad I took both. Pavlos, Chris, and Nitesh are all fantastic instructors, and I am grateful that I had the opportunity to learn from them.","best_comment_short":"Pavlos, Chris, and Nitesh are all fantastic instructors, and I am grateful that I had the opportunity to learn from them.","best_comment_first":"209b is really fantastic, and the topics we discuss feel very relevant and current.","course_id":"203546","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0bd3be7e7943c569eaeaf3399d336f5b9dba81069b8d1665ba52add0cf5f5dd0d64c5476ddc9c8cf184c9923c59b47db&ReportType=2&regl=en-US"},{"course_code":"ANTHRO 98B","course_title_2026":"Junior Tutorial for Thesis Writers in Anthropology","course_score_mean":4.18,"rec_score_mean":4.75,"gem_probability_mean":0.0,"sentiment_score_median":0.7195,"best_gem_comment":"","workload_score_mean":5.64,"best_gem_comment_short":"","best_comment":"I had an AMAZING TF, and I was lucky. Regardless of your TF, this class it truly what you make of it. If you're doing multiple readings a week and using assignments well, you'll be prepared for your prospectus. I would use the 4 assignments to scaffold to your prospectus (ex. #1 for me was a roundup of my sources from the first chunk of the semester, #3 was a draft of the prospectus lit review). Damina, Andrew, and Alex are key supports –– use them. And go to Andrew's workshops!","best_comment_short":"I had an AMAZING TF, and I was lucky.","best_comment_first":"I had an AMAZING TF, and I was lucky.","course_id":"205522","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=beb0d277b009f6d9ade913f146dfe03b3bbfbe2af1fb4c19fabf516154edc569e13c1aa61be39387a4466324ae80c27c&ReportType=2&regl=en-US"},{"course_code":"GENED 1090","course_title_2026":"What Is a Book? From the Clay Tablet to the Kindle","course_score_mean":4.14,"rec_score_mean":4.24,"gem_probability_mean":0.0,"sentiment_score_median":0.95725,"best_gem_comment":"","workload_score_mean":5.21,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!What an amazing Gened, and what great teaching staff. I'm a CS guy, and I don't really like books: this class was out of my comfort zone. But it was so engaging and informative. This is the transformative college experience they tell you about. This class was so well taught: the professor is so knowledgeable and engaging. There is one short writing assignment that you do before each lecture. The readings for this class are a bit lengthy, but you can get by with skimming them as they're not too difficult to understand. Section for this class is so engaging: you get to see and interact with so much of Harvard's campus.The final project was also incredibly flexible. You can combine your background with the things you learned in this class to challenge the idea of what a book is: I coded an immersive online book and it was so fun. Great way to top off the semester.The teaching staff is honestly amazing. I was in Deborah's section (couldn't recommend more), and you could tell that she cared so much about the content.All in all, great class. No complaints whatsoever. TLDR: Good workload, great teaching staff, interesting lectures, fun sections, awesome final project.","best_comment_short":"TLDR: Good workload, great teaching staff, interesting lectures, fun sections, awesome final project.","best_comment_first":"TAKE THIS CLASS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","course_id":"212857","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=39c44147a5a587d53328bc122e70bfc6fa5b9c3a3e8506a15182af74c47d5c6a9206c3157fab368e2a0895350a047a96&ReportType=2&regl=en-US"},{"course_code":"PSY 1534","course_title_2026":"Personal and Societal Wellbeing","course_score_mean":4.07,"rec_score_mean":4.36,"gem_probability_mean":0.0,"sentiment_score_median":0.79585,"best_gem_comment":"","workload_score_mean":4.29,"best_gem_comment_short":"","best_comment":"i really enjoyed this course. professor vu is wonderful. lots of super interesting readings, class discussions, and takeaways that i can apply to my every day life. i took the happiness gened and would recommend this class to anyone interested in those kind of topics.","best_comment_short":"i took the happiness gened and would recommend this class to anyone interested in those kind of topics.","best_comment_first":"i really enjoyed this course.","course_id":"224464","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=96e9778b3897163630390fe03a64d1719158055cdcdb37a04c48e60e0b8f60cf7f0b13112e86f620d5f2240cd106f145&ReportType=2&regl=en-US"}]