[{"course_code":"MUSIC BHFB","course_title_2026":"Graduate Musicianship","course_score_mean":5.0,"rec_score_mean":4.8,"gem_probability_mean":0.0,"sentiment_score_median":0.3804,"best_gem_comment":"","workload_score_mean":1.83,"best_gem_comment_short":"","best_comment":"Enjoy :)","best_comment_short":"Enjoy :)","best_comment_first":"Enjoy :)","course_id":"160645","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4e7467d4b51a9603e33ce700fd25799d4ca9e3ab08ea96631dc625701a44a45f07f3cff16a48096e4eb74adc4811b074&ReportType=2&regl=en-US"},{"course_code":"IMMUN 305QC","course_title_2026":"Neuroimmune interactions in health and disease","course_score_mean":4.72,"rec_score_mean":4.61,"gem_probability_mean":0.0,"sentiment_score_median":0.475,"best_gem_comment":"","workload_score_mean":2.0,"best_gem_comment_short":"","best_comment":"This is a fantastic course! Each class session starts with a lecture by a different guest speaker professor and then concludes with a paper presentation\/discussion. The lectures by the guest speakers are all really interesting and each cover a different area of neuroimmune interactions in health and disease, together providing a varied and broad look into this area. The paper presentations are also interesting for reading in detail about particular examples of studies in the areas described in the lectures. Overall this course was very interesting and informative. Definitely a great course to take if you are interested in neuroimmune interactions in health and disease!","best_comment_short":"Definitely a great course to take if you are interested in neuroimmune interactions in health and disease!","best_comment_first":"This is a fantastic course!","course_id":"130342","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1a85ecd4b72a5d3783cf3fdfaafb689f1bb22b2b08049d5c92a12e3f6db8688697d6f4d8b8766f67e70ee21f8567f3f5&ReportType=2&regl=en-US"},{"course_code":"FYSEMR 51X","course_title_2026":"Changing Perspectives: the Science of Optics in the Visual Arts","course_score_mean":4.89,"rec_score_mean":4.89,"gem_probability_mean":0.0,"sentiment_score_median":0.9583,"best_gem_comment":"","workload_score_mean":2.11,"best_gem_comment_short":"","best_comment":"If you are interested in art and the science behind it, take this class!! Professor Samuel knows so much about the topic and is so enthusiastic about it.  You get a chance to go on so many cool field trips, meet with art conservators, artists, and so many cool and interesting people. It is a great combination of hands on approach, testing out how the science of optic can help you make better and more realistic art and professor's presentations about the topic. Genuinely such an interesting class!!","best_comment_short":"It is a great combination of hands on approach, testing out how the science of optic can help you make better and more realistic art and professor's presentations about the topic.","best_comment_first":"If you are interested in art and the science behind it, take this class!!","course_id":"215849","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a5443a112d70df8c55abe25af80840a768d581bd01fa01f2090c1a2a5cde7b4e7a6051f9921553c91bbb0581e74a7f68&ReportType=2&regl=en-US"},{"course_code":"FYSEMR 73U","course_title_2026":"Reading the History of Boston","course_score_mean":4.67,"rec_score_mean":4.67,"gem_probability_mean":0.0,"sentiment_score_median":0.85675,"best_gem_comment":"","workload_score_mean":2.25,"best_gem_comment_short":"","best_comment":"This class was a great first year seminar! I feel like a learned cool material in a very chill and friendly environment. The trips were a lot of fun, and I got to see some parts of Boston that I haven't seen before. If you are interested in maps or history or cities or just want to learn something new, you should totally take this class.","best_comment_short":"I feel like a learned cool material in a very chill and friendly environment.","best_comment_first":"This class was a great first year seminar!","course_id":"224891","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ae125c5b1e36933002e5b0cb11928a5c8ff067cf288c955278308139afd369ba2af88fc2d98e89106221887de51c0435&ReportType=2&regl=en-US"},{"course_code":"HIST 1973","course_title_2026":"Re-Wilding Harvard","course_score_mean":4.75,"rec_score_mean":4.75,"gem_probability_mean":0.0,"sentiment_score_median":0.62075,"best_gem_comment":"","workload_score_mean":2.71,"best_gem_comment_short":"","best_comment":"This is the first class at Harvard where I feel like I’ve really made a difference in any tangible way. Prof. Chaplin is fantastic, the course gives you a lot of great landscaping and design ideas, and i know my future backyard will thank me for this. Take this class. Most fun 2 hours of the week every week.","best_comment_short":"Prof. Chaplin is fantastic, the course gives you a lot of great landscaping and design ideas, and i know my future backyard will thank me for this.","best_comment_first":"This is the first class at Harvard where I feel like I’ve really made a difference in any tangible way.","course_id":"216271","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b20f096b3afac25a4fd84c6ddaa5bfa786f5997c51c49edc91dacf2974679f4ea13406d92c2f8a8911f2ca646ec1b189&ReportType=2&regl=en-US"},{"course_code":"HEB 145","course_title_2026":"Thinking Through Human Cognition","course_score_mean":4.32,"rec_score_mean":4.37,"gem_probability_mean":0.0,"sentiment_score_median":0.8834,"best_gem_comment":"","workload_score_mean":2.76,"best_gem_comment_short":"","best_comment":"This course is great if you are a curious person and genuinely interested in human evolution, psychology, sociology\/anthropology, etc. The lectures are interesting but long, and the assignments are infrequent and pretty straightforward but worth a lot of your grade. I would recommend taking this if you have a cognitive trait or two that you are interested in studying and have some background to build off of! The written assignments definitely benefit from having some background or personal interest. For example, i wrote about a cognitive trait that is realted to somethign i study from a basic science perspective in my thesis,","best_comment_short":"This course is great if you are a curious person and genuinely interested in human evolution, psychology, sociology\/anthropology, etc.","best_comment_first":"This course is great if you are a curious person and genuinely interested in human evolution, psychology, sociology\/anthropology, etc.","course_id":"222987","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=805970c314b182a1dba9ae6172a8d333f45e0082a5e41af018d3cc996b0e70ae0df90b9229a9b7321ddba8ace8bf9793&ReportType=2&regl=en-US"},{"course_code":"PSY 1322","course_title_2026":"Decisions Big and Small: The Cognitive Science of Making Up Your Mind","course_score_mean":4.57,"rec_score_mean":4.52,"gem_probability_mean":0.0,"sentiment_score_median":0.9622,"best_gem_comment":"","workload_score_mean":3.0,"best_gem_comment_short":"","best_comment":"This is the best class I took at Harvard. The professor is EXCELLENT. His lectures are engaging and inspiring. He knows a lot about the topic and is very organized, his lectures are structured and very interesting and interactive. The topics are great – it covers everything about decision–making. This class really changed my way of thinking. I would STRONGLY recommend that anyone who is interested in decision–making takes this course. Professor Ullman is the best, his class is more complete and deep than many HKS and graduate courses I took about decision–making. The course work is easy and the final project is really fun because you can choose what you want to do (movie, song, paper, etc.). This class is just one of the most inspiring I ever took and Prof. Ullman one of the best and smartest people I have met.","best_comment_short":"This class is just one of the most inspiring I ever took and Prof. Ullman one of the best and smartest people I have met.","best_comment_first":"This is the best class I took at Harvard.","course_id":"212749","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=bb8ea4d9328d20624c7ffaca9a4b9d4774160895ceda338fa13e59fb2f039972b0cb4b9ec1b3e0853ee4ad61606bfc9a&ReportType=2&regl=en-US"},{"course_code":"HAA 279P","course_title_2026":"The Object in the Art Museum","course_score_mean":4.75,"rec_score_mean":4.85,"gem_probability_mean":0.0,"sentiment_score_median":0.94305,"best_gem_comment":"","workload_score_mean":3.25,"best_gem_comment_short":"","best_comment":"Take this class (please please please remember to apply on time – it is popular and hard to get in but if you demonstrate your own interesting perspectives you stand a great shot!)! This class had about 5–6 undergrads and the rest (8) were grad students across HAA, HKS, HLS, and the Divinity School. Everyone brought such interesting ideas and perspectives to every class. Joachim and Kate are incredible professors and you will gain a totally new appreciation for art and art museums by learning everything from art dealers to provenance to restoration and everything in between.  The weekly assignments and readings aren't too long but to get the most out of the course you should do them. The major project of the course is a 10 page paper on an object you pick (that will be going into an exhibit – our kunstkamer objects go on display in July 2025, more on that later) and it's super interesting.On the objects, this was mainly about Dutch 16–17th century art. Since our collection is going up I'm not sure what the focus will be but it's worth reaching out and asking because if you aren't at all interested in the theme you won't get as much out of the course as someone who is – like we all became experts on Dutch 16–17th century art. All in all, my favorite course at Harvard and my only Arts and Humanities course and what an incredible way to finish up college.","best_comment_short":"Take this class (please please please remember to apply on time – it is popular and hard to get in but if you demonstrate your own interesting perspectives you stand a great shot!)!","best_comment_first":"Take this class (please please please remember to apply on time – it is popular and hard to get in but if you demonstrate your own interesting perspectives you stand a great shot!)!","course_id":"211197","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d29fc768155af353aa273adefd414391d586361082f256cef76e16300d8a3484eadea1fcf6f5c1781dc6bd54d590fed0&ReportType=2&regl=en-US"},{"course_code":"SPANSH 80TS","course_title_2026":"Translating Boundaries in Modern Spain","course_score_mean":4.88,"rec_score_mean":4.88,"gem_probability_mean":0.0,"sentiment_score_median":0.9139,"best_gem_comment":"","workload_score_mean":3.38,"best_gem_comment_short":"","best_comment":"Highly highly recommend! Daniel is a super fun professor and he's very supportive and creative in the way he teaches the class. I never realized that you could learn so much about a language, the culture, the politics and the people in just translating 8 sentences from english–>spanish and spanish–>english. Love how this class is structured like a workshop than a class.","best_comment_short":"Daniel is a super fun professor and he's very supportive and creative in the way he teaches the class.","best_comment_first":"Highly highly recommend!","course_id":"216092","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c56b461ede87c55116c07098f52ffa9a3aa316ae3965dc8e708368f14314673a5df7b48911dd706f42f82d317f2de8da&ReportType=2&regl=en-US"},{"course_code":"HEB 190","course_title_2026":"Advanced Topics in Human Physiology","course_score_mean":4.82,"rec_score_mean":4.73,"gem_probability_mean":0.0,"sentiment_score_median":0.8977,"best_gem_comment":"","workload_score_mean":3.45,"best_gem_comment_short":"","best_comment":"I would recommend taking this class if you enjoy small discussion–based courses and feel comfortable with reading and talking about scientific papers. The class felt very engaging and everyone freely expressed their opinions. I definitely learned a lot about a topic that is becoming increasingly more popular, and enjoyed the class! Dr. Allen–Blevins is also awesome!!","best_comment_short":"I definitely learned a lot about a topic that is becoming increasingly more popular, and enjoyed the class!","best_comment_first":"I would recommend taking this class if you enjoy small discussion–based courses and feel comfortable with reading and talking about scientific papers.","course_id":"225903","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3ea13e6d7c2442b3e4b54458e04e52383fe6474d55d60a424a10818370db1e872b2c1386fca3cd97bc4047760b80d077&ReportType=2&regl=en-US"},{"course_code":"SOCIOL 1148","course_title_2026":"Race and Ethnicity in Global and Comparative Perspective","course_score_mean":5.0,"rec_score_mean":5.0,"gem_probability_mean":0.0,"sentiment_score_median":0.7332,"best_gem_comment":"","workload_score_mean":3.57,"best_gem_comment_short":"","best_comment":"TAKE THIS COURSE!!! This is arguably the only course at Harvard where I received the academic experience I've been searching for. I enjoyed learning about race and ethnicity (my understanding of which has completely transformed) through several distinct, interesting cases across time and space. Ellis made it a point to apply what we learned to contemporary society, which I found especially valuable. Moreover, he managed to create a laidback (but still engaging) environment that always invited discussion, which I really did appreciate. I will admit that the readings could feel a bit dense at times, though I was taking this course with other courses with very dense readings. I think every student should take this course for how transformative and applicable it is—if you have the space, take this course, and if you don't, make the space!","best_comment_short":"I enjoyed learning about race and ethnicity (my understanding of which has completely transformed) through several distinct, interesting cases across time and space.","best_comment_first":"TAKE THIS COURSE!!!","course_id":"207630","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9cdd93d31802e102e0a76e3186b85b3dcb47d6dfe4009f0c8cb82435e262238f3922a93f2758ec78bafdf0b10bc47249&ReportType=2&regl=en-US"},{"course_code":"ENGLISH CNFJ","course_title_2026":"Narrative Journalism","course_score_mean":4.88,"rec_score_mean":5.0,"gem_probability_mean":0.0,"sentiment_score_median":0.9399,"best_gem_comment":"","workload_score_mean":3.57,"best_gem_comment_short":"","best_comment":"This was my second time taking a class with Louisa, and I can say that she is undoubtedly one of the most empathetic and fantastic instructors I have had the opportunity to learn from in my time at Harvard. The thoughtfulness, care, and structure she brought to the class were excellent, as was her selection of students, which made me look forward to coming to class each week so much. Our readings were engaging and very accessible and I come away from this semester having learnt so much and genuinely grown so so much as both a reader and writer. Can't recommend this class enough to anyone considering!","best_comment_short":"The thoughtfulness, care, and structure she brought to the class were excellent, as was her selection of students, which made me look forward to coming to class each week so much.","best_comment_first":"This was my second time taking a class with Louisa, and I can say that she is undoubtedly one of the most empathetic and fantastic instructors I have had the opportunity to learn from in my time at Harvard.","course_id":"224422","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c9458c4e0bd8343f9fa5410c18ada458543cb41f710a9170ff1d29c5405850b44fea1715fc811aaac1010fba594bfef0&ReportType=2&regl=en-US"},{"course_code":"AFRAMER 97","course_title_2026":"Sophomore Tutorial: Understanding Race and Racism","course_score_mean":4.83,"rec_score_mean":4.83,"gem_probability_mean":0.0,"sentiment_score_median":0.9062,"best_gem_comment":"","workload_score_mean":3.6,"best_gem_comment_short":"","best_comment":"Great class! Pretty much just an open discussion about the readings every class so it's super chill and just a good class to get to know other people in the concentration.","best_comment_short":"Pretty much just an open discussion about the readings every class so it's super chill and just a good class to get to know other people in the concentration.","best_comment_first":"Great class!","course_id":"123590","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e03fd904bcf621e9eae3431c3838853d48dcdf6b35f0a430d0b4ed700c3c6c93ecf3b6109d630a14375aa94f7bf72c79&ReportType=2&regl=en-US"},{"course_code":"GOV 1010","course_title_2026":"Survey Research Methods","course_score_mean":4.38,"rec_score_mean":4.57,"gem_probability_mean":0.0,"sentiment_score_median":0.6558,"best_gem_comment":"","workload_score_mean":3.7,"best_gem_comment_short":"","best_comment":"professor harrison himself has a great amount of enthusiam for the subject and i respect that but somehow not an ounce of it rubbed off on me throughout the entire semester. the only interesting component is the survey project so make sure to pick a topic that you are actually passionate about.","best_comment_short":"the only interesting component is the survey project so make sure to pick a topic that you are actually passionate about.","best_comment_first":"professor harrison himself has a great amount of enthusiam for the subject and i respect that but somehow not an ounce of it rubbed off on me throughout the entire semester.","course_id":"119479","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4768587afd530432d176479b9ae9ec6bd9245abdd0a5d3d132e4e1237b8f56348cb5042aa9cccdf4d5183023372daf2c&ReportType=2&regl=en-US"},{"course_code":"ENGLISH CLPG","course_title_2026":"Play and Games: The Art of Sportswriting","course_score_mean":4.82,"rec_score_mean":4.91,"gem_probability_mean":0.0,"sentiment_score_median":0.9524,"best_gem_comment":"","workload_score_mean":3.7,"best_gem_comment_short":"","best_comment":"I think that your writing improves over the semester since you're able to write in several different styles. You pick up different methods from other students as well, which is really helpful. Super chill environment, and final paper is a lot of fun to write. Louisa is a fantastic instructor as well. Would definitely recommend.","best_comment_short":"Super chill environment, and final paper is a lot of fun to write.","best_comment_first":"I think that your writing improves over the semester since you're able to write in several different styles.","course_id":"221781","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1f5b77378c21eaf3379753b369b8723cee3fd48d8c15f1de109279bca01d80c7376c15e8993b51c0cc2231d4c137e400&ReportType=2&regl=en-US"},{"course_code":"ENG-SCI 277","course_title_2026":"Microfabrication Laboratory","course_score_mean":4.75,"rec_score_mean":4.88,"gem_probability_mean":0.0,"sentiment_score_median":0.9117,"best_gem_comment":"","workload_score_mean":3.77,"best_gem_comment_short":"","best_comment":"ES177 is a great course. Throughout the semester, you have 4 labs (each ~4 hours), 4 lab reports, and 1 final project review (or final project if you take ES277). The four–hour lab can sound intimidating, but it was honestly a good time. A lot of the time, we finished early. If we went past dinner, the class had a budget and got food afterwards as a group.This course is a great way to get ISO–5 cleanroom experience, especially with microfabrication. Getting microfab cleanroom experience is typically not offered for undergrads, so this is a great opportunity to try something new. I recommend the course!","best_comment_short":"Getting microfab cleanroom experience is typically not offered for undergrads, so this is a great opportunity to try something new.","best_comment_first":"ES177 is a great course.","course_id":"109357","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=577a7831bfdc545e00eac1a6274f08e72e44fc29e94b281fddb38e09c4cc601d6182fcca4198b75bda0accfa807e81aa&ReportType=2&regl=en-US"},{"course_code":"ENG-SCI 177","course_title_2026":"Microfabrication Laboratory","course_score_mean":4.75,"rec_score_mean":4.88,"gem_probability_mean":0.0,"sentiment_score_median":0.9117,"best_gem_comment":"","workload_score_mean":3.77,"best_gem_comment_short":"","best_comment":"ES177 is a great course. Throughout the semester, you have 4 labs (each ~4 hours), 4 lab reports, and 1 final project review (or final project if you take ES277). The four–hour lab can sound intimidating, but it was honestly a good time. A lot of the time, we finished early. If we went past dinner, the class had a budget and got food afterwards as a group.This course is a great way to get ISO–5 cleanroom experience, especially with microfabrication. Getting microfab cleanroom experience is typically not offered for undergrads, so this is a great opportunity to try something new. I recommend the course!","best_comment_short":"Getting microfab cleanroom experience is typically not offered for undergrads, so this is a great opportunity to try something new.","best_comment_first":"ES177 is a great course.","course_id":"109356","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=577a7831bfdc545e00eac1a6274f08e72e44fc29e94b281fddb38e09c4cc601d6182fcca4198b75bda0accfa807e81aa&ReportType=2&regl=en-US"},{"course_code":"ENGLISH CBBR","course_title_2026":"Intermediate Poetry: Workshop","course_score_mean":4.9,"rec_score_mean":5.0,"gem_probability_mean":0.0,"sentiment_score_median":0.7104,"best_gem_comment":"","workload_score_mean":3.78,"best_gem_comment_short":"","best_comment":"This course is excellent! Josh is the best mentor for poetry at Harvard. He is attentive, cares about your work and shows genuine enthusiasm for your growth. My writing has improved significantly, and I feel so much more grounded in my poetic voice. I have taken other poetry workshops in the past with other professors, but Josh is most definitely top–tier!","best_comment_short":"He is attentive, cares about your work and shows genuine enthusiasm for your growth.","best_comment_first":"This course is excellent!","course_id":"146632","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7f9556ccf8a0740446cfe33ee04c6d6ba7e0acebb2b94f9f3aeb21014675f27022577c7d47ea17de64670489a6995b12&ReportType=2&regl=en-US"},{"course_code":"HEB 126","course_title_2026":"Research in Cultural Evolution","course_score_mean":4.67,"rec_score_mean":4.67,"gem_probability_mean":0.0,"sentiment_score_median":0.94825,"best_gem_comment":"","workload_score_mean":3.83,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS! It is such an amazing class if you have even the faintest interest in learning more about cultural evolution. The intimate class size makes it such a welcoming environment and Cammie is such a caring instructor who is truly passionate about the subject matter. The proposal and going through the process of writing it is so insightful and I highly recommend this class.","best_comment_short":"The intimate class size makes it such a welcoming environment and Cammie is such a caring instructor who is truly passionate about the subject matter.","best_comment_first":"TAKE THIS CLASS!","course_id":"218716","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=857b969dc3e1e01d4b6289c18469ba74dbff5c2805875aa4bc613adbbd919af9428e7f25c0fdec516e313b10069b46ff&ReportType=2&regl=en-US"},{"course_code":"MBB 980M","course_title_2026":"Functional Neuroimaging of Psychiatric Disorders: Insights into the Human Brain-Mind","course_score_mean":4.64,"rec_score_mean":4.73,"gem_probability_mean":0.0,"sentiment_score_median":0.8442,"best_gem_comment":"","workload_score_mean":3.91,"best_gem_comment_short":"","best_comment":"Amazing class with great discussions! You will learn about what neuropsychiatry itself is, and the current advances in the field as well as the history of how this field emerged. Be prepared to share your thoughts on the readings.","best_comment_short":"Amazing class with great discussions!","best_comment_first":"Amazing class with great discussions!","course_id":"160759","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2011df3862f3b1bd9374656460a211227e56b4d490bccefaece4903cf7c436c4a8a9be1ba3c2fcb18f76cd9c6d7212b2&ReportType=2&regl=en-US"},{"course_code":"PHIL 18","course_title_2026":"Human Ethics: A Brief History","course_score_mean":4.33,"rec_score_mean":4.35,"gem_probability_mean":0.0,"sentiment_score_median":0.8338,"best_gem_comment":"","workload_score_mean":3.92,"best_gem_comment_short":"","best_comment":"If you're really into moral\/ethical philosophy, I think you will absolutely love this class. If you're only kind of interested like I was\/am, you'll have a good time, but things can get a little boring. The class is VERY formulaic week to week: you read a few texts, Seth explains them in lecture, and you discuss them in section. There is very little throughout the semester to break up this routine, which can make the whole course just blend into one big blob of philosophy. That being said, I still give this class a very positive review. Seth is very intentional with what\/how he teaches, and it's obvious that one of his goals is for each of his students to leave his class as better people. He's also just a cool dude, and makes the whole class a super chill vibe. I also really like how major assignments are structured. You have to write two ~1500 word essays which are based more on your own thinking and perspective than a standard research paper. They were overall really enjoyable to write, and the grading is pretty friendly if you do a good job. Great class! If you're looking for a fun elective which is easy, but not a joke, and you want to learn something along the way, this is an excellent choice.","best_comment_short":"They were overall really enjoyable to write, and the grading is pretty friendly if you do a good job.","best_comment_first":"If you're really into moral\/ethical philosophy, I think you will absolutely love this class.","course_id":"141608","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=36e3f5b46deffd4939a9fa73838c78edf36c27a046fd706eeaec6154c3569a885e87feb5ac76a3461912a5f7c8df784b&ReportType=2&regl=en-US"},{"course_code":"ESPP 160","course_title_2026":"US Environmental Policy and Policymaking: The Role of Congress, EPA, Stakeholders, and Courts","course_score_mean":4.52,"rec_score_mean":4.52,"gem_probability_mean":0.0,"sentiment_score_median":0.9366,"best_gem_comment":"","workload_score_mean":3.93,"best_gem_comment_short":"","best_comment":"I HIGHLY recommend this course to anyone who has any interest in government structures, climate mitigation\/adaptation,  and the environment. Professor Jenks, though very thorough in communicating the various obstacles and challenges of environmental + public health protection, maintains an optimistic, forward–thinking outlook that's incredibly refreshing compared to the doom and gloom that sometimes pervades environmental science courses.  The once–a–week section allows you to engage deeply with the material and spend more time thinking about issues and solutions rather than completing assignments as a means to an end.  Additionally, the different perspectives of weekly guest speakers offer a view into the practical applications of everything you learn about. The assignments are challenging, but feedback is very helpful and grading is fair. I walk away from this course not only feeling more confident about my ability to engage with big questions and complex solutions but also more prepared to engage with challenging source materials and write policy memorandums. Take this course if you want to grow in your understanding, to grow as a writer, and to grow as an aspiring agent of change!","best_comment_short":"I walk away from this course not only feeling more confident about my ability to engage with big questions and complex solutions but also more prepared to engage with challenging source materials and write policy memorandums.","best_comment_first":"I HIGHLY recommend this course to anyone who has any interest in government structures, climate mitigation\/adaptation,  and the environment.","course_id":"224030","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=620cc76985531b481da77ac654b624cec554631c14ee01b4b621c4f745da34608bcf11e87fd6b9521525e81eee4b14ae&ReportType=2&regl=en-US"},{"course_code":"RSRA 298B","course_title_2026":"Master's Thesis Reading and Research","course_score_mean":5.0,"rec_score_mean":5.0,"gem_probability_mean":0.0,"sentiment_score_median":0.0,"best_gem_comment":"","workload_score_mean":4.0,"best_gem_comment_short":"","best_comment":"","best_comment_short":"","best_comment_first":"","course_id":"160540","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=fdb305e3e3f85be59fa1dadc79580253fee4a221e22fa049a3a0119ea86c5646afbc7506c5e7b148baa5accaa6bf1bd9&ReportType=2&regl=en-US"},{"course_code":"CHEM 165","course_title_2026":"Experimental Physical Chemistry","course_score_mean":4.91,"rec_score_mean":5.0,"gem_probability_mean":0.0,"sentiment_score_median":0.95635,"best_gem_comment":"","workload_score_mean":4.0,"best_gem_comment_short":"","best_comment":"Khaled is an absolutely wonderful instructor who cares an incredible amount about the students in the class and is willing to help them in whatever way possible – I cannot emphasize how much I appreciate the help that he gave me over the duration of the final project! All in all, the experience of being able to design,  execute, and present the final project is a wonderful experience that I had a really great time doing and recommend for anyone interested in pursuing an independent research project. You will truly have the freedom and resources to do any sort of research project you want.","best_comment_short":"Khaled is an absolutely wonderful instructor who cares an incredible amount about the students in the class and is willing to help them in whatever way possible – I cannot emphasize how much I appreciate the help that he gave me over the duration of the final project!","best_comment_first":"Khaled is an absolutely wonderful instructor who cares an incredible amount about the students in the class and is willing to help them in whatever way possible – I cannot emphasize how much I appreciate the help that he gave me over the duration of the final project!","course_id":"119035","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8433ed638824815a013b672a31d20ba7dfd83a2e1b1efadd214dbef82ecd75cddccccb542915553a23f6fdf13560645c&ReportType=2&regl=en-US"},{"course_code":"GOV 94AA","course_title_2026":"American Political Thought","course_score_mean":4.85,"rec_score_mean":4.69,"gem_probability_mean":0.0,"sentiment_score_median":0.8934,"best_gem_comment":"","workload_score_mean":4.0,"best_gem_comment_short":"","best_comment":"This is a great class if you enjoy a survey course where you read a solid canon! I enjoyed it. Assignments were very reasonable, somewhat open ended so a it was lot of fun writing them. Jordan is a great guy, who knows a lot about the subject and makes the conversations engaging. I would recommend this to fellow political theory\/philosophy lovers, it is a good gov94.","best_comment_short":"This is a great class if you enjoy a survey course where you read a solid canon!","best_comment_first":"This is a great class if you enjoy a survey course where you read a solid canon!","course_id":"224695","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=212ae0b67c1279871879530f7244dfb6950a97e47c2ddeea0acf4984841aad56cf1ee5bcf1d30c81ef06dab1db7a958a&ReportType=2&regl=en-US"}]