[{"course_code":"MBB 980H","course_title_2026":"What Disease Teaches about Cognition","course_score_mean":4.82,"rec_score_mean":4.82,"gem_probability_mean":0.1666666667,"sentiment_score_median":0.96485,"best_gem_comment":"Take this class for sure if you’re thinking about doing a MBB secondary (or concentration). It’s definitely a gem. Professor Milberg is great, full of knowledge, and super chill. Loved it!","workload_score_mean":3.36,"best_gem_comment_short":"It’s definitely a gem.","course_id":"109866","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1803f561c727ed3f5d4a065409fc188f0f6b603a7e8ae2b5966e47ae896719556152e53e20b3d283749cd69ac1b958e5&ReportType=2&regl=en-US"},{"course_code":"PSY 18","course_title_2026":"Psychopathology","course_score_mean":4.74,"rec_score_mean":4.81,"gem_probability_mean":0.0217391304,"sentiment_score_median":0.9188,"best_gem_comment":"This course is truly a gem. If you are interested in psychology, take this course. I loved attending lecture and section. The tests are very fair. It's a lot of memorization but if you studying, you will find the exams to be very easy. Another bigger aspect of you grade is the memoirs and papers. The memoirs are honestly so interesting. I loved this course. Dr. Shingleton and the rest of the teaching staff is amazing. They are so approachable and helpful.","workload_score_mean":4.34,"best_gem_comment_short":"This course is truly a gem.","course_id":"123973","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6c9b8d5a6b94e5c8af998e2022e59ae174d2431d8f520ba9935694cecad8119de27685ded1030906a9fa9ff4f62410b7&ReportType=2&regl=en-US"},{"course_code":"AFRAMER 119X","course_title_2026":"Chocolate, Culture, and the Politics of Food","course_score_mean":4.71,"rec_score_mean":4.71,"gem_probability_mean":0.0909090909,"sentiment_score_median":0.8316,"best_gem_comment":"TAKE THIS CLASS!! Truly a gem, but genuinely an interesting and worthwhile course. I had never taken a class related to chocolate before, or even thought to much about chocolate and its history (like most people), but this course changed the way I'll go about consuming chocolate. Definitely engage with the course readings if you can! Professor Martin is so amazing and knowledgeable. One regret I do have is not attending her office hours. This course is a great fifth class, and you'll love the lectures (most days)! We also get to try chocolates in class some days!","workload_score_mean":3.25,"best_gem_comment_short":"Truly a gem, but genuinely an interesting and worthwhile course.","course_id":"108879","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b041430d423d9c2f3e5dbd639e69b2b7795621e6931e0df7430925b40544e8eefa6e344dadfc35bb9205fc609fede5bb&ReportType=2&regl=en-US"},{"course_code":"E-PSCI 133","course_title_2026":"Atmospheric Chemistry","course_score_mean":4.7,"rec_score_mean":4.7,"gem_probability_mean":0.2,"sentiment_score_median":0.9286,"best_gem_comment":"A gem of an EPS class! Really interesting and engaging and relevant to a variety of environmental and chemistry topics. Daniel is a wonderful lecturer and the structure of the class is really great! More about how much you learn than about how much you can memorize.","workload_score_mean":6.22,"best_gem_comment_short":"A gem of an EPS class!","course_id":"122093","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f537a28c779cf0d935e0dd96862f60ed77a0be201a137cfd2169eb2ec533057f3a2321fb7142c6a1c9b581b91757c159&ReportType=2&regl=en-US"},{"course_code":"ESE 133","course_title_2026":"Atmospheric Chemistry","course_score_mean":4.7,"rec_score_mean":4.7,"gem_probability_mean":0.2,"sentiment_score_median":0.9286,"best_gem_comment":"A gem of an EPS class! Really interesting and engaging and relevant to a variety of environmental and chemistry topics. Daniel is a wonderful lecturer and the structure of the class is really great! More about how much you learn than about how much you can memorize.","workload_score_mean":6.22,"best_gem_comment_short":"A gem of an EPS class!","course_id":"156496","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f537a28c779cf0d935e0dd96862f60ed77a0be201a137cfd2169eb2ec533057f3a2321fb7142c6a1c9b581b91757c159&ReportType=2&regl=en-US"},{"course_code":"ENGLISH 185E","course_title_2026":"The Essay: History and Practice","course_score_mean":4.68,"rec_score_mean":4.68,"gem_probability_mean":0.0277777778,"sentiment_score_median":0.9178,"best_gem_comment":"Take this class!!! As a STEM concentrator who hasn't taken an English class since high school (excluding freshman expos), the essay is approachable and well–suited for my shortening attention span. Prof. Wood is AMAZING, and the way he is able to deconstruct an essay in terms of both content and form is extraordinary to witness. This was a wonderful gem to take senior spring – highly highly recommend!","workload_score_mean":4.03,"best_gem_comment_short":"This was a wonderful gem to take senior spring – highly highly recommend!","course_id":"207555","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=5d93e4359e48a4a9f99edaab5e972b00d97654f374a0386d01148755216ad08f6b19290549e3c3ad5d33b7d4ba157577&ReportType=2&regl=en-US"},{"course_code":"SOCIOL 1111","course_title_2026":"Sociology of Sport","course_score_mean":4.63,"rec_score_mean":4.74,"gem_probability_mean":0.0526315789,"sentiment_score_median":0.8718,"best_gem_comment":"This is an AMAZING course!! You really only have to show up and listen, and it's all super interesting material...especially if you're an athlete or a big sports fan. Definitely recommend for anyone looking for a gem.","workload_score_mean":3.02,"best_gem_comment_short":"Definitely recommend for anyone looking for a gem.","course_id":"220595","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e4d6c975533f30079a2d45e706239e10e3c22d752826ab5b9142dbe9b1401348f0102f3f1372a0216296a48c913d56e5&ReportType=2&regl=en-US"},{"course_code":"FYSEMR 24U","course_title_2026":"“How Did I Get Here?”—Appreciating “Normal” Child Development","course_score_mean":4.56,"rec_score_mean":4.78,"gem_probability_mean":0.1111111111,"sentiment_score_median":0.9055,"best_gem_comment":"TAKE THIS CLASS!!! You will not regret it. However, I would say that you shouldn't take this class just because it seems like a gem. The class is so much more fun when everyone in it is genuinely interested in the material, especially since it was such a small group.","workload_score_mean":1.22,"best_gem_comment_short":"However, I would say that you shouldn't take this class just because it seems like a gem.","course_id":"128122","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=065bf80dfc39816b16a137ecea17efa929e56e2e44873859ff2fa688e4e9dd4631b814a1188aa870d3751aa05dfcc653&ReportType=2&regl=en-US"},{"course_code":"ESPP 90S","course_title_2026":"The Technology, Economics, and Public Policy of Renewable Energy","course_score_mean":4.52,"rec_score_mean":4.36,"gem_probability_mean":0.0769230769,"sentiment_score_median":0.8622,"best_gem_comment":"This class is seriously awesome — you learn so much about renewable energy and the related ideas (ex: electricity markets, grid, EVs, storage, etc.) that you can come out with a solid understanding of each of the major types of renewable energy and their PROs\/CONs. Definitely not a class for \"general interest\" but if you have any background energy, sustainability, etc. this is a fantastic class. Prof. Baker is such a gem — incredibly bright, full of great stories, and a great gusto in teaching. The course assignments (weekly discussion papers, participation, and a final project) are extremely manageable and despite it not being a very course–work heavy course, you honestly learn more from it than most courses at Harvard. Come to class prepared to learn (and with coffee since the 3 hour sessions can get a little tough at the end). Grading wise, it's a bit unclear how the course is graded — but I think Prof. Baker doesn't want us to worry about grades and rather about learning and being active participants. TLDR; if you have any interest in energy, this class is for you!","workload_score_mean":3.58,"best_gem_comment_short":"Prof. Baker is such a gem — incredibly bright, full of great stories, and a great gusto in teaching.","course_id":"127572","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=03e4b19df16c55b1bcde9e73b43720d3cf39d7589cebb1a1bd93cd6509b8ed20e07f4051ea09701189b89ebe95f131b7&ReportType=2&regl=en-US"},{"course_code":"STAT 102","course_title_2026":"Introduction to Statistics for Life Sciences","course_score_mean":4.52,"rec_score_mean":4.36,"gem_probability_mean":0.0588235294,"sentiment_score_median":0.9563,"best_gem_comment":"Julie is such a gem, so kind and helpful, super responsive and helpful. This class is kinda difficult but she helps you through it. would reccomend just for her","workload_score_mean":8.71,"best_gem_comment_short":"Julie is such a gem, so kind and helpful, super responsive and helpful.","course_id":"110094","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2f3e89886723eca3e8d12b91f640f1d9ebd6646a940bc114698959d00f06af2a9f00f0155b0d281cde2259d6637a351a&ReportType=2&regl=en-US"},{"course_code":"GOV 1737","course_title_2026":"Evaluating the Impacts of Public Policies: How to Design and Implement Randomized Controlled Trials","course_score_mean":4.52,"rec_score_mean":4.61,"gem_probability_mean":0.0243902439,"sentiment_score_median":0.8011,"best_gem_comment":"****gem, great addition to a schedule that already has 3 hard classes","workload_score_mean":3.73,"best_gem_comment_short":"****gem, great addition to a schedule that already has 3 hard classes","course_id":"218749","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6ea93bb42af926695508090c558106b79bca2fe83bf621939c62f4312592da80952c1ac138f796eb26134ca7bae59b30&ReportType=2&regl=en-US"},{"course_code":"CLS-STDY 97B","course_title_2026":"Introduction to the Ancient Roman World","course_score_mean":4.46,"rec_score_mean":4.38,"gem_probability_mean":0.1,"sentiment_score_median":0.9613,"best_gem_comment":"Let me just preface this comment by stating that this is not an easy class.  Kathleen Coleman is definitely not an easy grader (though she is a fair one), not inflating assignments in the manner that most classes might do.  While this realization was at first difficult, in hindsight, I very much appreciate this approach to teaching.  I think that Coleman's approach could be described as a sort of \"tough–love\" –– she grades a bit more harshly not to be mean, but to spur growth.  After I got a lower grade than expected on one of my assignments, I met up with her, during which she told me that she gives students grades such that inspire improvement and push one to his full potential –– an approach that inspired me to learn much more in this course than I think I otherwise would have achieved.  Looking back on this course, I have fond eyes; in response to the higher expectations, all of us students formed deep bonds which I know will last far beyond this class.  Coleman is also an excellent lecturer.  Lectures are thematic rather than purely chronological (education, slavery, economy, etc), though she does include timelines in her lectures.  She delivers lectures in an engaging and memorable manner, making studying much more streamlined.   Assignments are very well thought–out and the expectations are clear (though demanding).  All in all, I highly recommend this class to any student who truly wants to learn about Roman history.  This course is by no means a gem, but anyone who puts in the work will enjoy this class and be glad that he took it.","workload_score_mean":7.23,"best_gem_comment_short":"This course is by no means a gem, but anyone who puts in the work will enjoy this class and be glad that he took it.","course_id":"124050","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=fd845411872e7a324d5efe08eba67330f497a78106b38e40ac5eae05f0e60ff272312c37a974edccbac8e51a1d0b26aa&ReportType=2&regl=en-US"},{"course_code":"FOLKMYTH 141","course_title_2026":"Elves, Fairies, and UFOs: Dangerous Encounters with Otherworldly Beings in Folklore","course_score_mean":4.45,"rec_score_mean":4.64,"gem_probability_mean":0.1666666667,"sentiment_score_median":0.75695,"best_gem_comment":"Definitely take this class! It's a gem. There are just 3 essays which are super chill. Daniel is a very supportive and understanding person, never makes anyone feel uncomfortable and he takes a lot of interest in what people have to share. The topics are fun (although some of the UFO stuff got a bit repetitive at the end), and it was pretty cool to look at things with a folklore lens. The readings are functionally optional since you don't get quizzed on it during class or anything, but for your own benefit and enjoyment of the class, do the readings so you can participate and better appreciate what's going on.","workload_score_mean":4.18,"best_gem_comment_short":"It's a gem.","course_id":"225907","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0ace4d738d5c9a11ed8d0802f22c02e85d2535cdd14d726d2c76287b0aa03ce1fecb625b4e3cd3269bc8496f4a9afea4&ReportType=2&regl=en-US"},{"course_code":"GENED 1197","course_title_2026":"Grimm's Fairy Tales: Echoes of the Past, Reflections of the Present","course_score_mean":4.44,"rec_score_mean":4.48,"gem_probability_mean":0.0952380952,"sentiment_score_median":0.9366,"best_gem_comment":"The class is a great way to close the aesthetics gened. Reading the fairy tales is super fun, and they are very useful when you can put them in a cultural, historical, and social context in class. Professor Pirozhenko's lectures can seem a little bit dry as she mainly just reads off the script, but she puts a lot of effort into engaging students with the material in the classroom and facilitates a lot of discussion. She also very clearly cares about the class and its content, making her a great professor for this class overall. Bastian is a gem of a TF; you will be so lucky if you get into his section. I unironically was running to his section every week as it was super engaging and fun. Every section hour flew by really quickly. Overall, the class is very interesting, especially if you have time to put into it. The assignments are super introspective, and you will get a lot out of them if you decide to put effort into them.","workload_score_mean":4.09,"best_gem_comment_short":"Bastian is a gem of a TF; you will be so lucky if you get into his section.","course_id":"224850","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7dcdb6bac420b02322036cb0318250aa3c400fe8cf3cdb1a020f59fa6c4e15cdbdfe2fc07f8c3fcacb1b3dd8a73b21d6&ReportType=2&regl=en-US"},{"course_code":"GENED 1189","course_title_2026":"U.S. K-12 Schools: Assumptions, Binaries, and Controversies","course_score_mean":4.36,"rec_score_mean":4.47,"gem_probability_mean":0.0181818182,"sentiment_score_median":0.8951,"best_gem_comment":"This class is a gem! Even if you aren't already interested in education, the teaching staff's passion is infectious –– this class will make you want to take a greater interest in K–12 education! Keep up with the readings and your attendance (it's hard, lecture is at 9 AM, but worth it) and you will get a lot out of the class.","workload_score_mean":4.45,"best_gem_comment_short":"This class is a gem!","course_id":"223981","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0c60aedb6acd21dc4dcc9b58418c7ecdf76b6d6afb075369c418553fed963df000668adf4b2e5de93439fa0acd05ee27&ReportType=2&regl=en-US"}]