[{"course_code":"ECON 970","useful_title":"Tutorial - Sophomore Year","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.9688,"best_gem_comment":"","workload_score_mean":8.63,"best_gem_comment_short":"","best_comment":"Kiran is the best!!! She will go above and beyond to help you, regardless of how busy she is. I was struggling a lot with my final paper and always felt incredibly supported by her and never embarrassed to ask for help. The in–class discussions were pretty fruitful and helped me understand the course material better. Feedback on assignments really helped me understand how to write for economics. I could definitely see how this course can convince people to want to write a thesis—it offers a great preview of the research process, and it breaks down the pieces of a research paper pretty well. Sometimes the assignment due dates felt very rushed and last–minute, so make sure you start everything early to give yourself ample time to brainstorm ideas and make everything look good. All in all, I'm pretty grateful for how much this class taught me in regards to research and development economics, and I owe my positive experience to Kiran for sure.","best_comment_short":"I could definitely see how this course can convince people to want to write a thesis—it offers a great preview of the research process, and it breaks down the pieces of a research paper pretty well.","best_comment_first":"Kiran is the best!!!","course_id":"122752","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6172ab73dc4758df66f6c04090acd3cf8168d2f02978aaf2b52fa9c170cfeed968e73fd3ba81c1f80f0a1d047910f958&ReportType=2&regl=en-US"},{"course_code":"MATH 155R","useful_title":"Combinatorics","course_score_mean":4.8,"rec_score_mean":4.8,"gem_score_mean":0.0,"sentiment_score_median":0.9528,"best_gem_comment":"","workload_score_mean":5.2,"best_gem_comment_short":"","best_comment":"This course was difficult but rewarding! The material was really well chosen, and if you're interested in algebraic combinatorics, this course would be interesting for you. It was not the best–organized class I've taken, but Cesar tends to be available for questions and is a really great lecturer.","best_comment_short":"It was not the best–organized class I've taken, but Cesar tends to be available for questions and is a really great lecturer.","best_comment_first":"This course was difficult but rewarding!","course_id":"116196","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=53a70cc837025a970bbd2a33b57879186266a7e09a74d0b87136ef634c615c50d11aed762681e6c733dc6ca724c87f95&ReportType=2&regl=en-US"},{"course_code":"PHYSICS 145","useful_title":"Elementary Particle Physics","course_score_mean":4.71,"rec_score_mean":4.57,"gem_score_mean":0.0,"sentiment_score_median":0.9846,"best_gem_comment":"","workload_score_mean":10.14,"best_gem_comment_short":"","best_comment":"This class is a really great introduction to particle physics! It's a topic I had always been interested in, so I am super glad I took this course because I had such an enjoyable time! The course is really focused on maximizing what you can take away from it and having fun as opposed to grades or really rigorous assignments, so the relief from that pressure gives you more confidence in diving deep into the challenging concepts of the course. Girma was a fun professor since he was so excited about the material, and Alexis was a fantastic TF who was really devoted to helping you understand the material and led useful sections. The course assignments were all very fair. Overall a really fun class that I absolutely recommend if you're looking for a low–key, yet productive introduction to particle physics!","best_comment_short":"Girma was a fun professor since he was so excited about the material, and Alexis was a fantastic TF who was really devoted to helping you understand the material and led useful sections.","best_comment_first":"This class is a really great introduction to particle physics!","course_id":"117719","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4c5a77c1723f5098c5aa446ba8e41b3ae66a557c6159a3526ac08251675a12651a0086f73f0fe3a04532a3a3411266fc&ReportType=2&regl=en-US"},{"course_code":"CHNSE BA","useful_title":"Elementary Modern Chinese","course_score_mean":4.9,"rec_score_mean":4.8,"gem_score_mean":0.0,"sentiment_score_median":0.9721,"best_gem_comment":"","workload_score_mean":6.6,"best_gem_comment_short":"","best_comment":"If you put your best into your class, you will enjoy it like crazy. A lot of your performance will hinge on studying out of class, especially before Monday, so you can be prepared for the new week's content. This will make you much sharper answering questions in class and makes everything feel so fun and easy, you will be so much more relaxed in class, and the casual phrases just roll off your tongue rather than trying to rehearse lines you read in the book or pause repeatedly to think. The best part is, this only requires about an hour each week, maybe less, and the teachers will do the rest for you by teaching in class. You will end up bragging to your friends about how fun Chinese class is.","best_comment_short":"This will make you much sharper answering questions in class and makes everything feel so fun and easy, you will be so much more relaxed in class, and the casual phrases just roll off your tongue rather than trying to rehearse lines you read in the book or pause repeatedly to think.","best_comment_first":"If you put your best into your class, you will enjoy it like crazy.","course_id":"113873","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9f8480e6766e9fbaf633e38376c73ff5194dd35a65c0ef96dc6a267307d72acf82b9e9e1f4ff3b4c74f058780521847e&ReportType=2&regl=en-US"},{"course_code":"CHNSE 140A","useful_title":"Advanced Modern Chinese","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.94935,"best_gem_comment":"","workload_score_mean":9.83,"best_gem_comment_short":"","best_comment":"If you're coming from 130a\/b, I really encourage you to take Chinese 140a\/b! 130a\/b starts to scratch the surface of formal Chinese and more \"elegant\" language, but 140 goes to a far greater depth, giving you tools to handle business situations or conflicts gracefully and politely.  In the past, I was hesitant to discuss controversial topics in Chinese because I felt that I couldn't fully express the complexity of my ideas\/perspectives with my somewhat limited vocabulary and sentence structures. After taking this course, I feel much more confident in tackling nuanced and sensitive topics, since I've learned grammar structures and vocab that can help me express my ideas clearly and elegantly.As for the logistics of the course, the teaching staff are absolutely wonderful as always. The lectures are so engaging and touch on many different topics, ranging from pop culture to international relations to Chinese culture, so you'll have many opportunities to practice different kinds of grammar structures and vocabulary. This course does tend to have slightly more assignments than 130 (discussion posts, reading, etc.), but the extra practice is well worth it. All of the assignments and tests are at an appropriate difficulty level; in other words they are difficult enough to challenge you and help you improve, but very manageable and can fit in a busy course schedule (for reference, I spent an average of ~5hr\/week most of the time, maybe a couple hours extra on weeks with big essay deadlines). I honestly love the Chinese department so much, and I can't speak about this course highly enough!","best_comment_short":"After taking this course, I feel much more confident in tackling nuanced and sensitive topics, since I've learned grammar structures and vocab that can help me express my ideas clearly and elegantly.As for the logistics of the course, the teaching staff are absolutely wonderful as always.","best_comment_first":"If you're coming from 130a\/b, I really encourage you to take Chinese 140a\/b!","course_id":"111129","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3ba4aa49ddd39316f6a767a8402030d961afee0ff8081b76b5146e28926d92b95855a88014bc583d3f9fcdab133d2e59&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 237","course_score_mean":4.64,"rec_score_mean":4.71,"gem_score_mean":0.0,"sentiment_score_median":0.9637,"best_gem_comment":"","workload_score_mean":5.29,"best_gem_comment_short":"","best_comment":"This is an amazing Expos section! If you are interested in biology, technology, philosophy, and\/or ethics, this expos will have something to pique your interest. The readings are really well curated (even if a bit dense) and the class discussions are lively, so if you do the readings and participate, you will have a great time. And, Dr. Raymer is an amazing preceptor: she is expertly knowledgeable about biology, ethics, and writing, gives excellent feedback to help you in your writing process, and is a very nice person (and pretty lenient in class)!","best_comment_short":"And, Dr. Raymer is an amazing preceptor: she is expertly knowledgeable about biology, ethics, and writing, gives excellent feedback to help you in your writing process, and is a very nice person (and pretty lenient in class)!","best_comment_first":"This is an amazing Expos section!","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2f011f626e780e7b4b134b3c88d831ef6b364c290ca20a76e8d94b9b3234e4e0de0a9395df697b3100223dc995dd853d&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 219","course_score_mean":4.71,"rec_score_mean":4.64,"gem_score_mean":0.0,"sentiment_score_median":0.96055,"best_gem_comment":"","workload_score_mean":7.36,"best_gem_comment_short":"","best_comment":"The discussions are super interesting to listen to, but if you're not a constitutional genius (which somehow almost everyone else in the class seemed to be) and your parents aren't lawyers who can bounce around ideas about case law with you, you might be like me and not really have much of substance to contribute to these discussions. But even though I mostly stayed quiet, class was very fun and interesting. Ross grades pretty harshly, and this is definitely NOT an easy expos. If you want an easy expos, don't take this class. The weekends before essays are due you likely won't be able to go out, and much of your Thanksgiving will be spend doing research (unless you're a constitutional law\/writing genius of course which you very well may be). HOWEVER, it is a very rewarding class, everyone is super super engaged so the discussions are fascinatingly insightful and not forced, and you do learn a lot. It's good to take if you're pre–law. This class is very hard, but it can certainly be worth it.","best_comment_short":"HOWEVER, it is a very rewarding class, everyone is super super engaged so the discussions are fascinatingly insightful and not forced, and you do learn a lot.","best_comment_first":"The discussions are super interesting to listen to, but if you're not a constitutional genius (which somehow almost everyone else in the class seemed to be) and your parents aren't lawyers who can bounce around ideas about case law with you, you might be like me and not really have much of substance to contribute to these discussions.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2f8165d04930dfb7c3b157f4519dc4a4ec262f47a5d4415e03ae0506a46a901bc88975cd9fdffb4d894fbb3a6fc902ff&ReportType=2&regl=en-US"},{"course_code":"EMR 131","useful_title":"Love's Labors Found Uncovering Histories of Emotional Labor","course_score_mean":4.55,"rec_score_mean":4.5,"gem_score_mean":0.0,"sentiment_score_median":0.96835,"best_gem_comment":"","workload_score_mean":7.0,"best_gem_comment_short":"","best_comment":"This class is fantastic! Don't take it if you can't commit to doing the work\/readings––it's definitely a heavier load because it's a high level seminar. Professor Light is brilliant, so great at community building, and an over all great teacher. She supports everyones growth and is clearly so glad to be facilitating these conversations.","best_comment_short":"Professor Light is brilliant, so great at community building, and an over all great teacher.","best_comment_first":"This class is fantastic!","course_id":"207804","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=288570f6b39468dd7142bf94b2b5ed6183dbbbcf43f3c5778d0a1cd2cb3043fd5b0588f1c68cd89d3964336701b7624f&ReportType=2&regl=en-US"},{"course_code":"WOMGEN 1283","useful_title":"Love's Labors Found Uncovering Histories of Emotional Labor","course_score_mean":4.55,"rec_score_mean":4.5,"gem_score_mean":0.0,"sentiment_score_median":0.96835,"best_gem_comment":"","workload_score_mean":7.0,"best_gem_comment_short":"","best_comment":"This class is fantastic! Don't take it if you can't commit to doing the work\/readings––it's definitely a heavier load because it's a high level seminar. Professor Light is brilliant, so great at community building, and an over all great teacher. She supports everyones growth and is clearly so glad to be facilitating these conversations.","best_comment_short":"Professor Light is brilliant, so great at community building, and an over all great teacher.","best_comment_first":"This class is fantastic!","course_id":"207804","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=288570f6b39468dd7142bf94b2b5ed6183dbbbcf43f3c5778d0a1cd2cb3043fd5b0588f1c68cd89d3964336701b7624f&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 248","course_score_mean":4.93,"rec_score_mean":4.47,"gem_score_mean":0.0,"sentiment_score_median":0.9756,"best_gem_comment":"","workload_score_mean":5.47,"best_gem_comment_short":"","best_comment":"This class is really awesome –– if you are looking to get your expos requirement out of the way I would really recommend this class. The essays are quite a bit of work and are challenging to do well on, but I think that is more Expos as a whole than this class specifically. If you don't mind putting work in, this class is so worth it because it is genuinely interesting and Professor Shank is a really engaging, funny teacher. The class community is great as well, I got to know all of my classmates and came out of the class friends with the majority of my class. I really feel like my writing got better and I was able to learn about a super interesting topic that I really enjoyed.  It'll be fun to go to class and you will learn a lot, although the essays are tough. The work is worth it!","best_comment_short":"I really feel like my writing got better and I was able to learn about a super interesting topic that I really enjoyed.","best_comment_first":"This class is really awesome –– if you are looking to get your expos requirement out of the way I would really recommend this class.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c613a17e332c033e28c8c7b03d524c982f772dc241ea60dd80e16e3d0f56f39de9472d17a924012578c574d4a897fc5f&ReportType=2&regl=en-US"},{"course_code":"CHNSE BA","useful_title":"Elementary Modern Chinese","course_score_mean":4.83,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":0.9498,"best_gem_comment":"","workload_score_mean":8.33,"best_gem_comment_short":"","best_comment":"This class is a ton of fun, very engaging and educational, but unless you have a good knowledge of Mandarin coming in, do not expect this to be an easy lift. However, I will say that the teachers are pretty generous and kind when it does come to grading.","best_comment_short":"This class is a ton of fun, very engaging and educational, but unless you have a good knowledge of Mandarin coming in, do not expect this to be an easy lift.","best_comment_first":"This class is a ton of fun, very engaging and educational, but unless you have a good knowledge of Mandarin coming in, do not expect this to be an easy lift.","course_id":"113873","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=efab822489eed27961308f6f23087860a7d393c8a2d158f887d3229fb97f957511e72bd973718dcfab654ca5d7adbeb3&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 247","course_score_mean":4.79,"rec_score_mean":4.92,"gem_score_mean":0.0,"sentiment_score_median":0.95745,"best_gem_comment":"","workload_score_mean":6.0,"best_gem_comment_short":"","best_comment":"This class can definitely feel challenging as paper standards are high, but the content is truly super engaging and interesting––you read magazine articles, watch films, read novels, and even have the chance to read scholarly journal articles for a topic of your choosing. I feel like there's a lot of creativity and freedom associated with this class, which I've heard from my peers is not always the case with other Expos courses. I also feel like it's an ideal class to take as a freshman because of how Prof Shank tries to cultivate a close–knit, fun environment––particularly with fun icebreaker questions at the start of every class (I know how painful that sounds, but I promise that these questions are actually very interesting and you learn so many random, hilarious things about everyone's lives). I would definitely recommend this class but be prepared to put in a lot of work into your papers going in.","best_comment_short":"This class can definitely feel challenging as paper standards are high, but the content is truly super engaging and interesting––you read magazine articles, watch films, read novels, and even have the chance to read scholarly journal articles for a topic of your choosing.","best_comment_first":"This class can definitely feel challenging as paper standards are high, but the content is truly super engaging and interesting––you read magazine articles, watch films, read novels, and even have the chance to read scholarly journal articles for a topic of your choosing.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d2cfe1df49b8cdac6df1518dc66eceff5eec10b91d201c405a6d058b02aee269a31e1421e521cf50d83c27355e8d5209&ReportType=2&regl=en-US"},{"course_code":"MATH 19A","useful_title":"Modeling and Differential Equations for the Life Sciences","course_score_mean":4.55,"rec_score_mean":4.32,"gem_score_mean":0.0,"sentiment_score_median":0.978,"best_gem_comment":"","workload_score_mean":9.14,"best_gem_comment_short":"","best_comment":"The two broad sentiments behind Math 19a is that you love it or you don't. I personally really loved the class. Material: A large emphasis is on ecological modeling,  but if you're into medicine or biochemistry, the topics will also flow throughout the course. There are also concepts that come from human anatomy (either in papers like epidermal wounds, leukemia modeling, cardiac electrophysiology) that are introduced through a mathematical lens and changed my way of viewing processes like heartbeats, healing, and medication.Lecture: Honestly it is so useful when it comes to reviewing the steps you need to approach in solving a problem set question. Go to every class and write down everything Wes puts on the board, even if it takes a minute to understand. It might click as you work through problems.Problem sets: They're only once a week, which is so much better than Math 21a and 21b. If you're between this class and Math 22a or 22b, I'd select 19a if you don't have experience with proofs. Also office hours were helpful because the TFs are patient and will guide you as you approach questions. Show up even if you barely started.Exams: It's nice that there are only two. It's scary that they cover so much content. One thing that caught me off guard is that your understanding of the readings is also asked. It's nothing tricky or too specific. If you take notes while Todd presents the key points in the article and later review his lecture slides (which contain more notes on Canvas) then you'll be ready. As for the math portion, make sure you know the rationale behind what certain topics are and not just the steps, because some questions will not be so simple as to just memorize the steps and write them down.Final Project: Start early!! Your proposal is due sometime in mid–October. If you're learning about a certain concept in LS1a, LPS A, or another life sciences adjacent class, pick your favorite and find some math behind it. This way, it feels more interesting as you learn more and study for your other class. As long as you begin graphing models (at least one graph) before Thanksgiving break and continue before\/throughout reading period, you'll be fine.Always reach out to Wes! He's a great person to talk to and genuinely is rooting for everyone's success. If his office hours don't work for you, reach out for an appointment! He will be more than happy to do so.","best_comment_short":"There are also concepts that come from human anatomy (either in papers like epidermal wounds, leukemia modeling, cardiac electrophysiology) that are introduced through a mathematical lens and changed my way of viewing processes like heartbeats, healing, and medication.Lecture: Honestly it is so useful when it comes to reviewing the steps you need to approach in solving a problem set question.","best_comment_first":"The two broad sentiments behind Math 19a is that you love it or you don't.","course_id":"110596","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a7efa9a091d5f3c58644a2b18cbe6a432ad563dbb5d5f8429f382b6a3c1d4e29d053cf2e4cd122986c752599f774a42f&ReportType=2&regl=en-US"},{"course_code":"ESE 115","useful_title":"Ecosystem Patterns and Processes Parallels in Natural and Built Environments","course_score_mean":4.88,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.8989,"best_gem_comment":"","workload_score_mean":3.88,"best_gem_comment_short":"","best_comment":"I really recommend taking this course! This semester was the first time the course was being taught, but it far surpassed what I had expected. This course is everything you would imagine an environmental science and engineering class to be: we learned a lot of science, we learned about what actually goes into solving environmental issues, we talked about the limitations of current science and engineering–based solutions and considered ways to improve them, we had labs and field trips that combined science and engineering, we discussed public perception vs attitudes held by scientists\/engineers vs implementation vs legal\/economic complications, etc. It was a perfect combination of quantitative and qualitative course content with a hands–on lab component. We learned a lot, and Bryan is a really good teacher so it didn't feel like too much. And if there was something that you found to be less interesting, we would move on quickly enough. In addition, the course was very manageable as there wasn't too much work, and the work that we did have paired nicely with what we had been learning about. The final project was super open ended (although Bryan might change that in future years) so it's a good idea to start thinking about it or brainstorming in advance.","best_comment_short":"The final project was super open ended (although Bryan might change that in future years) so it's a good idea to start thinking about it or brainstorming in advance.","best_comment_first":"I really recommend taking this course!","course_id":"220207","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a46b12165b51c124e9b6fa8737b6b1ca21273c1e703b7c91356cd78eba5533613ee0d980ff925d38d2abeb072743959a&ReportType=2&regl=en-US"},{"course_code":"COMPSCI 252R","useful_title":"Advanced Topics in Programming Languages","course_score_mean":4.6,"rec_score_mean":4.7,"gem_score_mean":0.0,"sentiment_score_median":0.9136,"best_gem_comment":"","workload_score_mean":5.4,"best_gem_comment_short":"","best_comment":"Take this class if you are interested in programming language semantics. CS 252r is a different class every year, but this year it was a pretty self–directed class. Most of the class was doing presentations and readings. Nada and Ana were great. The class is what you make of it!","best_comment_short":"CS 252r is a different class every year, but this year it was a pretty self–directed class.","best_comment_first":"Take this class if you are interested in programming language semantics.","course_id":"114807","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=217c4ef4bd5f40f26ffb5bb590cbba41607a93b4bd469b8705e0d86f26d319371853df1e392db21d300459569ea06e7a&ReportType=2&regl=en-US"},{"course_code":"NEURO 101VA","useful_title":"Sculpting Activity How Inhibition Shapes the Brain in Health and Disease","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.9438,"best_gem_comment":"","workload_score_mean":2.25,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS IF YOU CAN!! If you have ANY interest in neuroscience, specifically inhibition in the brain but really any interest in how different disorders or mental illnesses may manifest in the brain, I highly recommend the course. Saad is SUPER engaging and really facilitates discussion. If you are feeling behind or not on the same page, he really fosters an environment where you feel really comfortable in asking questions and clarifying your thoughts. The papers build on one another in a really interesting way, and the assignments are really relaxed\/you have plenty of tie to do them. I really cannot recommend this class enough it is GREAT!","best_comment_short":"Saad is SUPER engaging and really facilitates discussion.","best_comment_first":"TAKE THIS CLASS IF YOU CAN!!","course_id":"220865","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=474612b797a7f3154b158f03cdfde7eb4fef3ffd5bdccfe3b10b82a474e5965395667eb79f0ce282c5a4f3b4e8b1efcb&ReportType=2&regl=en-US"},{"course_code":"JAPAN BA","useful_title":"Elementary Japanese","course_score_mean":5.0,"rec_score_mean":4.92,"gem_score_mean":0.0,"sentiment_score_median":0.9165,"best_gem_comment":"","workload_score_mean":8.85,"best_gem_comment_short":"","best_comment":"I would highly recommend Japan BA if you are interested in learning Japanese. The class is particularly diverse in the students who take it. My class came from a variety of the graduate schools, and even undergrad students had diverse interests and reasons for learning Japanese. I came in without having learned Japanese before, and although the learning curve initially is a bit higher than those who have been exposed to the language previously, I truly did not feel hindered or at a disadvantage. This was the most well–thought out, well–planned, course I have ever taken. You will be amazed at how much you learn each week. The quality and joy for learning that Kageyama sensei and our awesome TFs nurtured throughout lecture and section was truly incredible. Another important aspect of the course to note is that there is an abundance of additional resources that perfectly align with the course on the Canvas page. Take advantage of them! The textbook and accompanying app for audio (you can download it for free) matched lecture perfectly and were excellently prepared as well. I have never felt so supported in a course and unlike other courses where the book or reference material doesn't match class, all the units are very systematic and if you ever get confused or need clarification, the book is guaranteed to have the answers to your questions. The course staff also holds \"Nihongo Chat Hours\" every week if you want more practice speaking or just one–on–one time to review. The course is one you need to dedicate time to, but it will be a rewarding and fun experience. You'll see how deeply Kageyama sensei and your TFs are dedicated toward giving you an authentic, rigorous, and eye–opening experience in learning Japanese language and culture. They are some of the most professional and caring course staff I have had the pleasure of working with, and it shows in how much all of us in class felt we wanted to do our very best for them. Overall, taking Japan BA was an invaluable experience and it's one of those courses that has deeply impacted my continued interest in Japan and for other cultures in general.","best_comment_short":"The quality and joy for learning that Kageyama sensei and our awesome TFs nurtured throughout lecture and section was truly incredible.","best_comment_first":"I would highly recommend Japan BA if you are interested in learning Japanese.","course_id":"111193","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a6fc492e3b6c6c430928a65890abffc8b5dc5f8d3a9f1e946ada6c8b626bd4c426166413629489a6f1af29daf758aedc&ReportType=2&regl=en-US"},{"course_code":"ENGLISH 90QM","useful_title":"Metaphysical Poetry The Seventeenth-Century Lyric and Beyond","course_score_mean":4.55,"rec_score_mean":4.55,"gem_score_mean":0.0,"sentiment_score_median":0.91,"best_gem_comment":"","workload_score_mean":3.5,"best_gem_comment_short":"","best_comment":"This is a very good course for those who want an introduction to metaphysical poetry (and even to poetry generally). You may be asked to write a poem for each class meeting, which I found enjoyable and edifying –– you learn things from writing poetry that you cannot from just reading it. Those who have read the poetry of the seventeenth century at some length may find themselves rereading poems, but they will also find new poems to enjoy. (And there is something to be said for reading poetry again after having spent time away from it.) This course is fairly accessible even to students with little background, which is good to know coming in for discussions. I'd recommend the class: Professor Teskey is a wonderful discussion leader and has an excellent eye for teasing out themes in poetry.","best_comment_short":"I'd recommend the class: Professor Teskey is a wonderful discussion leader and has an excellent eye for teasing out themes in poetry.","best_comment_first":"This is a very good course for those who want an introduction to metaphysical poetry (and even to poetry generally).","course_id":"130247","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=86d4d46aa8e7dfd32746b34edab96f408715223bc5746158e50d8413ba126fbc13ddf59136ec2ec73f371611d6010780&ReportType=2&regl=en-US"},{"course_code":"MBB 980P","useful_title":"The Role of Music in Health and Education","course_score_mean":5.0,"rec_score_mean":4.91,"gem_score_mean":0.0,"sentiment_score_median":0.93875,"best_gem_comment":"","workload_score_mean":3.09,"best_gem_comment_short":"","best_comment":"This course is super fun and really fascinating! The seminar formatting makes it a lot easier to get to know one another in the class, and discussions are always really interesting to listen to and participate in. Regarding workload, there are two relatively informal presentations and a final paper, in addition to short weekly discussions, so it's definitely very manageable. All of the guest speakers (and the teaching staff) are truly wonderful as well! If you have any interest in music, science, and\/or healthcare, I'd definitely recommend this course :)","best_comment_short":"This course is super fun and really fascinating!","best_comment_first":"This course is super fun and really fascinating!","course_id":"205158","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=dca41e1ab5d029156be7a3f05952cececb47692f36e29fbc76cda37ee205c97f8860309901533b25c193484994b70089&ReportType=2&regl=en-US"},{"course_code":"SOCIOL 1119","useful_title":"Leadership, Social Change, and its Challenges Boston as a Case Study","course_score_mean":4.89,"rec_score_mean":4.89,"gem_score_mean":0.0,"sentiment_score_median":0.9099,"best_gem_comment":"","workload_score_mean":4.5,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS. Chris, Ira, and Madison are such incredible scholars, and their love of the subject really comes through in the course. This is a great course to do a deep dive in the history of Boston, as well as get some practical experience in through the various field trips and projects. I've always looked forward to this class, and the coursework is very manageable. I really enjoyed doing the essays, especially since I had a lot of freedom to guide my own research and learn more about something that I wanted to learn. This is easily one of my favorite classes that I've taken so far, and I'm so glad that I found it.Chris is one of the best sociologists in the field, and I feel so sad that he's retiring this year because that means that future students won't get to learn from him. He's very kind and patient, and takes the time to help us truly internalize the course material.Ira is an amazing professor. He's from Boston and has a lot of practical experience when it comes to the topics we cover, so he offers a lot of knowledge that you wouldn't get otherwise. Moreover, he's the nicest person ever. I was going through a tough time this semester, and he would make sure to check in whenever he saw me, and would even email me sometimes to make sure I was doing okay. He clearly cares very deeply about his students and makes every effort to get to know us as human beings.Madison is an amazing TF. She would always be available and was very patience and accommodating. She would make sure to send us reminders to keep us on track with the coursework, and took the time to check in if she noticed anyone was missing an assignment.","best_comment_short":"He's very kind and patient, and takes the time to help us truly internalize the course material.Ira is an amazing professor.","best_comment_first":"TAKE THIS CLASS.","course_id":"212901","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=bd2c7685f71662dc8c533e9baa3bbc0b79099f884a2bc6b035d4fba03e767afbbf7382c9918061f75ab45d26630fc106&ReportType=2&regl=en-US"},{"course_code":"CHNSE BX","useful_title":"Elementary Chinese for Advanced Beginners","course_score_mean":4.88,"rec_score_mean":4.75,"gem_score_mean":0.0,"sentiment_score_median":0.9778,"best_gem_comment":"","workload_score_mean":6.5,"best_gem_comment_short":"","best_comment":"If you already speak Chinese at home (regardless of origin) but genuinely want to learn how to read and write more in the language, TAKE THIS CLASS. You will learn at an accelerated but manageable pace that will definitely help your Chinese reading\/writing skills improve in just one semester. The course is definitely designed for those who already have a basic grasp of Chinese (ie not total beginners, can differentiate pinyin sounds). I could barely read anything more than Chinese numbers when I first started, and now I can comfortably read most basic passages in Chinese (you'll understand when you see the textbook for this course). The teachers are wonderfully warm and friendly, and make the class environment really enjoyable. The workload isn't too heavy\/difficult, but definitely requires several hours of commitment per week (especially the homework sets). However, I would say the payoff is amazingly worth it. The fact that you're reading this probably means you're already considering Bx, so go for it!","best_comment_short":"The teachers are wonderfully warm and friendly, and make the class environment really enjoyable.","best_comment_first":"If you already speak Chinese at home (regardless of origin) but genuinely want to learn how to read and write more in the language, TAKE THIS CLASS.","course_id":"120305","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=67b7070fa71843f32bd95b3b412ecbe25d0a057a29d9a6ff99ed5277918154a2fa230b7f2796171b1707d6916d6fe86c&ReportType=2&regl=en-US"},{"course_code":"CHNSE 140XA","useful_title":"Advanced Modern Chinese for High-Proficiency Learners","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.943,"best_gem_comment":"","workload_score_mean":6.0,"best_gem_comment_short":"","best_comment":"Chinese 140XA is a really fun and engaging class! Every day, I looked forward to the class, especially due to the bond we had formed amongst the class. Some of the topics can be tricky and hard to understand, but the laoshi's are all super nice and friendly, and it made the trek to Vanserg that much more bearable. I highly recommend taking the class, whether it be for citation or just for fun.","best_comment_short":"Some of the topics can be tricky and hard to understand, but the laoshi's are all super nice and friendly, and it made the trek to Vanserg that much more bearable.","best_comment_first":"Chinese 140XA is a really fun and engaging class!","course_id":"207494","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3426f7dc8941111e0421fbacf3af90ee653d32d5a02ca20f2148d81c0dafad9d55078ea7da09f8e671c6f317a6a607f5&ReportType=2&regl=en-US"},{"course_code":"HIST-LIT 90EZ","useful_title":"The Global South Asian Diaspora","course_score_mean":4.91,"rec_score_mean":4.91,"gem_score_mean":0.0,"sentiment_score_median":0.9587,"best_gem_comment":"","workload_score_mean":5.6,"best_gem_comment_short":"","best_comment":"I would highly recommend this class to future students, especially those interested in diaspora and migrations! Vikrant is an amazing professor whose discerning and insightful commentary sparks rich discussions. I also really appreciate how Vikrant works with you to find resonance between the course materials and your personal interests – he was incredibly supportive of my interest in the intersection of migrations and the environment.","best_comment_short":"I also really appreciate how Vikrant works with you to find resonance between the course materials and your personal interests – he was incredibly supportive of my interest in the intersection of migrations and the environment.","best_comment_first":"I would highly recommend this class to future students, especially those interested in diaspora and migrations!","course_id":"218276","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=795a5a012b7f5ce0e0a296c3fb14b9e452a33c0951269141946b200962898af8961dcde45e0862c289d2a634efc1f95e&ReportType=2&regl=en-US"},{"course_code":"MODGRK AA","useful_title":"Elementary Modern Greek","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.89395,"best_gem_comment":"","workload_score_mean":2.8,"best_gem_comment_short":"","best_comment":"This was the best course I have ever taken at Harvard! Classes were interactive, informative, and fun. I'm glad I decided to take Greek for my foreign language requirement. Even if you don't need the language requirement, please take this class! No background is needed, and it's a truly memorable experience.","best_comment_short":"This was the best course I have ever taken at Harvard!","best_comment_first":"This was the best course I have ever taken at Harvard!","course_id":"159840","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a4534e01fab3aa177158d9e0c5a2aba3773df06b2245400da01c611487dd2a000a343205e86c88e3a17cd6d681e347ae&ReportType=2&regl=en-US"},{"course_code":"GOV 94UN","useful_title":"United Nations","course_score_mean":4.5,"rec_score_mean":4.58,"gem_score_mean":0.0,"sentiment_score_median":0.8826,"best_gem_comment":"","workload_score_mean":5.17,"best_gem_comment_short":"","best_comment":"If you are interested in the UN, its history\/structure, and how its different agencies\/bodies have addressed different historical challenges, I would really recommend this class! I found the discussions every week on varied aspects of the UN to be very informative and helpful, and as someone who wants to work in the UN, this was very helpful. Professor Mikulaschek did a great job facilitating discussion and choosing interesting readings, and you will get as much out of this class as you put in.","best_comment_short":"Professor Mikulaschek did a great job facilitating discussion and choosing interesting readings, and you will get as much out of this class as you put in.","best_comment_first":"If you are interested in the UN, its history\/structure, and how its different agencies\/bodies have addressed different historical challenges, I would really recommend this class!","course_id":"220119","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d7e828eafd575400670ea0b30dc9659531f9315a56f79c021c63a504d78bac13ead2ee2a54c0aeb84dd2f02efff3d9c0&ReportType=2&regl=en-US"},{"course_code":"HIST-LIT 90FL","useful_title":"Indigenous in the City","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.95735,"best_gem_comment":"","workload_score_mean":5.86,"best_gem_comment_short":"","best_comment":"I really enjoyed this class because of the course content and classroom community! It was definitely a challenge, but probably one of the best classes I have ever taken (but I am just a first–year). If you are worried about your college–level writing skills or that you are not a match, speak with Dr. Ridgway for guidance. They are such an amazing person and I am so honored to have been their student this past semester. This class is so rewarding and I cannot express in words how amazing it has been and how much I loved it.","best_comment_short":"This class is so rewarding and I cannot express in words how amazing it has been and how much I loved it.","best_comment_first":"I really enjoyed this class because of the course content and classroom community!","course_id":"220442","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1517c9b31ae712c185b71b9792c36cac4cb4d8b1e4d0d57c872078dd4e0475d78045f6571c1df1c3ad0820d1f8e55c2b&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 220","course_score_mean":4.87,"rec_score_mean":4.93,"gem_score_mean":0.0,"sentiment_score_median":0.9198,"best_gem_comment":"","workload_score_mean":8.8,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS!!!! This course is challenging but very rewarding.  Readings and discussions are fascinating, especially if you're interested in law and politics. Although the legal cases are intimidating at first, they become a lot more manageable as you learn more about case law. Class discussions are engaging and open, even when talking about heavy or intellectually challenging subjects. Dr. Martin does a great job leading conversation and creates a real sense of community within the class. His grading standards are high but fair, and he does a good job providing thoughtful feedback that pushes you to improve as a writer. This class may feel difficult at times, but it will improve your writing and analytical skills more than almost any other course. If you are interested in law or want to grow as a writer, this would be a great course for you :)","best_comment_short":"His grading standards are high but fair, and he does a good job providing thoughtful feedback that pushes you to improve as a writer.","best_comment_first":"TAKE THIS CLASS!!!!","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a4bd8e2452db552122c58862cfc531a6aa72c252be83799e5b2e0a5a9cc8299689111bc97bf42bfef75cec3b62b1a7e5&ReportType=2&regl=en-US"},{"course_code":"EXPOS 40","useful_title":"Public Speaking Practicum","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.9142,"best_gem_comment":"","workload_score_mean":3.25,"best_gem_comment_short":"","best_comment":"This class is amazing. Everyone raves about it for a good reason. By far the best class I've taken at Harvard. It's such a nurturing learning environment and everyone is so encouraging. Bailey was an outstanding preceptor. You won't find another class like this at Harvard. I've grown so much from this class, and I will be forever grateful I was able to take this class.","best_comment_short":"It's such a nurturing learning environment and everyone is so encouraging.","best_comment_first":"This class is amazing.","course_id":"125227","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9a558c68f8e1f13b4740347c2b45826df520367c44bf256583917e1435f9f4a0259c00159f59b08c634d7c6202704696&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 253","course_score_mean":4.64,"rec_score_mean":4.55,"gem_score_mean":0.0,"sentiment_score_median":0.9286,"best_gem_comment":"","workload_score_mean":4.91,"best_gem_comment_short":"","best_comment":"This is a fantastic expos section! Julia provides extensive useful feedback on drafts, helps answer any questions you have during conferences, and is a fair grader. She's extremely understanding and kind. I learned so much from this class and highly recommend it. You will have to put in time and effort, which is the case with any expos, but this section is very rewarding. I learned a ton from this class and saw substantial improvements in my writing. Readings are also engaging and not terribly time consuming.","best_comment_short":"Julia provides extensive useful feedback on drafts, helps answer any questions you have during conferences, and is a fair grader.","best_comment_first":"This is a fantastic expos section!","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3767659d91a5ea307a531f59afbdd4aae891565b7a45ce887a52f19bc9dfb08f3ab9238e0e1cfb10435cd6e541c0dd21&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 255","course_score_mean":4.57,"rec_score_mean":4.5,"gem_score_mean":0.0,"sentiment_score_median":0.9552,"best_gem_comment":"","workload_score_mean":6.29,"best_gem_comment_short":"","best_comment":"This Expos course is, as you might expect, heavy in subject matter. It is also academically difficult, but I think that that is appropriate for the topic and for the course as a whole: it teaches you so much about writing and about why writing even matters. And Hudson is incredibly supportive and caring throughout the way. He is thoughtful and intentional with how he communicates with students and in helping us build community. He challenges you to write more and better than you have in the past, but he is also your greatest supporter through that learning process.The engaged part of this course is phenomenal. Having visits from community members who are actively involved in finding solutions to the issues of mass incarceration is so valuable. You get to meet incredible people, many of whom are formerly incarcerated, who share their stories and their drive for enacting change.This course inspired me to stop turning away from hard issues and instead look for the people who are affected, the people who are trying to find solutions. It has given me confidence that I can learn about and research incredibly complex issues, and then think critically about them and actually have something new to add to the conversation. If you are placed in this course, I hope you get as much out of it as I have.","best_comment_short":"He challenges you to write more and better than you have in the past, but he is also your greatest supporter through that learning process.The engaged part of this course is phenomenal.","best_comment_first":"This Expos course is, as you might expect, heavy in subject matter.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=043249dcb1f81ea365a3f5cb23b26fdc23e8d12443ad93da24c4652527ac5c6bd004f117cf100ec2c7d7c1c66281f479&ReportType=2&regl=en-US"},{"course_code":"AFRAMER 20","useful_title":"Introduction to African Languages and Cultures","course_score_mean":4.4,"rec_score_mean":4.4,"gem_score_mean":0.0,"sentiment_score_median":0.8779,"best_gem_comment":"","workload_score_mean":3.8,"best_gem_comment_short":"","best_comment":"This is a great class to take if you're interested in learning more about African language and culture. The class is a little longer than necessary and dull at times but it's not too difficult and you end up forming a great community.","best_comment_short":"The class is a little longer than necessary and dull at times but it's not too difficult and you end up forming a great community.","best_comment_first":"This is a great class to take if you're interested in learning more about African language and culture.","course_id":"118883","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4ae87dfd97d1bc3d00ab4cbae1654c96591569d4e8adaffc642b8ea57920ea1d9c11b526fc36687bfd128407c03eb131&ReportType=2&regl=en-US"},{"course_code":"ITAL 40","useful_title":"Advanced Italian I Italian Through Cinema Oral Expression and Performance","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.9166,"best_gem_comment":"","workload_score_mean":9.29,"best_gem_comment_short":"","best_comment":"While a lot of work, this class is very rewarding and a lot of fun. I loved the films we watched and our class discussions were always so insightful and engaging. The Italian classes at Harvard are so well structured and it is always my favorite class on my schedule :) would recommend to anyone","best_comment_short":"The Italian classes at Harvard are so well structured and it is always my favorite class on my schedule :) would recommend to anyone","best_comment_first":"While a lot of work, this class is very rewarding and a lot of fun.","course_id":"116233","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d3ad7cfdb9d84b1105fcdffb47f4dd20e4ad1b33409525c0533f289419abd0990d688c6138f01910238c09c260d0e6c8&ReportType=2&regl=en-US"},{"course_code":"ENGLISH 20","useful_title":"Literary Forms","course_score_mean":4.68,"rec_score_mean":4.47,"gem_score_mean":0.0,"sentiment_score_median":0.95555,"best_gem_comment":"","workload_score_mean":5.32,"best_gem_comment_short":"","best_comment":"I would not recommend this class for non–English concentrators just because there are some technicalities and a lot of focus on historical forms. But for English concentrators, try to join Professor Lynch's class! I loved her enthusiasm and passion, and she is so lovely to talk to in office hours. Some readings were better than others, and some felt like a \"oh okay I guess this is required,\" but overall I enjoyed the class and there was a very reasonable workload.","best_comment_short":"I loved her enthusiasm and passion, and she is so lovely to talk to in office hours.","best_comment_first":"I would not recommend this class for non–English concentrators just because there are some technicalities and a lot of focus on historical forms.","course_id":"216063","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e24c8b0fdc682058da871182424a9182e77c8de57ebd11a1b02e8a6230f1ad57e98163b8059b78a719631747e401ad5f&ReportType=2&regl=en-US"},{"course_code":"TDM 119","useful_title":"Introduction to Voice and Speech","course_score_mean":4.92,"rec_score_mean":4.83,"gem_score_mean":0.0,"sentiment_score_median":0.9202,"best_gem_comment":"","workload_score_mean":2.75,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS. This class was always the best part of my week. Erika and Jonathan are so lovely to work with!!! THEY ARE THE BEST. I learned a lot about how to be an effective speaker, and feel more comfortable with my public speaking skills. Prob one of the most fun classes at Harvard!","best_comment_short":"Erika and Jonathan are so lovely to work with!!!","best_comment_first":"TAKE THIS CLASS.","course_id":"118497","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=cdc3b412715f725f19b6ecca28a9aca9189722c3da5c55be5a59f5bef8884673b52fe08dc303626b78e22682179ec3e5&ReportType=2&regl=en-US"},{"course_code":"EXPOS 40","useful_title":"Public Speaking Practicum","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.9475,"best_gem_comment":"","workload_score_mean":3.08,"best_gem_comment_short":"","best_comment":"THE BEST HARVARD COURSE: Before the class, Public Speaking spawned more anxiety in me than I could reasonably manage, and I was crippled by thoughts about how I sounded or whether people would notice non–existent mannerisms. I was just scared, like it seems like many people are. This class fixed all of that––and more! In Kate's tremendous section, I grew to have a confidence not only with speaking but also with sharing my inner voice with other people. Through a poetry class at Harvard, I had already learned how to put my thoughts onto paper. Yet never had I felt comfortable saying them out loud to other people, let alone standing at the front of a big room with many people and commanding attention to tell a story or message. That was completely new!I leave the class confident in my voice, and I feel the effects every day, whether I'm talking with friends, at clubs, with family, or in professional settings at work. The confidence of a Harvard–educated public speaker, maybe?  Who knows. Yet somehow the class really did transform my attitude toward myself and what I can do, so long as I prepare adequately, through its experience–based four speeches over the course of the semester, combined with weekly student and instructor feedback. During class sessions, the class can feel like what I imagine a theater class can feel like: fun, varied warm ups,  a spirit of \"YES! And?.\" It's no surprise, given that my preceptor, Katy, seems to have spent a lot of time with a Shakespeare company. But that type of class structure and thinking, so refreshing to someone with a more technical, stem\/finance background, really opened me up to a new way of thinking. Our class got so close, over the course of the semester, that we all went thrifting with each other in our free time––twice! This class is definitely a no brainer. Have a great time!","best_comment_short":"During class sessions, the class can feel like what I imagine a theater class can feel like: fun, varied warm ups,  a spirit of \"YES!","best_comment_first":"THE BEST HARVARD COURSE: Before the class, Public Speaking spawned more anxiety in me than I could reasonably manage, and I was crippled by thoughts about how I sounded or whether people would notice non–existent mannerisms.","course_id":"125227","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=05295486ec6206b4700062f163db0ae1b273b99f88e4aff8d7583365ddde905177280fddff27cc81b711ad84a41c7add&ReportType=2&regl=en-US"},{"course_code":"SPANSH 30","useful_title":"Upper-level Spanish Four Countries and their Cultures","course_score_mean":4.67,"rec_score_mean":4.78,"gem_score_mean":0.0,"sentiment_score_median":0.9625,"best_gem_comment":"","workload_score_mean":5.13,"best_gem_comment_short":"","best_comment":"Get the Rojas y Curry \"Gramatica Esencial\" grammar review book that the course recommends (it's also at the Harvard library system if you get it before other students) and use that to study grammar. It's very well–structured and directly applies to the grammar that is barely reviewed in class but shows up on every exam. This is a fun course. You will be pushed to speak and understand spoken Spanish, as well as to read at a high level with a complicated vocabulary set and all grammar forms. You'll have to get better at reading and understanding based on context clues and vocabulary you know because there will be too much new vocab for you to look up every word you don't recognize. Reading \"Cronica de una muerte anunciada\" is the most intense portion of the course – the other readings aren't too too long and grading for writing pieces, exams, and conversations, is quite fair (maybe a little too easy :) That being said, there are pretty consistent assignments that will take time, most notably the writing compositions.The presentations are actually quite interesting, so look forward to the other students' presentations and a chance to share some cool research in Spanish!Johanna Liander's section is the best.","best_comment_short":"Reading \"Cronica de una muerte anunciada\" is the most intense portion of the course – the other readings aren't too too long and grading for writing pieces, exams, and conversations, is quite fair (maybe a little too easy :) That being said, there are pretty consistent assignments that will take time, most notably the writing compositions.The presentations are actually quite interesting, so look forward to the other students' presentations and a chance to share some cool research in Spanish!Johanna Liander's section is the best.","best_comment_first":"Get the Rojas y Curry \"Gramatica Esencial\" grammar review book that the course recommends (it's also at the Harvard library system if you get it before other students) and use that to study grammar.","course_id":"114200","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7393b2b8c15fe80a7e4249f9be3f886007a050abe6f5ff8a588de9894cf2248ff0b93fa0316b69b0ad7acc074fb79afe&ReportType=2&regl=en-US"},{"course_code":"COMPSCI 73","useful_title":"Code, Data, and Art","course_score_mean":4.75,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":0.94,"best_gem_comment":"","workload_score_mean":9.22,"best_gem_comment_short":"","best_comment":"CS 73 is my favorite course that I've taken at Harvard for a variety of reasons.At a high level, the course seamlessly combines the domains of art and data visualization in a very powerful way. You learn how to approach data with an open mindset, creatively analyze and visualize data in beautiful ways, and appreciate the artistic visions of others. The presentations cover a variety of fascinating topics ranging from color in data visualization to incorporating interactivity. Despite this being the first iteration of the course, the class materials were extremely organized, and the topics discussed in class were very applicable to the homework assignments. The weekly group critiques are great for receiving feedback and learning from others. I could feel tangible growth and improvement over the course of the semester, and it's really rewarding to be able to see and share the projects you make.  The course can definitely be demanding at times, as the projects are pretty open–ended, but the overall process is extremely fulfilling. Finally, Professor Viegas and Professor Wattenberg created this class based on their decades of research + industry experience, and they have so much knowledge and wisdom to impart to students. Their excitement and passion about the course is contagious and they also truly care about the growth of each and every student.If you are someone who has interests in data visualization and\/or art, I would highly encourage you to take this class!","best_comment_short":"Their excitement and passion about the course is contagious and they also truly care about the growth of each and every student.If you are someone who has interests in data visualization and\/or art, I would highly encourage you to take this class!","best_comment_first":"CS 73 is my favorite course that I've taken at Harvard for a variety of reasons.At a high level, the course seamlessly combines the domains of art and data visualization in a very powerful way.","course_id":"220126","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=07a6f02f5280c5ffec7dd309406743c6559abc68c429dc22cd67091031f803dd18e2a2e9c7cf8cbd179697b22b45cfab&ReportType=2&regl=en-US"},{"course_code":"HUMAN 90","useful_title":"Making It Mahindra Scholars Seminar","course_score_mean":4.78,"rec_score_mean":4.56,"gem_score_mean":0.0,"sentiment_score_median":0.9721,"best_gem_comment":"","workload_score_mean":6.0,"best_gem_comment_short":"","best_comment":"Take this course if you can – this is an extremely rare and rewarding opportunity, and represents the best of what Harvard has to offer academically. Each week you will engage with a different medium, and you will be taught by an amazing professor of that field. The preparation required outside of class is similar to other courses, but unlike a gened it is critical that you actually do it, since you will get so much out of the discussions and the opportunity to hear from these professors. Approach every topic with open–mindedness and enthusiasm, even and especially the ones you think you have little interest in\/prior exposure to – there are no wrong answers here, and this course is an incredible intellectual sandbox to engage with interesting content and ideas, surrounded by some of the brightest and most engaged classmates you will find in any discussion–based class. As for the writing assignments, while they are only 500 words do not be deceived into thinking they are easy or should be taken lightly – while they may not require as much time as longer papers, they require a similar if not higher level of engagement and effort to write well.","best_comment_short":"Approach every topic with open–mindedness and enthusiasm, even and especially the ones you think you have little interest in\/prior exposure to – there are no wrong answers here, and this course is an incredible intellectual sandbox to engage with interesting content and ideas, surrounded by some of the brightest and most engaged classmates you will find in any discussion–based class.","best_comment_first":"Take this course if you can – this is an extremely rare and rewarding opportunity, and represents the best of what Harvard has to offer academically.","course_id":"216637","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8fcd563a943f8f5f76c08af90dc6e153a0755512ac16ae00297bfc921c39ba47e601b28a9b8efcf7b1c68c0ca196236d&ReportType=2&regl=en-US"},{"course_code":"STAT 185","useful_title":"Introduction to Unsupervised Learning","course_score_mean":4.31,"rec_score_mean":4.27,"gem_score_mean":0.0,"sentiment_score_median":0.9147,"best_gem_comment":"","workload_score_mean":8.18,"best_gem_comment_short":"","best_comment":"This is a solid class, but the title bites off more than is actually chewed; to be honest, a better name for this course would have been something like \"Linear Algebra Applications in Machine Learning\" \"Algorithms for Dimension Reduction\" (which, fun fact, is pretty much what the class used to be called long ago). The course's focus was algorithms like PCA, SVD, NMF, ISOMAP, and then some stuff on clustering, with LOTS of linear algebra and a bit of theoretical background (but no proofs), and in some places felt like it was running pretty slow; we spent like the first 3 weeks talking about PCA, which kind of dragged on. If you have aligned your expectations with that reality, the course is good. Alex lectures well (but writes everything in all caps for some reason, which is a little hard to read; anyway...) and is a pretty accessible guy. The material is pretty fundamental, presented well, and *will* strengthen your intuition for linear algebra, like it or not. Look out for the term paper; there's not a ton of guidance given and it's a nontrivial effort. Ultimately I enjoyed the class, but I will say that if you choose to take it, get ready to get good at linear algebra.","best_comment_short":"This is a solid class, but the title bites off more than is actually chewed; to be honest, a better name for this course would have been something like \"Linear Algebra Applications in Machine Learning\" \"Algorithms for Dimension Reduction\" (which, fun fact, is pretty much what the class used to be called long ago).","best_comment_first":"This is a solid class, but the title bites off more than is actually chewed; to be honest, a better name for this course would have been something like \"Linear Algebra Applications in Machine Learning\" \"Algorithms for Dimension Reduction\" (which, fun fact, is pretty much what the class used to be called long ago).","course_id":"213478","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0a99b537cc8c4417790a27f92557d466349985415caaf9c8231e56b82bd3d9b2c8288d8f203d4124f50bc32db9e7315b&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 210","course_score_mean":4.67,"rec_score_mean":4.91,"gem_score_mean":0.0,"sentiment_score_median":0.9671,"best_gem_comment":"","workload_score_mean":4.67,"best_gem_comment_short":"","best_comment":"This Expos topic is AMAZING! I would highly recommend even if you are just remotely interested in feminism. You do go quite in depth into the topics surrounding feminism, but the readings are not too bad, they're all actually relatively short and pretty fun to analyze. The community within the class is really positive and enthusiastic and as a result, I always looked forward to coming into class. The discussions we have are always really intriguing and the supportive environment adds a lot to the experience. Dr. Gold is so incredibly kind and positive and I always loved her energy in classes. She is also incredibly helpful throughout the whole writing process and is always down to have a conversation with you if you're struggling to put your ideas into words or in an organized structure. TAKE THIS EXPOS!!!","best_comment_short":"Dr. Gold is so incredibly kind and positive and I always loved her energy in classes.","best_comment_first":"This Expos topic is AMAZING!","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7bd45d9972be9b1c80b913b90906a4d3d4fbb88b126033e47964b7ae66515742b86a6fea3f94908871bc1d60bfde04b7&ReportType=2&regl=en-US"},{"course_code":"AFVS 50A","useful_title":"Introduction to Nonfiction Filmmaking","course_score_mean":5.0,"rec_score_mean":4.83,"gem_score_mean":0.0,"sentiment_score_median":0.8414,"best_gem_comment":"","workload_score_mean":13.0,"best_gem_comment_short":"","best_comment":"If you're interested in making films in any capacity, this course is a great place to start. The teaching staff was extremely knowledgeable, helpful, and supportive and the assignments built off each other really nicely. It can be a huge time commitment, but also a really rewarding and unique opportunity to work with 16 mm film.","best_comment_short":"It can be a huge time commitment, but also a really rewarding and unique opportunity to work with 16 mm film.","best_comment_first":"If you're interested in making films in any capacity, this course is a great place to start.","course_id":"114351","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a5d8944f177f0652991a547646998bf44f9dacc7feff1a5b94ce1488a10669fa841560eb18549fd925d5d68f49b9dd64&ReportType=2&regl=en-US"},{"course_code":"MUSIC 181R","useful_title":"Performance and Culture Renaissance Music","course_score_mean":4.88,"rec_score_mean":4.88,"gem_score_mean":0.0,"sentiment_score_median":0.9061,"best_gem_comment":"","workload_score_mean":4.71,"best_gem_comment_short":"","best_comment":"This is one of the most amazing courses that Harvard has to offer. The fantastic blend of musicology and practice of playing makes it a very well–rounded course from which you can gain a lot, not to mention the mind–blowing fact that you get to learn a period instrument from an amazing professional player for free! I cannot recommend this course highly enough, and it is easily one of the best courses I have ever taken at Harvard. If are ever unsure about whether you should take this course: you should.","best_comment_short":"The fantastic blend of musicology and practice of playing makes it a very well–rounded course from which you can gain a lot, not to mention the mind–blowing fact that you get to learn a period instrument from an amazing professional player for free!","best_comment_first":"This is one of the most amazing courses that Harvard has to offer.","course_id":"108419","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=615388a665a6f6bc0ababbc4a3d02991cfd187cdcff5122ef562b48d770536b73187361263cf6f631b2abf0e623131cf&ReportType=2&regl=en-US"},{"course_code":"MBB 980S","useful_title":"Cognitive Neuroscience of Meditation","course_score_mean":4.85,"rec_score_mean":4.69,"gem_score_mean":0.0,"sentiment_score_median":0.9574,"best_gem_comment":"","workload_score_mean":3.92,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS!! It's literally so good!! You connect with the students and professor on such a deep level in this setting. The papers are fascinating, the material is accessible, and by the end of the class, you'll be convinced that meditation is the answer to so many problems. We got to start class with a short meditation, then informally discuss the readings + add in our own philosophies on things. I'm not very neuro–experienced, but I had a great time steering the conversation to more philosophical places instead or just learning from others. And the only big assignment is a paper at the end.Michael is unbelievably amazing. Everyone in our class loved him. He and the TFs did everything in their power to construct the most beautiful, accepting, and flexible space for all of us.As a South Asian, I think this course was done really well in terms of treating South Asian culture properly. Nothing felt patronizing, offensive, exoticizing, etc. It was honestly such a beautiful opportunity for me to finally get to learn about something so near and dear to my culture in a proper academic setting. We need more classes like this.This class will be your favorite class of the week, and you'll be sad it only meets once a week because waiting for the next class period is no fun.Workload is super reasonable! It's really what you make of it–– you can get by with skimming the papers, but if you have the capacity in your schedule to read them a bit thoroughly, really engage on the discussion boards, etc., you'll find this stuff so much more fascinating.Again, just please take this class, ESPECIALLY if Michael is the one teaching it again. I think Dr. Lazar isn't as laid back, so apply what I've said there^^ to if *Michael* is teaching the class.","best_comment_short":"It was honestly such a beautiful opportunity for me to finally get to learn about something so near and dear to my culture in a proper academic setting.","best_comment_first":"TAKE THIS CLASS!!","course_id":"207091","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4a3b45bcd452f8eb775c91bab7a6b68946842aee38b2e9007e886462fe292ec228c66b2ee3764e68d6a5ac88c2ffaaab&ReportType=2&regl=en-US"},{"course_code":"GOV 1780","useful_title":"International Political Economy","course_score_mean":4.67,"rec_score_mean":4.44,"gem_score_mean":0.0,"sentiment_score_median":0.8521,"best_gem_comment":"","workload_score_mean":6.5,"best_gem_comment_short":"","best_comment":"This is an incredibly engaging course which, while not without its challenges, is definitely one where you get out what you put in. While learning some economic frameworks and history is critical for weekly preparation, a lot of the course centers around the reading and critical engagement with political economy literature, pushing all to not only learn the material but to leave able to participate in debates in the field –– understanding the strengths and weaknesses of various models and how all the pieces fit together. This is the type of course where week–to–week assignments are lighter, but you really need to stay on top of the reading for exams and papers –– plus, the stronger your background in the topic for a given class day, the more you'll get out of the discussion! I wish I had been able to put a little more time in than I did, but would definitely recommend.","best_comment_short":"I wish I had been able to put a little more time in than I did, but would definitely recommend.","best_comment_first":"This is an incredibly engaging course which, while not without its challenges, is definitely one where you get out what you put in.","course_id":"111906","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4c0de488dede7334f6896cca53004ab6f6854d0ebb538a9ade5ced560746e1c8a0c3187612269ace98bda07b6c2b48fa&ReportType=2&regl=en-US"},{"course_code":"KOREAN 120A","useful_title":"Intermediate Korean","course_score_mean":4.6,"rec_score_mean":4.4,"gem_score_mean":0.0,"sentiment_score_median":0.8701,"best_gem_comment":"","workload_score_mean":5.89,"best_gem_comment_short":"","best_comment":"Definitely take this class if you're invested in Korean culture! I will say it does take up a lot of time in the schedule (lecture of MWF and section T\/TH, so you're in Korean every day lol) but that's why you should definitely make sure you're actually invested first. Besides the time commitment, it's definitely worth taking and your skills improve a lot by the end.  It's pretty content–dense so if you feel like it's a lot to take in at once you're not alone. But definitely reach out to the teachers, they're all super nice and ready to help students all the time!","best_comment_short":"But definitely reach out to the teachers, they're all super nice and ready to help students all the time!","best_comment_first":"Definitely take this class if you're invested in Korean culture!","course_id":"117220","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c5b095414f3514861b59c2625f326592797dd0cc647a7d9a209f430d8be49b9c0c21582da89568997dba12f1fb069774&ReportType=2&regl=en-US"},{"course_code":"MOD-HEB 130A","useful_title":"Advanced Modern Hebrew I","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.8885,"best_gem_comment":"","workload_score_mean":4.75,"best_gem_comment_short":"","best_comment":"Osnat runs an amazing course. She really understands what students want and need to do to learn. We talk (in Hebrew) about current events and politics and Osnat is always willing to change her itinerary to match what we want to do. This semester, student's wanted to focus a lot more on conversation and we spoke all the time in class. Definitely take this course if you want to progress in Hebrew and have a good time. The class feels like a family we are all good friends.","best_comment_short":"Definitely take this course if you want to progress in Hebrew and have a good time.","best_comment_first":"Osnat runs an amazing course.","course_id":"119630","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6729a2a67df4349bd466e44579f6790d4b1928bbb7a3d029a1ec6bcca4bfcbb3afe9eccbd537dd8aefe58cc882f4f7ae&ReportType=2&regl=en-US"},{"course_code":"SCRB 177","useful_title":"Demystifying the Immune System","course_score_mean":4.62,"rec_score_mean":4.52,"gem_score_mean":0.0,"sentiment_score_median":0.9531,"best_gem_comment":"","workload_score_mean":4.1,"best_gem_comment_short":"","best_comment":"This class rocks! If you're genuinely interested in learning about the immune system, this is definitely the class for you. Sometimes STEM (especially biology classes) get super jargon–y and you have to spend hours memorizing pathways and molecule names, but this class truly emphasizes understanding and grappling with the bigger picture so that you have a more foundational understanding of the immune system and its many functions. Pacing of the course is great, PSETs are super fair, and the final project is really fun. Teaching staff is super passionate about the material, and they make themselves available always. Can't say enough good things.","best_comment_short":"Pacing of the course is great, PSETs are super fair, and the final project is really fun.","best_comment_first":"This class rocks!","course_id":"217489","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=bed2d2c883569d2b032cb64ecf63e5dfe5e4e69eb518b670a6b0b6df7a457079166e6949af4aeff4fc68a6a8ff1b8f31&ReportType=2&regl=en-US"},{"course_code":"CHEM 30","useful_title":"Organic Chemistry","course_score_mean":4.62,"rec_score_mean":4.32,"gem_score_mean":0.0,"sentiment_score_median":0.90695,"best_gem_comment":"","workload_score_mean":9.35,"best_gem_comment_short":"","best_comment":"Take this class!! Chem major or not (if you need to take orgo for pre–med for example), take this class!! Professor Myers is a wonderful lecturer and the teaching staff is great. This course is definitely difficult and will require a lot of your time. There's no getting around that. There's a lot of material covered and Professor Myers often goes through lectures at a very fast pace (to the point where if someone asks a question, he either advises them to speak with him after class or answers the question but we stay 2–3 min late after class because there is just no time). The teaching style worked very well for me, it was a traditional \"professor lectures at the board for 75 min and you take notes\" which I'm used to and sections were great for catching anything I didn't quite get in class. Though Professor Myers may seem intimidating, he really isn't and genuinely wants to get to know students and just teach fun things in organic chemistry. Problem sets were certainly difficult and you can't do them without going to office hours. But it's usually manageable to complete the whole pset after 1  two–hour office hour session if you start the pset beforehand and only come to office hours with questions. I can't speak to how helpful the PSLs are since I didn't go to their office hours after unhelpful experiences in chem 20, but TF office hours were extremely helpful. The teaching staff in general is very supportive and receptive to questions. Exams were sometimes fair, sometimes pretty difficult. You definitely need to study hard for them and you should probably make peace with simply letting the rest of your life take a backseat the 5–7 days before exams. There is however an alternative grading scheme which drops your lowest exam and replaces it with your final exam score which can help if you had a rough time with one of the exams (this was Exam 3 for most people this semester).  Lecture Integration problems were great for reviewing material that was covered recently and keeping it fresh, and they're basically free points (add up to an extra pset grade and they're grade based on completion) so do them!! Also PLEASE go to review sessions! They are \"optional\" in the syllabus (attendance isn't checked) but they are so great for reviewing the material and working on problems to really cement your understanding of the material. Professor Myers takes time out of his schedule to host the review sessions and works through the problems with students at the board which is incredibly helpful ( a little embarrassing sometimes if you are standing at the board for 20 minutes as your synthesis is being reworked, but SO helpful!!). Exam questions are also sometimes pulled STRAIGHT from the review session packets so at the very least go to them to be prepared for potential exam questions. The final was very fair (this year and in years prior since previous finals are given to us as practice finals) and I feel like represented the course material and the class itself quite well. You have to study a lot and put the work in, but it is certainly possible to get very high grades on exams and psets and be very successful in the class. Lab was alright, 4 hours is tough but the TFs tried to make labs fun and also get us out early which was very very appreciated and made the experience much better than it could have been. This class made me excited to potentially take advanced orgo in the future and I am certain that I had a better experience in chem20\/30 than I would have in 17\/27.","best_comment_short":"Lab was alright, 4 hours is tough but the TFs tried to make labs fun and also get us out early which was very very appreciated and made the experience much better than it could have been.","best_comment_first":"Take this class!!","course_id":"118925","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=010106052c00e5faaacb73c6d87d56ced88389979ef34ae6dc60e2a5bd928768a35443930387bb660962ce6b8782aaa9&ReportType=2&regl=en-US"},{"course_code":"ENGLISH CGF","useful_title":"Genre Fiction Workshop Sci-Fi, Fantasy, Speculative Fiction, Horror, The Ghost Story, The New Weird","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.8773,"best_gem_comment":"","workload_score_mean":5.55,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS. NEEL IS GREAT. MAKING TIME FOR WRITING AND READING EVERY WEEK IS GREAT. TAKE IT. READ. WRITE. BE HAPPY.","best_comment_short":"NEEL IS GREAT.","best_comment_first":"TAKE THIS CLASS.","course_id":"213327","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d17a9aa2ca22b36fecaf78ddf6eed1633cebe3c990ba915bb570a30bdf54c1acee067ac9de7ce9bbef2a3748d8257d7e&ReportType=2&regl=en-US"},{"course_code":"GOV 94GD","useful_title":"Africa Power and Politics","course_score_mean":4.71,"rec_score_mean":4.43,"gem_score_mean":0.0,"sentiment_score_median":0.8246,"best_gem_comment":"","workload_score_mean":6.57,"best_gem_comment_short":"","best_comment":"I would strongly recommend taking this class for an overview of African history and politics. This course provides a depth of knowledge on many different facets of national identity. The central motif of African solutions to African politics was evident in the structure of course materials and discussions. Though a heavy reading load, the course assignments are quite balanced and Dr. Rhodes is very engaged in class contributions and through out–of–class support. This is a great course to orient yourself to the broader context of politics and relationships on the African continent, and the structure is quite conducive to practicing self–study and individualized research and exploration.","best_comment_short":"This is a great course to orient yourself to the broader context of politics and relationships on the African continent, and the structure is quite conducive to practicing self–study and individualized research and exploration.","best_comment_first":"I would strongly recommend taking this class for an overview of African history and politics.","course_id":"218732","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c034a6bb9e9fefca71ce2e5800f193bb549d03d89dbe338a711e00a49c1a846c24aaf2f0657980358ab8ea8e4b9705ec&ReportType=2&regl=en-US"},{"course_code":"FRENCH 64","useful_title":"Exploring French Language in North America through Text, Image, and Culture","course_score_mean":4.91,"rec_score_mean":4.91,"gem_score_mean":0.0,"sentiment_score_median":0.8976,"best_gem_comment":"","workload_score_mean":4.55,"best_gem_comment_short":"","best_comment":"This is the very best french course I took at Harvard to fulfill my citation. It is incredibly interesting, and the topic is not something easily found in french courses (at Harvard or elsewhere). Grading is not harsh at all, and the essays throughout the semester all help you formulate your final paper so the workload is not horrible at all ! The community in this course was great, and Dr. Brisson was an amazing professor, always sweet and helpful and responsive to the needs of the class. One of my favorite memories is one day where class was hosted outdoors because it was a beautiful day ! You will definitely not regret taking this class.","best_comment_short":"The community in this course was great, and Dr. Brisson was an amazing professor, always sweet and helpful and responsive to the needs of the class.","best_comment_first":"This is the very best french course I took at Harvard to fulfill my citation.","course_id":"220528","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=649dfeae473a5da5f88fe68e5d637b7f44a1a5cff64413474d0599408542a60e9a39cf80a3a95c9e1787dd39f5fc9701&ReportType=2&regl=en-US"},{"course_code":"CHNSE 150A","useful_title":"Readings and Discussions in Academic and Professional Chinese","course_score_mean":4.78,"rec_score_mean":4.78,"gem_score_mean":0.0,"sentiment_score_median":0.8617,"best_gem_comment":"","workload_score_mean":6.89,"best_gem_comment_short":"","best_comment":"The entire Chinese language program at Harvard is fantastic, and I really recommend taking Chinese classes, even if you feel that it is a large time commitment! The program is well–structured, and you truly do learn a lot.","best_comment_short":"The entire Chinese language program at Harvard is fantastic, and I really recommend taking Chinese classes, even if you feel that it is a large time commitment!","best_comment_first":"The entire Chinese language program at Harvard is fantastic, and I really recommend taking Chinese classes, even if you feel that it is a large time commitment!","course_id":"119757","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e84f24041388cfda69e91faf593da4a9e85feb9f24ce992971750c7dd91268a3e0da0ba9c0a4fee14c11108e078a6a88&ReportType=2&regl=en-US"},{"course_code":"SANSKRIT 200AR","useful_title":"Advanced Poetic Sanskrit","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.8252,"best_gem_comment":"","workload_score_mean":7.8,"best_gem_comment_short":"","best_comment":"Don't be intimidated if analysis is a lot at first. Make sure you have commentaries so it's easier to dig deeper into Pāninian grammar (what I enjoyed about the analysis process), or just establish a word order so that you can start applying the skills you've learned in intermediate. Start verses early because it can be a time crunch to do 3 verses between Monday and Wednesday, but definitely manageable.","best_comment_short":"Make sure you have commentaries so it's easier to dig deeper into Pāninian grammar (what I enjoyed about the analysis process), or just establish a word order so that you can start applying the skills you've learned in intermediate.","best_comment_first":"Don't be intimidated if analysis is a lot at first.","course_id":"113324","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b1704e0787287d8dc73544759173fc554d916d99de1988c3089c5bf46f179e130458004463246ed2270255d220fa2a92&ReportType=2&regl=en-US"},{"course_code":"CHNSE 106A","useful_title":"Introduction to Literary Chinese","course_score_mean":4.78,"rec_score_mean":4.56,"gem_score_mean":0.0,"sentiment_score_median":0.8963,"best_gem_comment":"","workload_score_mean":6.11,"best_gem_comment_short":"","best_comment":"I really enjoyed this course to the point where I was looking forward to waking up in the morning to attend! Professor Sena creates an environment in which students felt very comfortable to ask all sorts of questions whether they are regarding the language, cultural context, or other difficult parts that they don't understand, and I felt like I was learning so much from this very friendly and discussion based environment. I usually struggle with language classes but I have not felt this way in this course despite the difficulty of the material, because the vibes are so good and I feel like I can really immerse myself in the content.","best_comment_short":"I usually struggle with language classes but I have not felt this way in this course despite the difficulty of the material, because the vibes are so good and I feel like I can really immerse myself in the content.","best_comment_first":"I really enjoyed this course to the point where I was looking forward to waking up in the morning to attend!","course_id":"110543","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f684b95385f9d9d63905a4829eefb8390669726714659b31129b1183767297b6c60d5cd0624d737f3863ef623b400cb7&ReportType=2&regl=en-US"},{"course_code":"MATH 25A","useful_title":"Theoretical Linear Algebra and Real Analysis I","course_score_mean":4.57,"rec_score_mean":4.6,"gem_score_mean":0.0,"sentiment_score_median":0.9481,"best_gem_comment":"","workload_score_mean":14.45,"best_gem_comment_short":"","best_comment":"Math 25a is a project that you put a lot of work into, but if done correctly (which does not mean good grades, but active participation and interest in the class), is very rewarding. You are left with very important and fundamental proofs done in class or in problem sets or reviewed in the textbook. It is also strongly recommended to LaTeX your psets, which is very helpful when reviewing the psets for the midterms or the final exam, but also takes a lot of time (in my experience, about 5–6 per week). The class is VERY well put together and structured. All the problems have a meaning behind and will probably be useful at some later time in the course (go to Wes's office hours to learn the \"meaning\" of each problem).  The reading, unlike other classes, are straightforward and helpful. The lecture notes are too! I strongly recommend not skipping lecture, even though it's a 3 times per week 9am class, since not all lecture videos are uploaded, and by actively participating you learn a lot easier. Also, it is pretty easy to get left behind if you don't attend lectures. One thing that I did not like were the solutions to the psets, which were not quite useful, because they were skipping a lot of steps, and not giving proper explanations. Another thing I really liked was Wes's openness. He was very supportive after the first midterm, and did not release the mean of the exam, which was emotionally helpful for the students's sake. He really emphasized self growth, which I have rarely seen in teachers. I strongly recommend going to his office hours if possible. They are not that useful for solving the pset problems, but for understanding class material, and its usefulness in other areas (Wes is an applied mathematician and gives many examples for applicability of linear algebra).  Also, you get to build a connection with a wonderful faculty member. After the final exam, he said that whether we choose to take 25b or not (which is also his class), he is our supporter, and our adviser throughout our undergraduate experience. He said to reach out whenever we need anything math related. So, to sum up, Math 25a is a hard class, very thoroughly done linear algebra, but which proves to be helpful a lot of areas such as physics, and it is very well structured so that you get through the difficult material easier.","best_comment_short":"Math 25a is a project that you put a lot of work into, but if done correctly (which does not mean good grades, but active participation and interest in the class), is very rewarding.","best_comment_first":"Math 25a is a project that you put a lot of work into, but if done correctly (which does not mean good grades, but active participation and interest in the class), is very rewarding.","course_id":"110808","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3649c0ff5eea522d0c4374ea44623b821d602da60d10bc9b1c346eb0eba72ffb06ba8b31474b745ee2633d2db5d9209d&ReportType=2&regl=en-US"},{"course_code":"SOC-STD 98VW","useful_title":"To Remake the World? Revolutionaries, Regimes, and Paradoxes of Power","course_score_mean":5.0,"rec_score_mean":4.88,"gem_score_mean":0.0,"sentiment_score_median":0.902,"best_gem_comment":"","workload_score_mean":8.29,"best_gem_comment_short":"","best_comment":"this tutorial is one of the best classes i've taken at harvard. it's a great balance of social theory and history, and the discussions will really make you think deeply about revolution, power, change. dr. whitham is a great and always willing to chat in office hours, and the course readings were very engaging. if you care about politics and activism, i can't recommend this tutorial more! it's rigorous, thought–provoking, and also just a really good time","best_comment_short":"dr. whitham is a great and always willing to chat in office hours, and the course readings were very engaging.","best_comment_first":"this tutorial is one of the best classes i've taken at harvard.","course_id":"220265","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9eb569ef99799110cd48d416a3a31536d3933aafad2ab91a148b74782940b960b5915350781a340f1dbc96079dd9b36b&ReportType=2&regl=en-US"},{"course_code":"ENGLISH CFMR","useful_title":"Interiority & Experience Writing Character-Driven Fiction Workshop","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.89115,"best_gem_comment":"","workload_score_mean":5.89,"best_gem_comment_short":"","best_comment":"Professor Messud's courses are terrific fun! You will be challenged to write and read creatively and critically, and you will have a lot of fun creating your own work and reading your classmates' work. Workshop courses do require commitment to giving feedback and setting aside time for writing, so make sure you are enthusiastic\/ready to give this commitment!","best_comment_short":"Workshop courses do require commitment to giving feedback and setting aside time for writing, so make sure you are enthusiastic\/ready to give this commitment!","best_comment_first":"Professor Messud's courses are terrific fun!","course_id":"160952","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f54c9c38a539a4ac24a49385be08c14e7d33a418eff01f92ec166c205a669d21da3d948b55ecfc5343554e349f11bc97&ReportType=2&regl=en-US"},{"course_code":"EDST 129","useful_title":"Migration and Urban Education","course_score_mean":4.8,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.8176,"best_gem_comment":"","workload_score_mean":4.5,"best_gem_comment_short":"","best_comment":"I thought I learned a lot about the educational experiences of immigrant populations and the contentious nature of this ongoing discussion. It is hard to know what the \"Right\" answer is, which is another reason I loved this course because I felt that our professor was giving us an opportunity to piece this puzzle ourselves rather than other professors that criticize and force their own opinion on students. I think I left with a lot of new information and skills, but also important questions that I hope to continue to explore.","best_comment_short":"It is hard to know what the \"Right\" answer is, which is another reason I loved this course because I felt that our professor was giving us an opportunity to piece this puzzle ourselves rather than other professors that criticize and force their own opinion on students.","best_comment_first":"I thought I learned a lot about the educational experiences of immigrant populations and the contentious nature of this ongoing discussion.","course_id":"220783","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1366a595ed5d3dc4039d4e53105f151013dbe72a2966b91d6b0547d5310f792293322045a1510bb14d67b6d58cfd1259&ReportType=2&regl=en-US"},{"course_code":"ECON 985A","useful_title":"Econ 985 Senior Thesis Research","course_score_mean":4.73,"rec_score_mean":4.5,"gem_score_mean":0.0,"sentiment_score_median":0.7897,"best_gem_comment":"","workload_score_mean":8.2,"best_gem_comment_short":"","best_comment":"Kiran is the absolute best thesis preceptor out there who will make sure you are on track and push you while making you feel comfortable and assured throughout the way.  The class camaraderie that develops throughout is also great, and Kiran was part of helping foster that. Also love her clementine and brownie snacks!","best_comment_short":"Kiran is the absolute best thesis preceptor out there who will make sure you are on track and push you while making you feel comfortable and assured throughout the way.","best_comment_first":"Kiran is the absolute best thesis preceptor out there who will make sure you are on track and push you while making you feel comfortable and assured throughout the way.","course_id":"120541","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=71043bb466c8c73bb65896c6be121d102c3ad5b5094933effb8610cc13ac98c69dbdbb07751b7b45ca5052ff3ff9735c&ReportType=2&regl=en-US"},{"course_code":"SWEDISH 10A","useful_title":"Beginning Swedish Language and Literature","course_score_mean":4.83,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.8495,"best_gem_comment":"","workload_score_mean":4.0,"best_gem_comment_short":"","best_comment":"Swedish was the only class I would be happy to wake up at 9am for almost every day. Agnes is the sweetest person who tries her best to make the class as stress–free as possible. She's super reasonable and easy to talk to about anything. The pace of the class is perfect, but it's easy to fall behind if you don't study well enough for each chapter– so just make sure you keep yourself on track.","best_comment_short":"The pace of the class is perfect, but it's easy to fall behind if you don't study well enough for each chapter– so just make sure you keep yourself on track.","best_comment_first":"Swedish was the only class I would be happy to wake up at 9am for almost every day.","course_id":"121412","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6ae6638f4d04c3af84a49ee0898afa9afd403ba5e861e0bd5445e33c15332891193fe05352d3acd75c4866d52a9136a5&ReportType=2&regl=en-US"},{"course_code":"CHNSE 120A","useful_title":"Intermediate Modern Chinese","course_score_mean":4.78,"rec_score_mean":4.83,"gem_score_mean":0.0,"sentiment_score_median":0.9243,"best_gem_comment":"","workload_score_mean":3.89,"best_gem_comment_short":"","best_comment":"I became much more confident with my Chinese speaking and listening as a result of taking this course. The CHNSE Ba\/Bb sequence gave me an adequate foundation, but 120a took it up a notch and I've become much closer to becoming fluent.  The instructors are the nicest people ever––they truly care about each and every student and are rooting for you to succeed. They go out of their way to be available inside and outside of class to answer questions, ranging from language to Chinese culture. The assignments were all helpful and there were a plentitude of opportunities to get extra credit.","best_comment_short":"The instructors are the nicest people ever––they truly care about each and every student and are rooting for you to succeed.","best_comment_first":"I became much more confident with my Chinese speaking and listening as a result of taking this course.","course_id":"113793","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=28a94609ff45aeca4c90d105cc90bb84366a338ae2c7d06b1e48b5c17e2d411641ff1e05a454956617337a295afdf390&ReportType=2&regl=en-US"},{"course_code":"MUSIC 189R","useful_title":"Chamber Music Performance","course_score_mean":4.87,"rec_score_mean":4.84,"gem_score_mean":0.0,"sentiment_score_median":0.9288,"best_gem_comment":"","workload_score_mean":5.03,"best_gem_comment_short":"","best_comment":"“Our goal in this class is to have fun and enjoy the process of making music together, as equals, and grow. Everything else is just logistics.”This is what was said to us on day 1. And it was an incredible semester.I've made friends who are some of the kindest, most perceptive, caring, curious, and interesting people I know. We thought about music. We learned about the music and in working towards a common goal, learned about each other, and I understood myself better.The larger world may be chaotic, but it has never looked so beautiful as it does in that moment when you’re together and creating something larger than your individual selves.The Parker Quartet is so cool. I don't know how they're able to sculpt such brilliant music. This was a great experience.","best_comment_short":"We learned about the music and in working towards a common goal, learned about each other, and I understood myself better.The larger world may be chaotic, but it has never looked so beautiful as it does in that moment when you’re together and creating something larger than your individual selves.The Parker Quartet is so cool.","best_comment_first":"“Our goal in this class is to have fun and enjoy the process of making music together, as equals, and grow.","course_id":"153042","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e71dc0eb23e1c6627311d64c6db094de9efd21fc1c243c731a1031bd15e7123d817c557371018fa9c785091e660b249d&ReportType=2&regl=en-US"},{"course_code":"KOREAN 130A","useful_title":"Pre-advanced Korean","course_score_mean":5.0,"rec_score_mean":4.88,"gem_score_mean":0.0,"sentiment_score_median":0.8588,"best_gem_comment":"","workload_score_mean":7.0,"best_gem_comment_short":"","best_comment":"This class is amazing! The professors are amazing and you will improve a lot, especially in how fluently and naturally you speak. It does take a lot of work and has a decently heavy workload–– you could probably manage it with another heavy class but almost definitely not two other heavy classes. The grading is not necessarily harsh but you're by no means guaranteed an A or A–. Definitely worthwhile to take!","best_comment_short":"The professors are amazing and you will improve a lot, especially in how fluently and naturally you speak.","best_comment_first":"This class is amazing!","course_id":"111235","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4d46ad72000f2b0b7528cce37ef0ef1727ad89439c0708fd074b491faf7bd62553cb0ecf39e2c6aa3da8c055df24cc47&ReportType=2&regl=en-US"},{"course_code":"CHEM 100R","useful_title":"Experimental Chemistry and Chemical Biology","course_score_mean":4.8,"rec_score_mean":4.9,"gem_score_mean":0.0,"sentiment_score_median":0.9337,"best_gem_comment":"","workload_score_mean":5.5,"best_gem_comment_short":"","best_comment":"I have to be honest — I wasn't quite looking forward to a 10 hr \/ week lab course, but it was necessary to fulfill my chemistry concentration requirement. I took it dreading the amount of work it would be. I have come out on the other side extremely proud and appreciative of all of the work I've put into this course, and I am still continuing the research I started even after the class has completed. By the end of the semester, I was so excited to go into class each week and see everyone \/ work on my project. Also, the DC advocacy trip was a highlight of my college experience. Professor Vollmer–Snarr and the rest of the teaching staff were all so knowledgeable and kind, which made the whole experience so much better. It definitely is a lot of work, both in and out of class, but if you pick a project that you are interested and invested in, you will genuinely have a good (and very memorable!) experience.","best_comment_short":"It definitely is a lot of work, both in and out of class, but if you pick a project that you are interested and invested in, you will genuinely have a good (and very memorable!)","best_comment_first":"I have to be honest — I wasn't quite looking forward to a 10 hr \/ week lab course, but it was necessary to fulfill my chemistry concentration requirement.","course_id":"123022","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=305857bb3299f2a2f8df64345ea200f3f1d2f5cc39168d5338d35e7e1f25a8366ea3e28d8a14313116069dd413eb2666&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 239","course_score_mean":4.82,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.8895,"best_gem_comment":"","workload_score_mean":4.18,"best_gem_comment_short":"","best_comment":"A great choice for Expos, would recommend it if you're interested in immigration! Covers a really important history! Course material could get a little repetitive at times, but overall a great class. Routon is a wonderful preceptor who cares a lot about her students and is flexible and understanding.","best_comment_short":"A great choice for Expos, would recommend it if you're interested in immigration!","best_comment_first":"A great choice for Expos, would recommend it if you're interested in immigration!","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=66f580315047e8e1b886a0b1fc1bba7aa5d0f90e261af3d656789243d444100814408ed894f05058f258a08a6c458683&ReportType=2&regl=en-US"},{"course_code":"PHIL 167","useful_title":"Privacy, Security, Connectivity","course_score_mean":4.38,"rec_score_mean":4.29,"gem_score_mean":0.0,"sentiment_score_median":0.8763,"best_gem_comment":"","workload_score_mean":3.0,"best_gem_comment_short":"","best_comment":"This class is definitely worth taking if you want to have a lot of interesting and fun discussions about cybersecurity and privacy. I would recommend it to anybody from the Phil department who is interested in computer science and anyone from CS with an interest in philosophy.","best_comment_short":"This class is definitely worth taking if you want to have a lot of interesting and fun discussions about cybersecurity and privacy.","best_comment_first":"This class is definitely worth taking if you want to have a lot of interesting and fun discussions about cybersecurity and privacy.","course_id":"123092","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=49958756dc8eed3fe33d54e13920c619f339d1d263b08cc87e88e0b6a7d9b5a3ad251225a8cdde036d46aff9e6465a85&ReportType=2&regl=en-US"},{"course_code":"SCRB 164","useful_title":"Frontiers in Experimentation and Imaging","course_score_mean":4.7,"rec_score_mean":4.9,"gem_score_mean":0.0,"sentiment_score_median":0.8896,"best_gem_comment":"","workload_score_mean":3.5,"best_gem_comment_short":"","best_comment":"This is a fantastic class!!!! The experiments are super interesting and cool, and you will learn a lot, and gain a lot of new lab skills. This class will help you better think like a scientist, and all the teaching staff are fantastic and super supportive! Definitely take this class if you are considering it!","best_comment_short":"This class will help you better think like a scientist, and all the teaching staff are fantastic and super supportive!","best_comment_first":"This is a fantastic class!!!!","course_id":"220056","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0fb07d96949816c7cb684875d5fac794c321fe33304b28444d3cabe2d53b12873ee80f4b2b37a4e351fc794400dd0581&ReportType=2&regl=en-US"},{"course_code":"SPANSH 61N","useful_title":"The Ethics of Business in Latin America","course_score_mean":4.83,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.80915,"best_gem_comment":"","workload_score_mean":4.5,"best_gem_comment_short":"","best_comment":"For context, I've taken Spanish throughout high school; Spanish 30, 40 at Harvard; and studied abroad for a summer in a Spanish–speaking country. That being said, my personal level of fluency enriched my participation in the course, but that was never a barrier to entry. Take this course if you're anything resembling a freshman who's pretty confident in their language ability. Super easy workload (3 hours a week tops) and exams are oral with a group. Discussions are very interesting, best course I've taken thus far.","best_comment_short":"Take this course if you're anything resembling a freshman who's pretty confident in their language ability.","best_comment_first":"For context, I've taken Spanish throughout high school; Spanish 30, 40 at Harvard; and studied abroad for a summer in a Spanish–speaking country.","course_id":"127573","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6fa95a37ebf03bf91fd721d69c408b98a6ad1763585eb6501e1175fcce65a43f64da19d18b37dfa652b240fa89395cb7&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 234","course_score_mean":4.73,"rec_score_mean":4.87,"gem_score_mean":0.0,"sentiment_score_median":0.95525,"best_gem_comment":"","workload_score_mean":5.47,"best_gem_comment_short":"","best_comment":"I LOVED Dr. Quigley's Expos class. Some of the most interesting content of the semester! I love psych (but wasn't able to take Pscyh 1), and this class more than enough made up for it! Dr. Quigley herself is such an intelligent, well–spoken, kind, and helpful professor. She is also extremely knowledgeable about the writing process and gives her students the BEST and very fair advice on how to improve papers. I'm not so sure why so many freshmen dread Expos–––this class was one of my favorites. You get to make tight–knit connections with a lot of your peers (which may be more difficult in large lecture classes). And Dr. Quigley creates such a welcoming and friendly environment. This class is a must–take! I highly highly recommend!","best_comment_short":"She is also extremely knowledgeable about the writing process and gives her students the BEST and very fair advice on how to improve papers.","best_comment_first":"I LOVED Dr. Quigley's Expos class.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6d6cfd27d6c58fd9c9313c2a196c768699ab7a624f5b1130565be6e5e3fe03686a901aadd0d15e1b8c3daee3555a5c53&ReportType=2&regl=en-US"},{"course_code":"KOREAN BA","useful_title":"Elementary Korean","course_score_mean":4.64,"rec_score_mean":4.64,"gem_score_mean":0.0,"sentiment_score_median":0.9133,"best_gem_comment":"","workload_score_mean":5.09,"best_gem_comment_short":"","best_comment":"If you're interested in Korean or simply looking to fulfill the language requirement, I would really recommend the course!! Professor Kim and all the TFs are so amazing and helpful with whatever you might need, and foster a great environment in class and in section. The class itself isn't too hard, so it's easy to balance with other courses. Definitely take it if you're thinking about it!!","best_comment_short":"Professor Kim and all the TFs are so amazing and helpful with whatever you might need, and foster a great environment in class and in section.","best_comment_first":"If you're interested in Korean or simply looking to fulfill the language requirement, I would really recommend the course!!","course_id":"124296","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=42fd08c89b98d9c619718fbdb33df80a2b16042c5312477247e65c34a2e203224d75d070f5b807fa293c357b3eb39d66&ReportType=2&regl=en-US"},{"course_code":"CHNSE 130A","useful_title":"Pre-Advanced Modern Chinese","course_score_mean":4.33,"rec_score_mean":4.33,"gem_score_mean":0.0,"sentiment_score_median":0.8816,"best_gem_comment":"","workload_score_mean":8.44,"best_gem_comment_short":"","best_comment":"Chinese 130a is similar to the 120 series but different too. The way the course is run is exactly the same, and the quality of the teachers is just as wonderful. However the material gets super super hard, and a lot of the vocabulary starts sounding similar and meaning similar things. As someone who did really well in Chinese 120 (A, A–), Chinese 130a is not the same. Even the vocabulary starts becoming more niche and less useful, like \"euthanasia\" and \"real estate\" and \"country bumpkin.\" The vocabulary is clearly very specifically designed for particular topics of discussion. If you want to use Chinese professionally in a humanities aspect, this course is great and will help you learn the vocabulary necessary for social studies conversation. However, if you don't want a citation and just want to learn more Mandarin, I would unfortunately recommend that you look elsewhere.","best_comment_short":"However the material gets super super hard, and a lot of the vocabulary starts sounding similar and meaning similar things.","best_comment_first":"Chinese 130a is similar to the 120 series but different too.","course_id":"159629","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=197fe07cf9ceadd64e00dafac30542be843363fcb59446e1810f4cd756344f455fbd2a30aaee194faa5eb24ce80828c8&ReportType=2&regl=en-US"},{"course_code":"EXPOS 40","useful_title":"Public Speaking Practicum","course_score_mean":4.93,"rec_score_mean":4.92,"gem_score_mean":0.0,"sentiment_score_median":0.9509,"best_gem_comment":"","workload_score_mean":2.69,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS IF YOU GET IN! I cannot emphasize enough how much this class has made such an impact on my experience here at Harvard. EXPOS 40 is a great opportunity to practice speaking in a supportive, non–judgmental environment, and you gain so much valuable feedback from your peers and preceptor (which I think is the most valuable part of the class). Throughout the class, you also participate in a bunch of fun improv exercises that allow you to get out of your comfort zone and try things in speech that you haven't done before. Don't be scared of the speeches––that's why you're most likely interested in the class, and this is a class where the main goal is to give you opportunities to practice speaking (so don't be afraid to try new things in each of your speeches). And don't be worried about the grade––if you show that you are making a valiant effort and are engaged, the grade will work out for itself. Zach is amazing and really chill, so if you get into his section consider yourself really lucky!","best_comment_short":"EXPOS 40 is a great opportunity to practice speaking in a supportive, non–judgmental environment, and you gain so much valuable feedback from your peers and preceptor (which I think is the most valuable part of the class).","best_comment_first":"TAKE THIS CLASS IF YOU GET IN!","course_id":"125227","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ba6c041fb9361a6ab641f65784b3cc7115063d35a90392a26053883bb656e94c01cfcddf52f7d5b2632228cacf62aea1&ReportType=2&regl=en-US"},{"course_code":"GREEK 10","useful_title":"Introduction to Ancient Greek Literature","course_score_mean":4.83,"rec_score_mean":4.8,"gem_score_mean":0.0,"sentiment_score_median":0.80635,"best_gem_comment":"","workload_score_mean":5.4,"best_gem_comment_short":"","best_comment":"Very chill class but very helpful in improving your reading ability for ancient greek.","best_comment_short":"Very chill class but very helpful in improving your reading ability for ancient greek.","best_comment_first":"Very chill class but very helpful in improving your reading ability for ancient greek.","course_id":"203230","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3f5d3f2ce43bfdb5cd07119663627fb38cada026c349faf8266aea14521eef7e7438c36694794c9f793023215a24255c&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 214","course_score_mean":4.82,"rec_score_mean":4.73,"gem_score_mean":0.0,"sentiment_score_median":0.932,"best_gem_comment":"","workload_score_mean":5.0,"best_gem_comment_short":"","best_comment":"TAKE THIS COURSE!!! Dr. Herron is truly a wonderful teacher—personable, patient, and passionate about the topics discussed in this course! This was my first experience with the sociological perspective on writing and Dr. Herron really opened my mind to a new way of thinking and writing that has definitely impacted my path. Make sure you take the time to do the readings, which can be long sometimes but SUPER INTERESTING, because the class discussions were so intellectually simulating and perspective changing. This class was genuinely my favorite this semester; not many people have a great expos experience and I truly believe if you take this course, you will definitely have a significantly better time. Can't give enough praise for Dr. Herron too, such an awesome teacher who really cares about his students!","best_comment_short":"Make sure you take the time to do the readings, which can be long sometimes but SUPER INTERESTING, because the class discussions were so intellectually simulating and perspective changing.","best_comment_first":"TAKE THIS COURSE!!!","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9b1e7c31649e3e2fb4952654170c279c0f21122a185f60d046762bd15c14d4b74cb1c5b419b89f2d34ccad11ef318a3e&ReportType=2&regl=en-US"},{"course_code":"ECON 970","useful_title":"Tutorial - Sophomore Year","course_score_mean":5.0,"rec_score_mean":4.83,"gem_score_mean":0.0,"sentiment_score_median":0.8443,"best_gem_comment":"","workload_score_mean":6.33,"best_gem_comment_short":"","best_comment":"This was my favourite class this semester. Class discussions were engaging, the selection of readings was varied and always interesting, and Cirrus did an amazing job at guiding the conversation and helping students through the process of writing an economics paper. Highly recommend it to anyone interested in technology and economics!","best_comment_short":"Class discussions were engaging, the selection of readings was varied and always interesting, and Cirrus did an amazing job at guiding the conversation and helping students through the process of writing an economics paper.","best_comment_first":"This was my favourite class this semester.","course_id":"122752","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4b02e128e54bdc220dad45a7a96867dd8f3155e3635a35642107b629ae438b4cf7dc7c52c0743c972f73971b5d513723&ReportType=2&regl=en-US"},{"course_code":"EXPOS 40","useful_title":"Public Speaking Practicum","course_score_mean":4.93,"rec_score_mean":4.93,"gem_score_mean":0.0,"sentiment_score_median":0.89315,"best_gem_comment":"","workload_score_mean":3.36,"best_gem_comment_short":"","best_comment":"This class is such a fantastic way to push out of your comfort zone– not only does it improve you as a speaker but it improves your confidence, ability to interact with feedback, and to think critically about how you communicate with others. It's also a super fun and generally not super intense class!","best_comment_short":"This class is such a fantastic way to push out of your comfort zone– not only does it improve you as a speaker but it improves your confidence, ability to interact with feedback, and to think critically about how you communicate with others.","best_comment_first":"This class is such a fantastic way to push out of your comfort zone– not only does it improve you as a speaker but it improves your confidence, ability to interact with feedback, and to think critically about how you communicate with others.","course_id":"125227","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8ddfcb0720ad5c95c3b675e9526fd9dd66d76abeb7a17b6ffb7f7f0e1868a2b0f0be331cd3bccec6393120e6a6c274e8&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 254","course_score_mean":4.64,"rec_score_mean":4.64,"gem_score_mean":0.0,"sentiment_score_median":0.924,"best_gem_comment":"","workload_score_mean":7.15,"best_gem_comment_short":"","best_comment":"This class will push you. Sometimes, especially in the final essay deadline season, it might even make you question your relationship in writing. However, at the end of the day, not only will you come away with a community that you can always  lean on, but you will also become a better writer than you ever thought was possible. In the hard seasons, you will have a professor who genuinely cares about you and wants you to succeed. He will work with you through the challenges, and give you grace when you need it. You will also meet incredibly strong and inspiring people who have themselves been through mass incarceration, giving you a better understanding for the system than any book or article ever could. To this day, I still get chills when I think about some of the stories our visitors shared. I find myself humbled at the reality of our system today, while also being filled with a sense of hope that maybe our generation can begin to help make a dent in ending mass incarceration, and bringing humanity to those behind bars so that they can one day come back into their communities and positively contribute to them, too. By the end of the course, you will understand the complexities of our system, and all of the injustice behind it. and, hopefully, you will come away wanting to do something about it. At least I did, and this course, through its social engagement capstone project, will give you a place to start. If accommodations and accessibility are concerns, rest assured that Hudson will work with you and insure that you have what you need throughout the course! I highly recomend taking this course. The work load is pretty light until you get to essay writing, but this course is so much more than just a writing course, and will teach you so much about mass incarceration and life itself.","best_comment_short":"You will also meet incredibly strong and inspiring people who have themselves been through mass incarceration, giving you a better understanding for the system than any book or article ever could.","best_comment_first":"This class will push you.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a8f921a8251adba5f48a6650d96cdb5441156c5b063145426babff5d8cb0af71360c7da71396bbdf05e9883743153f19&ReportType=2&regl=en-US"},{"course_code":"ARABIC 131A","useful_title":"Upper-Level Modern Arabic l","course_score_mean":4.75,"rec_score_mean":4.63,"gem_score_mean":0.0,"sentiment_score_median":0.8032,"best_gem_comment":"","workload_score_mean":13.29,"best_gem_comment_short":"","best_comment":"This class is A LOT OF WORK but you learn A LOT OF ARABIC. You must know walking in that the nightly homework, biweekly tests, and biweekly essays make this class very demanding––your week may revolve around it like mine did. That being said, its excellently designed, Madi is an amazing teacher, and you learn a lot. But it is very very difficult and requires a high level of buy–in. You have to really love the language and be committed to learning it because again this is a tough class that will ask a lot of you. That being said, you get a lot out of it. Be ready to spend 10–15+ hours a week learning vocab, writing essays, studying grammar, in office hours, etc. but know you'll come out better, the department really cares about you, and the small–class environment cultivates a fun community.","best_comment_short":"but know you'll come out better, the department really cares about you, and the small–class environment cultivates a fun community.","best_comment_first":"This class is A LOT OF WORK but you learn A LOT OF ARABIC.","course_id":"121346","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=dcf148fbcf66ced5c5e2940875a85f041f6adba8607aab8891611789b685438f5cee34ce0497b7f87ee0ab3e55597303&ReportType=2&regl=en-US"},{"course_code":"CHNSE 107A","useful_title":"Intermediate Literary Chinese","course_score_mean":4.83,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.7264,"best_gem_comment":"","workload_score_mean":11.33,"best_gem_comment_short":"","best_comment":"I could not recommend this class more enthusiastically. Students will come away better equipped to read, understand, and translate Classical Chinese; more confident in collaborating with classmates in engaging with the language; and with a substantially–improved familiarity with their *own* areas of study thanks to Dr. Sena's flexibility vis–a–vis allowing students to choose translation texts freely.","best_comment_short":"Students will come away better equipped to read, understand, and translate Classical Chinese; more confident in collaborating with classmates in engaging with the language; and with a substantially–improved familiarity with their *own* areas of study thanks to Dr. Sena's flexibility vis–a–vis allowing students to choose translation texts freely.","best_comment_first":"I could not recommend this class more enthusiastically.","course_id":"112899","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=857ae24ee107620e835f0acb1815e34eb701f0adc45c7e1b01463415d4937c7aeca6241ae2e4380aa0543065fd6a4e98&ReportType=2&regl=en-US"},{"course_code":"LING 73C","useful_title":"Beginning ASL III","course_score_mean":4.67,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.8999,"best_gem_comment":"","workload_score_mean":3.13,"best_gem_comment_short":"","best_comment":"ASL 3 is going to be more difficult than ASL 1 or 2, but it's still an amazing class. Anbo is an amazing and caring professor and I highly suggest this class to anyone with an interest in pursuing greater competency of ASL past the first 2 classes offered at Harvard.","best_comment_short":"Anbo is an amazing and caring professor and I highly suggest this class to anyone with an interest in pursuing greater competency of ASL past the first 2 classes offered at Harvard.","best_comment_first":"ASL 3 is going to be more difficult than ASL 1 or 2, but it's still an amazing class.","course_id":"205111","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d4b8babcebcdeb991f66dcd8222b9db917abd1ed63beab6c8a8a1b5f0efdf73eec7c16456f2b22b8d773068dc7b4913c&ReportType=2&regl=en-US"},{"course_code":"CHNSE 120A","useful_title":"Intermediate Modern Chinese","course_score_mean":4.75,"rec_score_mean":4.75,"gem_score_mean":0.0,"sentiment_score_median":0.8164,"best_gem_comment":"","workload_score_mean":4.36,"best_gem_comment_short":"","best_comment":"Please take this course! The Chinese department is extremely well–organized and responsive to any questions and concerns that you may have. They will always respond to your emails very quickly and are understanding and accommodating of any situations that may pop up, since this course meets every single day of the week. If you do all the work as intended, such as showing up to class everyday, pay attention and actively participate, study for the twice a week dictations, and do the weekly homework assignments, it is extremely hard to fall behind, and you don't need to do much studying outside of this. The course is well designed and extremely manageable and I have definitely noticed an improvement in my Chinese level after taking this course, since now I can understand much more of the dialogue when I'm watching Chinese shows or consuming Chinese media.","best_comment_short":"The course is well designed and extremely manageable and I have definitely noticed an improvement in my Chinese level after taking this course, since now I can understand much more of the dialogue when I'm watching Chinese shows or consuming Chinese media.","best_comment_first":"Please take this course!","course_id":"113793","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ca1bc49f5ae880855c68312776de967f572e8e9f3d10014f76321fc0241a6e7f75dff4cb8db4ae533053f2d7737010c8&ReportType=2&regl=en-US"},{"course_code":"CHNSE BX","useful_title":"Elementary Chinese for Advanced Beginners","course_score_mean":4.88,"rec_score_mean":4.88,"gem_score_mean":0.0,"sentiment_score_median":0.9086,"best_gem_comment":"","workload_score_mean":6.56,"best_gem_comment_short":"","best_comment":"At home I would always respond to my parents' Chinese questions in English, so my speaking was weak and really slow going into this class. After taking it, I have noticed a significant improvement in my speaking abilities, and now I'm pretty comfortable speaking to my parents in Chinese. It's a great, fun, comprehensive class that will guarantee to improve your Chinese if your level is like mine. All grammar and vocab is really strongly consolidated through the 5 classes per week and pretty long weekly homework assignments (these generally took me and others around 4 hours per homework to complete) – and that's a lot of essential and useful grammar structures, since the course covers 12 grammar structures a week. The textbook is also really interesting – the stories aren't dry like you might expect from an introductory course, and there are super insightful Chinese culture nuggets dotted around throughout the textbook. I would really recommend this course if your speaking isn't that good and you want a solid accelerator course to improve your Chinese speaking and reading!","best_comment_short":"It's a great, fun, comprehensive class that will guarantee to improve your Chinese if your level is like mine.","best_comment_first":"At home I would always respond to my parents' Chinese questions in English, so my speaking was weak and really slow going into this class.","course_id":"120305","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b25b5c363f0dedac724d045471868a48e02b7a2fad381dfc96bf85db46f01f3a04d219cd348b12a24a6736aec2ba454b&ReportType=2&regl=en-US"},{"course_code":"ECON 970","useful_title":"Tutorial - Sophomore Year","course_score_mean":4.89,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":0.8338,"best_gem_comment":"","workload_score_mean":11.11,"best_gem_comment_short":"","best_comment":"This is fantastic class that will demand a lot from you, but will also give you a lot. Definitely assume this class will take up a lot of your time, but know that the more you put into it, the more you will get out of the class. There is a lot of writing, but it is very helpful practice and Prof. Felter gives you tons of helpful comments. And make sure that you go to office hours for the R\/Stata PSets, the OH staff are very helpful.","best_comment_short":"There is a lot of writing, but it is very helpful practice and Prof. Felter gives you tons of helpful comments.","best_comment_first":"This is fantastic class that will demand a lot from you, but will also give you a lot.","course_id":"122752","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8539ae1d5edad74f3c721d243d8855ed30e05083cdfdccf3728d7eca34caf2f891d6b0e0c64c0adc8f78d6a2bded71a0&ReportType=2&regl=en-US"},{"course_code":"TDM 120","useful_title":"What's so Funny? Introduction to Improvisational Comedy","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.8151,"best_gem_comment":"","workload_score_mean":1.0,"best_gem_comment_short":"","best_comment":"Remo is absolutely remarkable! If you have the opportunity to take a class with him (this one especially) then do it! You will NOT regret it. Not only did I have so much fun during class and section, I also learned many life skills: from immensely improving my memorization (which is critical when doing improv) to embracing the unknown to building my overall confidence with interacting with others. You will leave this class fostering friendships with all of your peers while evolving into a more confident, playful version of yourself. I have so so much love for improv, for Remo, and for my classmates <3 This is simply one of the best classes I’ve taken at this institution and one I will remember throughout my entire lifetime.","best_comment_short":"I have so so much love for improv, for Remo, and for my classmates <3 This is simply one of the best classes I’ve taken at this institution and one I will remember throughout my entire lifetime.","best_comment_first":"Remo is absolutely remarkable!","course_id":"160654","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=230d38ba1a5840e0f2b77747bc6ffef1467a38a2ed142b1bc9fdfc7e96cdca421cc78434ff1b2e105a5583229192c7d8&ReportType=2&regl=en-US"},{"course_code":"HEB 1245","useful_title":"Technology, Behavior, and Human Evolution","course_score_mean":4.64,"rec_score_mean":4.71,"gem_score_mean":0.0,"sentiment_score_median":0.9221,"best_gem_comment":"","workload_score_mean":3.64,"best_gem_comment_short":"","best_comment":"Great class and not too difficult. It can be really interesting if you make sure that you actually engage with the material, but will be very boring if you do not. I would suggest taking it if you have interest in the topic, but not if you don't. If you are interested definitely take it and it will be so much easier for you because you enjoy it! Also, ideally you would do the readings and pay attention in class but I think for the most part you can do one or the other depending on which you prefer.","best_comment_short":"If you are interested definitely take it and it will be so much easier for you because you enjoy it!","best_comment_first":"Great class and not too difficult.","course_id":"220758","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9f0b6cb42c94613e4010eb284277241b09a94025df45050597edb222dc679d9bd9b864703d341047b5c10499d28133bf&ReportType=2&regl=en-US"},{"course_code":"WOMGEN 1208","useful_title":"Gender and Sexuality in Korean Pop Culture","course_score_mean":4.86,"rec_score_mean":4.79,"gem_score_mean":0.0,"sentiment_score_median":0.8541,"best_gem_comment":"","workload_score_mean":4.43,"best_gem_comment_short":"","best_comment":"The class is amazing! Professor Choi, not only seems very passionate about this topic, but she also is just a kind and amazing person overall.  She provides feedback on every assignment and piece of work you turn in by either the office hours you attend or the next week's class. She always has lots of options for office hours and responds to emails very promptly. If you like WGS or Korean culture, I highly recommend this class. It is not very difficult and is very fun. I loved the subject and the professor as well.","best_comment_short":"Professor Choi, not only seems very passionate about this topic, but she also is just a kind and amazing person overall.","best_comment_first":"The class is amazing!","course_id":"220297","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=efba8e0e059a2f09948c59bd6dcae73066584b4914dad8fc8fdec8da1d8e89079df531691395149c1600ea2dfc56408a&ReportType=2&regl=en-US"},{"course_code":"ECON 2725","useful_title":"Corporate Finance and Banking","course_score_mean":4.9,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.79625,"best_gem_comment":"","workload_score_mean":8.0,"best_gem_comment_short":"","best_comment":"I took this class as an undergrad. It definitely took more work than an average class, but with a strong interest in finance I found the work to be highly rewarding and great preparation for graduate studies. I recommend that if you decide to take this class as an undergrad, you should be highly comfortable with microeconomics, econometrics and mathematics, and I believe some background knowledge of topics in corporate finance is also needed.","best_comment_short":"It definitely took more work than an average class, but with a strong interest in finance I found the work to be highly rewarding and great preparation for graduate studies.","best_comment_first":"I took this class as an undergrad.","course_id":"110731","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d3a4c0143ae12184994e0408372a92ef69238e517e617f906f4557d3c4ae02527a7f7f45445a080526343be975e4fd33&ReportType=2&regl=en-US"},{"course_code":"MUSIC 14","useful_title":"Harvard-Radcliffe Collegium Musicum","course_score_mean":4.76,"rec_score_mean":4.76,"gem_score_mean":0.0,"sentiment_score_median":0.8737,"best_gem_comment":"","workload_score_mean":3.26,"best_gem_comment_short":"","best_comment":"Collegium is one of the warmest, most welcoming communities that I've found on campus, and it doesn't hurt that they're one of the most musically talented. If you like good music, friends, and performances, it's wonderful.","best_comment_short":"Collegium is one of the warmest, most welcoming communities that I've found on campus, and it doesn't hurt that they're one of the most musically talented.","best_comment_first":"Collegium is one of the warmest, most welcoming communities that I've found on campus, and it doesn't hurt that they're one of the most musically talented.","course_id":"110114","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ecae051abc9018583a6d95e83e2eb49062ab1592d4149f3542cc1351c80ec57107747ec7a7cf5efbb1316312638321d6&ReportType=2&regl=en-US"},{"course_code":"COMPSCI 290A","useful_title":"Seminar on Effective Research Practices and Academic Culture","course_score_mean":4.32,"rec_score_mean":4.43,"gem_score_mean":0.0,"sentiment_score_median":0.836,"best_gem_comment":"","workload_score_mean":1.29,"best_gem_comment_short":"","best_comment":"I think (and hope) this course is required, but I suggest, as much as possible, actually engaging with your peers and the material. This class is meant to be very easy and that makes it possible to slide by without ever really engaging, but I think there is real personal value in choosing to engage and doing so gives you a chance to create the culture and community that you want to see for your cohort. Go to office hours, talk to people, it's a great chance to form relationships that can give you a support system outside of your little academic corner.","best_comment_short":"This class is meant to be very easy and that makes it possible to slide by without ever really engaging, but I think there is real personal value in choosing to engage and doing so gives you a chance to create the culture and community that you want to see for your cohort.","best_comment_first":"I think (and hope) this course is required, but I suggest, as much as possible, actually engaging with your peers and the material.","course_id":"216811","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f7eda2846c7ad0302cac21d3ade3478118655ff732dd90ac28a4058d4c5a8d051d3eb6eea197251b724c01c258d29fe1&ReportType=2&regl=en-US"},{"course_code":"FRENCH 50","useful_title":"Advanced French II Justice, Equity, Rights, and Language","course_score_mean":4.83,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":0.8151,"best_gem_comment":"","workload_score_mean":4.5,"best_gem_comment_short":"","best_comment":"Would highly recommend this class and Dr. Turman! This is the first French course I have taken at Harvard in person (took 2 on zoom), and it was very enjoyable. Class time has a very relaxed feel, mostly focusing on conversation with other students about various aspects of writing or pieces that we were reading. I definitely improved my speaking and listening skills because of this. The most stressful aspects of the course were vocabulary quizzes which were very short and easy (just know the words) and in–class essays. However, Dr. Turman is very fair in grading in–class essays, and they are a smaller part of your grade than the final product. Additionally, it was very helpful to have a template with feedback when you go to write the second draft! In short, would highly recommend! I learned a lot from this class without being too stressed about it.","best_comment_short":"I definitely improved my speaking and listening skills because of this.","best_comment_first":"Would highly recommend this class and Dr. Turman!","course_id":"126998","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=616dd92874ba54b69899401d7e3a469a1398ca4e4ecd518dd7fae9ea23a465cfe58591d08153b4d105b0a09f9416fe79&ReportType=2&regl=en-US"},{"course_code":"TDM 169S","useful_title":"Singer + Song = Story","course_score_mean":4.6,"rec_score_mean":4.79,"gem_score_mean":0.0,"sentiment_score_median":0.8429,"best_gem_comment":"","workload_score_mean":1.87,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS!!!! The professor is amazing. The content is amazing. The other students are amazing. The way you'll force yourself to grow and change and explore are amazing. You'll have so much fun in this class. It changed my life and potentially my career direction. It was my favorite course this semester!","best_comment_short":"The professor is amazing.","best_comment_first":"TAKE THIS CLASS!!!!","course_id":"215988","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=fb50ce366121f8ceb53e3e9bc6d4669b7791219dc79902d8bec5881ddffb599d1dd6e1a8cef6b71f918a3bb314ec9378&ReportType=2&regl=en-US"},{"course_code":"COMPSCI 236R","useful_title":"Topics at the Interface between Computer Science and Economics","course_score_mean":4.58,"rec_score_mean":4.32,"gem_score_mean":0.0,"sentiment_score_median":0.8929,"best_gem_comment":"","workload_score_mean":5.0,"best_gem_comment_short":"","best_comment":"This class has honestly been one of the highlights of the semester –– if you come into it willing to read papers pretty thoroughly and discuss them, you'll get a lot out of the course. A lot of things definitely flew over my head quite a bit, but you can definitely ask clarification questions and spark discussion in class and shouldn't be shy to. Yiling is really great and helpful and loves discussion, and all the people taking this class will be coming from a variety of backgrounds across CS\/econ\/math\/applied math and a variety of educational backgrounds as well, which is really fascinating. Overall, I'd recommend this class a ton as long as you feel ready for it!","best_comment_short":"Yiling is really great and helpful and loves discussion, and all the people taking this class will be coming from a variety of backgrounds across CS\/econ\/math\/applied math and a variety of educational backgrounds as well, which is really fascinating.","best_comment_first":"This class has honestly been one of the highlights of the semester –– if you come into it willing to read papers pretty thoroughly and discuss them, you'll get a lot out of the course.","course_id":"116531","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4e2e1fa5372c76d338a7370fea4be81568f29a54bafd4202689e8280489ccc0a0f6a37cbbd0d37242dbcce7538af48f0&ReportType=2&regl=en-US"},{"course_code":"CHNSE BX","useful_title":"Elementary Chinese for Advanced Beginners","course_score_mean":4.89,"rec_score_mean":4.78,"gem_score_mean":0.0,"sentiment_score_median":0.9096,"best_gem_comment":"","workload_score_mean":8.67,"best_gem_comment_short":"","best_comment":"If you are a heritage Chinese learner but feel like your Chinese is rusty or you haven't had much experience reading or writing, TAKE THIS CLASS! The teachers are fantastic and always bring so much energy into each lesson, and I genuinely believe that my Chinese has improved dramatically over the course of just one semester. One thing I will say about this course is that it occurs every day and the building is pretty far, so it definitely is a big commitment to take this class and it will take up a decent amount of your week. In addition, the hand–written homework assignments every week can get pretty draining, so be prepared to spend some hours on that. Another thing is that the lectures are all done in traditional Chinese (even if the homework, drills, and tests can be done in simplified Chinese), which caused some of the material learned in class to go over my head. However, overall I am very glad that I took this course and I feel much more confident in my language abilities, especially going into tougher higher–level Chinese classes in the future.","best_comment_short":"However, overall I am very glad that I took this course and I feel much more confident in my language abilities, especially going into tougher higher–level Chinese classes in the future.","best_comment_first":"If you are a heritage Chinese learner but feel like your Chinese is rusty or you haven't had much experience reading or writing, TAKE THIS CLASS!","course_id":"120305","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=11d62ae3924890eefc1e42a0d7b01444cb0afa92c0b4152e360dbd4952b766009e714057756b5fab45bde79c3b541bf1&ReportType=2&regl=en-US"},{"course_code":"HIST 99A","useful_title":"Senior Thesis Tutorial","course_score_mean":4.29,"rec_score_mean":4.77,"gem_score_mean":0.0,"sentiment_score_median":0.7463,"best_gem_comment":"","workload_score_mean":8.69,"best_gem_comment_short":"","best_comment":"This class is required if you (primarily) concentrate in history so you don't really have much of a choice, but even if you're just an allied concentrator in history, this class is still great because (a) it counts for credit, and your thesis is a LOT more work than you think and (b) Carla and Kenneth (and I'm sure whoever replaces Kenneth once he graduates) are great resources for writing your thesis.","best_comment_short":"This class is required if you (primarily) concentrate in history so you don't really have much of a choice, but even if you're just an allied concentrator in history, this class is still great because (a) it counts for credit, and your thesis is a LOT more work than you think and (b) Carla and Kenneth (and I'm sure whoever replaces Kenneth once he graduates) are great resources for writing your thesis.","best_comment_first":"This class is required if you (primarily) concentrate in history so you don't really have much of a choice, but even if you're just an allied concentrator in history, this class is still great because (a) it counts for credit, and your thesis is a LOT more work than you think and (b) Carla and Kenneth (and I'm sure whoever replaces Kenneth once he graduates) are great resources for writing your thesis.","course_id":"116853","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c27d62eb84d51ef92846f72bdc41b0e69662630cf2bbde27968ecdeeea8398bfd81ea77cfc2f5c482596a1252161f987&ReportType=2&regl=en-US"},{"course_code":"EXPOS 40","useful_title":"Public Speaking Practicum","course_score_mean":4.93,"rec_score_mean":4.93,"gem_score_mean":0.0,"sentiment_score_median":0.94705,"best_gem_comment":"","workload_score_mean":3.36,"best_gem_comment_short":"","best_comment":"Definitely one of the best classes I've taken at Harvard! I looked forward to class every week and would wholeheartedly recommend that you take Expos 40!! The structure of the class really facilitates a strong class community where everyone trusts each other and gives really kind, but helpful feedback. Each preceptor teaches the class a little different, I thought Zach did an incredible job. I feel like my public speaking ability improved over the semester, both from giving speeches and listening to all my classmates deliver theirs. Everyone I know that has taken Expos 40, regardless of their preceptor, has absolutely loved the class — you should take it.","best_comment_short":"The structure of the class really facilitates a strong class community where everyone trusts each other and gives really kind, but helpful feedback.","best_comment_first":"Definitely one of the best classes I've taken at Harvard!","course_id":"125227","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=667c73b1d9617a37cb739436ad1afcc7c510f69b5f4d4b9e46e32bf233e28f1ac3044f12aa879271d8d522d564ca048f&ReportType=2&regl=en-US"},{"course_code":"ENG-SCI 225","useful_title":"Neuroengineering","course_score_mean":4.6,"rec_score_mean":4.65,"gem_score_mean":0.0,"sentiment_score_median":0.8098,"best_gem_comment":"","workload_score_mean":6.75,"best_gem_comment_short":"","best_comment":"I highly recommend this course! I took it as an extra elective as a BME concentrator, but I suggest it for anybody interested in neuroscience, research, or technology and its applications. The focus of the course is the technology and methodology that has progressed the field of neuroscience, but we often discussed the biological principles as well. A background in biology and circuitry is helpful , but more necessary for biology than circuitry in my experience. I did not have much electrical engineering background and was able to follow along and learn about what was relevant to understanding the lectures. I found Professor Liu to be very friendly and an engaging lecturer and the TFs are very helpful and timely with grading. The course staff is flexible and understanding and greatly takes into account the student's time and preferences. Classes were mainly structured a lecture\/seminar style with a lot of Q&A and discussion. As an undergrad, it is helpful to have grad students in the course who contribute a lot to the discussion and ask great questions. Professor Liu was able to answer a lot of our questions and hypotheticals with a satisfying and in depth answer, even when the conclusion of the research was \"we don't know yet\". Assignments were not a stressor for me at all. The journal club one page responses and presentations were on very interesting and crucial publications and did not take more than a few hours at most to do. It was a low stakes way to continue developing comprehension and analysis skills of scientific literature. The midterm and final presentations were similar in purpose to the journal clubs, and Professor Liu only wanted us to engage with and understand the most important papers in the field and he made it clear that it was not supposed to be stressful, and it wasn't.  As with every group assignment, it is definitely easier when the whole group is committed and timely. Make sure to NOT GO OVER TIME during presentations, since that's effectively the only way to lose big points. The final paper assignment is not too bad, but if you have never written a grant proposal or literature review before, it would be helpful for you to brush up on it. The course does provide examples and criteria though.  IMPORTANT NOTE: I took this course after it was not offered for a while and more people  than expected enrolled, meaning the staff was not able to accomodate everyone in the lab which was added that semester. Normally both lab and journal club assignments are required but they gave our class the option to do one or the other which made the time commitment significantly lower for me than it might be in the future. With that said, the lab is a very interesting and exciting part of the course, and even though I chose the journal clubs because of other heavy classes, I do wish I had the time for the lab.  Also, it was nice that I was able to grab flyby lunch before\/after class at the SEC, and I happened by a lot of free food and events after leaving class.","best_comment_short":"With that said, the lab is a very interesting and exciting part of the course, and even though I chose the journal clubs because of other heavy classes, I do wish I had the time for the lab.","best_comment_first":"I highly recommend this course!","course_id":"216799","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4f79aaefef501d0f1fc670b8224c1486182775f6c6e26946730a10974ffb921d464f1ee294fae1bb794cdfa7d86a9884&ReportType=2&regl=en-US"},{"course_code":"BE 131","useful_title":"Neuroengineering","course_score_mean":4.6,"rec_score_mean":4.65,"gem_score_mean":0.0,"sentiment_score_median":0.8098,"best_gem_comment":"","workload_score_mean":6.75,"best_gem_comment_short":"","best_comment":"I highly recommend this course! I took it as an extra elective as a BME concentrator, but I suggest it for anybody interested in neuroscience, research, or technology and its applications. The focus of the course is the technology and methodology that has progressed the field of neuroscience, but we often discussed the biological principles as well. A background in biology and circuitry is helpful , but more necessary for biology than circuitry in my experience. I did not have much electrical engineering background and was able to follow along and learn about what was relevant to understanding the lectures. I found Professor Liu to be very friendly and an engaging lecturer and the TFs are very helpful and timely with grading. The course staff is flexible and understanding and greatly takes into account the student's time and preferences. Classes were mainly structured a lecture\/seminar style with a lot of Q&A and discussion. As an undergrad, it is helpful to have grad students in the course who contribute a lot to the discussion and ask great questions. Professor Liu was able to answer a lot of our questions and hypotheticals with a satisfying and in depth answer, even when the conclusion of the research was \"we don't know yet\". Assignments were not a stressor for me at all. The journal club one page responses and presentations were on very interesting and crucial publications and did not take more than a few hours at most to do. It was a low stakes way to continue developing comprehension and analysis skills of scientific literature. The midterm and final presentations were similar in purpose to the journal clubs, and Professor Liu only wanted us to engage with and understand the most important papers in the field and he made it clear that it was not supposed to be stressful, and it wasn't.  As with every group assignment, it is definitely easier when the whole group is committed and timely. Make sure to NOT GO OVER TIME during presentations, since that's effectively the only way to lose big points. The final paper assignment is not too bad, but if you have never written a grant proposal or literature review before, it would be helpful for you to brush up on it. The course does provide examples and criteria though.  IMPORTANT NOTE: I took this course after it was not offered for a while and more people  than expected enrolled, meaning the staff was not able to accomodate everyone in the lab which was added that semester. Normally both lab and journal club assignments are required but they gave our class the option to do one or the other which made the time commitment significantly lower for me than it might be in the future. With that said, the lab is a very interesting and exciting part of the course, and even though I chose the journal clubs because of other heavy classes, I do wish I had the time for the lab.  Also, it was nice that I was able to grab flyby lunch before\/after class at the SEC, and I happened by a lot of free food and events after leaving class.","best_comment_short":"With that said, the lab is a very interesting and exciting part of the course, and even though I chose the journal clubs because of other heavy classes, I do wish I had the time for the lab.","best_comment_first":"I highly recommend this course!","course_id":"216486","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4f79aaefef501d0f1fc670b8224c1486182775f6c6e26946730a10974ffb921d464f1ee294fae1bb794cdfa7d86a9884&ReportType=2&regl=en-US"},{"course_code":"GOV 94GK","useful_title":"The Politics and Ethics of Health Care","course_score_mean":4.8,"rec_score_mean":4.9,"gem_score_mean":0.0,"sentiment_score_median":0.8481,"best_gem_comment":"","workload_score_mean":5.0,"best_gem_comment_short":"","best_comment":"Take this course. The best gov class I've taken at Harvard hands down. Gabe has had time to refine the course and it really shows. The readings complement discussion well, and are very thoughtfully picked out to reflect current trends as well. You also have enough freedom to pursue the questions you're interested in, but still get to know the basics about ethics \/ healthcare policy that will supplement your exploration of those questions. Great, great course.","best_comment_short":"Great, great course.","best_comment_first":"Take this course.","course_id":"109731","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e7e176c3edf225491a0223df1afdd998c77e2dc6d341ff2a608c1829050f7e9d05a245d23e19104cc833cdf206af2dff&ReportType=2&regl=en-US"},{"course_code":"CHNSE 130XA","useful_title":"Pre-Advanced Modern Chinese for High-Proficiency Learners","course_score_mean":4.85,"rec_score_mean":4.92,"gem_score_mean":0.0,"sentiment_score_median":0.8968,"best_gem_comment":"","workload_score_mean":6.31,"best_gem_comment_short":"","best_comment":"This course is phenomenal. The Harvard Chinese Department is truly amazing in creating courses that really help you improve your Chinese while still being fun and creating a comfortable class environment. Almost everything about this course was done right. The lectures and sections were always fun, yet informative. Structural boundaries were in place to make sure that lessons did not go off topic, but enough leeway was given to create a comfortable and fun environment where students felt willing to speak up and learn and make mistakes. The units were great in covering lots of vocabulary and content on real life issues. Finally, both of the teachers were very responsive, attentive, understanding, and relatable — our class even had a hot pot lunch outing after the class was finished because of how close everyone got and how much we loved our teachers :) Highly recommend.","best_comment_short":"The Harvard Chinese Department is truly amazing in creating courses that really help you improve your Chinese while still being fun and creating a comfortable class environment.","best_comment_first":"This course is phenomenal.","course_id":"124235","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6eb045f06f21856e20ecce302e4592781d14acccfdf7d958f09df02a16b21d632d3602008420ee6cd4b3560df1ca4bf8&ReportType=2&regl=en-US"},{"course_code":"MUSIC 107","useful_title":"Advanced Ensembles","course_score_mean":4.41,"rec_score_mean":4.65,"gem_score_mean":0.0,"sentiment_score_median":0.8845,"best_gem_comment":"","workload_score_mean":5.76,"best_gem_comment_short":"","best_comment":"HRO remains one of my favorite parts of Harvard.  When I arrived on campus my freshman year, filled with anxiety and raging imposter syndrome, HRO was the first home I found.  I knew I wanted to join, so I auditioned and joined.  When we went on retreat that first Labor Day weekend, I suddenly felt at home.  I loved getting to know everyone in the orchestra, and sitting in the orchestra is one of the few places at Harvard where I feel I truly have a way to give back to this university that gives me so much.  A year and a half later, HRO has only grown more important to me.  Many of my favorite memories so far at Harvard have been made through HRO; unforgettable concerts, fun rehearsal memories, and wonderful times with friends at HRO social functions outside of rehearsals.  Many of my closest friends have been made through HRO.  It's the most important community to me at Harvard and the extracurricular to which I am most devoted.","best_comment_short":"Many of my favorite memories so far at Harvard have been made through HRO; unforgettable concerts, fun rehearsal memories, and wonderful times with friends at HRO social functions outside of rehearsals.","best_comment_first":"HRO remains one of my favorite parts of Harvard.","course_id":"220622","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=cbcbfa99631ade7ef25e47a14d6e57ef098d31f5b85c1b1a31129414942da48ce7b433d76560a1bbb1a04772df5725fa&ReportType=2&regl=en-US"},{"course_code":"COMPLIT 107","useful_title":"The Politics of Yiddish","course_score_mean":4.7,"rec_score_mean":4.7,"gem_score_mean":0.0,"sentiment_score_median":0.7805,"best_gem_comment":"","workload_score_mean":3.0,"best_gem_comment_short":"","best_comment":"This is a great introduction to the history and politics of Yiddish. All of the course materials are very engaging and this is a wonderful chance to push and deepen your knowledge of Yiddish.","best_comment_short":"All of the course materials are very engaging and this is a wonderful chance to push and deepen your knowledge of Yiddish.","best_comment_first":"This is a great introduction to the history and politics of Yiddish.","course_id":"207574","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=16fb55ca90174fc1501437b18727b0dbad4bbd2dfde3f297f7f609077c3384e75fd5745ba8a40929cf70a833e3c8b06b&ReportType=2&regl=en-US"},{"course_code":"CHNSE BA","useful_title":"Elementary Modern Chinese","course_score_mean":4.81,"rec_score_mean":4.76,"gem_score_mean":0.0,"sentiment_score_median":0.7461,"best_gem_comment":"","workload_score_mean":7.1,"best_gem_comment_short":"","best_comment":"This is truly one of, if not, the best class I have taken at this school. The teachers are absolutely amazing, and they are truly here to help you learn Chinese, regardless of where you begin. They will teach you, make the class comedic and fun, applicable to real conversational Chinese, rather than conversational, and just makes the entire process of learning this language so fun, comfortable, yet still extremely productive in learning a large amount of material. No matter how overwhelmed you may get, there is plenty of practice and help provided by the course that ensures that you will catch up and be up to par with your classmates, of course assuming that you do actively participate in class and overall materials. You build a great community, as you do see them every single day of your semester. All that being said, please do your work, study the material, keep up with the class before it is too late, this class is what you make of it, so with just a little bit of effort, you get such high rewards. Truly, if you are at all interested in learning Chinese or Chinese culture, or just to truly have fun while learning something extremely useful, take Chinese!","best_comment_short":"Truly, if you are at all interested in learning Chinese or Chinese culture, or just to truly have fun while learning something extremely useful, take Chinese!","best_comment_first":"This is truly one of, if not, the best class I have taken at this school.","course_id":"113873","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d8c3767d0feaf53bd85c84efb5f9fae6cf19435181e581f36959732ef734486bcd913a99085bf66e7249c6979a7d2353&ReportType=2&regl=en-US"},{"course_code":"TDM 149","useful_title":"Latine Movement Embodied Intersections of Latin Dance, Music, and Communal Practice","course_score_mean":4.86,"rec_score_mean":4.89,"gem_score_mean":0.0,"sentiment_score_median":0.8696,"best_gem_comment":"","workload_score_mean":2.16,"best_gem_comment_short":"","best_comment":"TAKE THIS COURSE!! This is an amazing course! I never took a TDM course before and this was the perfect introduction. Even in the very first week I knew that this class would be a place of relaxation because it just felt very zen, being able to communicate through our bodies. The class was usually structured with some sort of warm up, history about the dance form that was being introduced and communal dance practice.  The structure was awesome and many students were able to get out of their comfort zones given the varying amounts of experience. The final consisted of an individual choreography created by LROD as well as a partner choreography created by us! The final wasn't stressful at all and had just been something we'd done several times in general class. LROD is an amazing instructor and she taught this class of 44 like a veteran (even though it was her first time!) Take this course and learn amazing dance forms of salsa, mambo, cumbia and bachata.","best_comment_short":"The structure was awesome and many students were able to get out of their comfort zones given the varying amounts of experience.","best_comment_first":"TAKE THIS COURSE!!","course_id":"217446","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9c3be5e240bd66bc63d5a0c2f871f3a45479d0ecf35c6b3f25cd2429e69bc66c9f9eca081d9ea8e5e2b3e14fcc078f37&ReportType=2&regl=en-US"},{"course_code":"CHNSE BA","useful_title":"Elementary Modern Chinese","course_score_mean":4.7,"rec_score_mean":4.7,"gem_score_mean":0.0,"sentiment_score_median":0.91745,"best_gem_comment":"","workload_score_mean":6.6,"best_gem_comment_short":"","best_comment":"Chinese is a difficult language to learn, but the materials and teaching staff for this course make it fun, welcoming, and as easy as I think It can be! All the teachers are friendly and really want you to succeed and learn Chinese, and are always happy to help you do so. The small groups for leacure and section really make it easy to participate, and it doesn't feel like a big deal if you don't know an answer or get it wrong, so go for it! If you are at all curious about learning Chinese, you should take this course!","best_comment_short":"All the teachers are friendly and really want you to succeed and learn Chinese, and are always happy to help you do so.","best_comment_first":"Chinese is a difficult language to learn, but the materials and teaching staff for this course make it fun, welcoming, and as easy as I think It can be!","course_id":"113873","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f884d4cbe9fe3ebbfc2f14722de1aa93c57762faf147a7d54263a10dc922a8b28f7bbc18d6e79ce70361a01440114f51&ReportType=2&regl=en-US"},{"course_code":"PHYSICS 143A","useful_title":"Quantum Mechanics I","course_score_mean":4.62,"rec_score_mean":4.53,"gem_score_mean":0.0,"sentiment_score_median":0.8426,"best_gem_comment":"","workload_score_mean":8.95,"best_gem_comment_short":"","best_comment":"I would highly recommend taking this class! Especially if Louis is teaching it. The material is very interesting if you're interested in mathematical physics. It's taught at a pace that is somewhat fast but still reasonable. You'll see each concept many times (in the textbook, in lecture, in section, on homework) which gives you plenty of opportunities to learn the material and not fall behind. Louis is a fantastic teacher! He explains the material well, and you can tell that he cares about you and your learning, which is great for helping you stay motivated throughout the class. He gives very fair homeworks and tests, and he has a great sense of humor.","best_comment_short":"He explains the material well, and you can tell that he cares about you and your learning, which is great for helping you stay motivated throughout the class.","best_comment_first":"I would highly recommend taking this class!","course_id":"108465","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=714ca49b056afce6b189a2f4700ecee4a88f0fcc91d219dd82efa936fe9e6bd350ced529ef756f85cdb8f2a548e0ef5f&ReportType=2&regl=en-US"},{"course_code":"ENGLISH CCFC","useful_title":"Poetry Workshop Form & Content","course_score_mean":4.9,"rec_score_mean":4.9,"gem_score_mean":0.0,"sentiment_score_median":0.7303,"best_gem_comment":"","workload_score_mean":6.3,"best_gem_comment_short":"","best_comment":"This class will teach you to look at form and language differently, not only in your own writing and in others' poetry, but in life too. One of the joys of this class is that you may find yourself paying closer attention to surprising scraps of language in daily life and taking delight in them. The quality of feedback in a workshop always depends on the cohort, but Tracy is a wonderful model in how to give kind, honest, and constructive critique. In my experience, the community that forms is one where every student is really invested in every other poet's growth, and that allows us to take risks, to bring in poems where we tried something new that didn't work to learn from them, and to learn from one another's strengths.","best_comment_short":"The quality of feedback in a workshop always depends on the cohort, but Tracy is a wonderful model in how to give kind, honest, and constructive critique.","best_comment_first":"This class will teach you to look at form and language differently, not only in your own writing and in others' poetry, but in life too.","course_id":"218756","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=bbf18500a90b83d52de67ff0cb6726e0da7a0d549590383bbe3256b86995a3dfa9bd9b8a1f074ab0759784968bb9c9e8&ReportType=2&regl=en-US"},{"course_code":"STAT 211","useful_title":"Statistical Inference I","course_score_mean":4.7,"rec_score_mean":4.64,"gem_score_mean":0.0,"sentiment_score_median":0.86215,"best_gem_comment":"","workload_score_mean":11.82,"best_gem_comment_short":"","best_comment":"Arguably Prof. Janson went a bit easier this semester—the midterm and final exams were only two questions, not three. But this course is still HARD.  Maybe deceptively so: you could be in a situation where you attend lecture, catch up on the notes, and feel like you have a good command of the material. But then you see a homework problem and just have no idea how to even start it. And when you do figure it out, it's like two pages of bashing. Biweekly problem sets help you manage the workload, but this also creates a dual threat: you get less chances to review the material through solving problems. Anyway, I cannot do the difficulty justice so I'll instead just point to past reviews.Lucas is a terrific lecturer in this course and delivers the material with fluency, seeking to build deeper statistical intuition through the material. This same ethos is reflected in the excellent course notes. Consequently I actually thought the material was more engaging and interesting than Stat 210 and even Stat 111; I definitely left this course having not just learned lots, but also with a better statistical intuition. But, still. Should you take on this course, do NOT underestimate the difficulty.","best_comment_short":"Anyway, I cannot do the difficulty justice so I'll instead just point to past reviews.Lucas is a terrific lecturer in this course and delivers the material with fluency, seeking to build deeper statistical intuition through the material.","best_comment_first":"Arguably Prof. Janson went a bit easier this semester—the midterm and final exams were only two questions, not three.","course_id":"111130","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=43ec9ddfa267896e4c009e18e5dfb1d892e399f6ce7a22897ded322ddc72148b2272d05095783e930b0e395e1dff831a&ReportType=2&regl=en-US"},{"course_code":"EDST 128","useful_title":"Education and Resistance in Community-based Youth Organizations ","course_score_mean":4.71,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.7051,"best_gem_comment":"","workload_score_mean":3.83,"best_gem_comment_short":"","best_comment":"This is genuinely one of the most meaningful courses I have ever taken. Dr. Baldridge is an extremely engaging and intentional instructor, and Christian and Zenzile provided such valuable contributions to our discussions and our learning experience throughout this semester. I would highly recommend taking this course to gain a broad understanding of youth engagement beyond the classroom. I am leaving this course with a much stronger understanding of this field and a toolkit for critical approaches to youth work. I cannot say enough about how well organized and beneficial this course is. Strongly, strongly recommend!","best_comment_short":"I would highly recommend taking this course to gain a broad understanding of youth engagement beyond the classroom.","best_comment_first":"This is genuinely one of the most meaningful courses I have ever taken.","course_id":"220782","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=cac05143d57e09039f1c01e54c51915d7f46e70841b0f17a03c3ea4694b6b96747b5a30b188bdb6426716a3fc293ed74&ReportType=2&regl=en-US"},{"course_code":"WOMGEN 97","useful_title":"Tutorial - Sophomore Year","course_score_mean":4.33,"rec_score_mean":4.22,"gem_score_mean":0.0,"sentiment_score_median":0.856,"best_gem_comment":"","workload_score_mean":4.11,"best_gem_comment_short":"","best_comment":"This class was my favorite! The readings are so interesting, and the discussions are so thought–provoking and make the concepts much easier to understand. You will grow so much in this class in terms of understanding feminist\/gender theory, and you will definitely enjoy it!","best_comment_short":"The readings are so interesting, and the discussions are so thought–provoking and make the concepts much easier to understand.","best_comment_first":"This class was my favorite!","course_id":"120677","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e6d5a89ad7cae6fdf2a9cb4d2ab4f96624895f1376e2857ff78ac4ae6a47ef4af44be85529e81d659a860183110ea4bd&ReportType=2&regl=en-US"},{"course_code":"CHEM 160","useful_title":"The Quantum World","course_score_mean":4.56,"rec_score_mean":4.59,"gem_score_mean":0.0,"sentiment_score_median":0.7955,"best_gem_comment":"","workload_score_mean":5.21,"best_gem_comment_short":"","best_comment":"Not many options for quantum out there but this class was really good. Suyang is amazing and the rest of the teaching staff were also so supportive. The concepts involve a lot of math so be prepared for that but there are so many office hours so help is easy to find. You definitely do not need math 21b to take this, it would be helpful but to worth taking 21b just for this class at all. Physical chem is a scary topic but this class made it super approachable. Grading is also not that bad.","best_comment_short":"The concepts involve a lot of math so be prepared for that but there are so many office hours so help is easy to find.","best_comment_first":"Not many options for quantum out there but this class was really good.","course_id":"112976","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=10cccaaca81855ec0f1062029f9c9b973122719a219549af30c72ab11fca63089984038ce9c7bc9f8659d74e3c990915&ReportType=2&regl=en-US"},{"course_code":"APPHY 195A","useful_title":"Introduction to Solid State Physics","course_score_mean":4.79,"rec_score_mean":4.62,"gem_score_mean":0.0,"sentiment_score_median":0.8968,"best_gem_comment":"","workload_score_mean":7.72,"best_gem_comment_short":"","best_comment":"The lectures are pretty good in general. Prof. Mundy is an experimentalist so she might not be super familiar with some detail but she gave pretty good intuition. Overall, some of the students found the course pretty slow. Some interesting topics like phonons and superconductivity are not introduced in detail. But for most student, I believe the pace is alright. I would recommend it as an intro to the field of condensed matter physics.","best_comment_short":"Prof. Mundy is an experimentalist so she might not be super familiar with some detail but she gave pretty good intuition.","best_comment_first":"The lectures are pretty good in general.","course_id":"131331","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=754a08ab8ca5576888bdf411ff282867f3cc7315fcd5ca4ead87c5121eb997279463ed0d5d4d825bdd6e487c71c05074&ReportType=2&regl=en-US"},{"course_code":"GOV 94EK","useful_title":"Globalization and Private Governance","course_score_mean":5.0,"rec_score_mean":4.83,"gem_score_mean":0.0,"sentiment_score_median":0.8585,"best_gem_comment":"","workload_score_mean":3.55,"best_gem_comment_short":"","best_comment":"I don't know about other seminar courses, but I enjoyed this one. Readings: A bit much, but useful. Later on, when people do presentations, you can do these more optionally, but I'd do them or at least skim them for the experimental design and abstract, as it'll teach you how you might add to the work in your final project. Also, we actually CRITICIZE the readings, which is super huge. Not many courses actually have us read a scientific paper and go: 'wait the experiment is super silly'.Assignments: Super manageable. Presentation and paper along with it do not need to be super long, and the research question and presentation are good milestones so you don't end up waiting till the last second.Project: Professor Hiscox is awesome, and the way the course is designed, you'll find that the part you do a presentation for ends up teaching you about the literature in that field, which then lets you really get into it to figure out your research design.Professor: Awesome, super approachable, has depth of knowledge in field, including practical, is willing to help and accessible and checks in!Class: Very cool, basically a 2 hour discussion. You don't need to be online all the time, as there's enough people to let it kinda flow.","best_comment_short":"Presentation and paper along with it do not need to be super long, and the research question and presentation are good milestones so you don't end up waiting till the last second.Project: Professor Hiscox is awesome, and the way the course is designed, you'll find that the part you do a presentation for ends up teaching you about the literature in that field, which then lets you really get into it to figure out your research design.Professor: Awesome, super approachable, has depth of knowledge in field, including practical, is willing to help and accessible and checks in!Class: Very cool, basically a 2 hour discussion.","best_comment_first":"I don't know about other seminar courses, but I enjoyed this one.","course_id":"125573","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=584d9e767c672acc53655d7f9bcbb374c315bcd667c1eef27e9823419b1af4cef1836784a6d90cb9d0ada6c5df4ad1f5&ReportType=2&regl=en-US"},{"course_code":"EMR 1010","useful_title":"Topics in Latinx Studies Imagining Latinidad","course_score_mean":4.52,"rec_score_mean":4.57,"gem_score_mean":0.0,"sentiment_score_median":0.7939,"best_gem_comment":"","workload_score_mean":4.47,"best_gem_comment_short":"","best_comment":"Take this class! It is pretty low effort and  it allowed me to speak on several topics as a Latina and it allowed me to hear the experiences of my peers as well. There is an amazing selection of media, as Americo mixes academic literature with popular culture making everything super relatable and relevant to our generation. I also enjoy the conversations we are able to foster inside of the classroom. Lastly, there were amazing outside opportunities like 2 guest speakers, a pop up Mariachi Veritas performance, an event with Latinx high school students and a museum visit which really allowed the learning experience to materialize outside of the classroom.  There aren't many assignments for the class, as there are weekly discussion posts, a written take home midterm and a final paper (10–12 pages). It is all doable and there are good resources at hand to help with both the midterm and final.","best_comment_short":"There is an amazing selection of media, as Americo mixes academic literature with popular culture making everything super relatable and relevant to our generation.","best_comment_first":"Take this class!","course_id":"218600","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b09ebf5a828334808ba225d405910b2497fd998c5f51c7cd65473107b0f804423d4f218b791827b5202c054195fbc0a5&ReportType=2&regl=en-US"},{"course_code":"STAT 210","useful_title":"Probability I","course_score_mean":4.51,"rec_score_mean":4.42,"gem_score_mean":0.0,"sentiment_score_median":0.8895,"best_gem_comment":"","workload_score_mean":10.72,"best_gem_comment_short":"","best_comment":"If you liked Stat 110 (especially thinking about different distributions and how they relate to one another), you'll probably also like Stat 210. It's a really interesting continuation of the topics that Stat 110 covers but in greater depth and rigor. Reasoning by representation (e.g, proving results by connecting different distributions) is really powerful and interesting, and the measure theoretic foundation that Stat 210 provides makes probability (at least in my opinion) more intuitive but also more rigorous. Problem sets are fair and interesting, and exams are reasonable (the midterm was fair, and the final felt generous – I know it's been a bit harder in previous years though).Overall, the course feels more like an upper–level undergraduate class compared to a graduate class – both in content and in enrollment. From what I know, for better or for worse, the course differs a bit from other schools' graduate probability classes: it's less focused on measure theory (e.g., spends less time on rigorous constructions of parts of probability) and more focused on providing intuitive results and explanations. It also at times awkwardly balances between doing analysis (e.g., when proving the CLT) and not doing analysis (e.g., handwaving parts of measure theory and MGFs). I'd definitely still recommend taking some form of analysis before this class – the class is definitely doable without it, but Math 25\/55\/112 or equivalent makes the course much more understandable (especially when it comes to topics like CLTs and LLNs). Also, taking Math 114 at the same time as this course is underrated – it makes the measure theory parts of this course so much more understandable, and depending on who teaches Math 114, it'll make the end of that class a whole lot easier too.Last bit because I would've liked to have a review like this when I was looking at the QGuide: I self–studied Stat 110 over the summer by watching the Youtube lectures, doing the psets, and reading the textbook – in the end, I felt really well–prepared for Stat 210, and I think that it was a good move to take Stat 210. I came from a Math 25 background, and even though Stat 210 can be\/sound a little intimidating, it's definitely doable, and if you already know some probability and like analysis, it's a jump worth considering. On the flip side, if your Stat 110 knowledge isn't fairly solid or you're not too confident in basic probability, Stat 210 will be a bit challenging. After a few lectures on measure theory, the class dives into reasoning by representation; if you're shaky on probability distributions, this (large) section and foundation of the course won't be very fun.","best_comment_short":"Also, taking Math 114 at the same time as this course is underrated – it makes the measure theory parts of this course so much more understandable, and depending on who teaches Math 114, it'll make the end of that class a whole lot easier too.Last bit because I would've liked to have a review like this when I was looking at the QGuide: I self–studied Stat 110 over the summer by watching the Youtube lectures, doing the psets, and reading the textbook – in the end, I felt really well–prepared for Stat 210, and I think that it was a good move to take Stat 210.","best_comment_first":"If you liked Stat 110 (especially thinking about different distributions and how they relate to one another), you'll probably also like Stat 210.","course_id":"111696","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4b53dd1d38e663e3a552990b6a0f0aa075335f9bd3c031b2a18fbbf4dece907b173da13ff4b62adcb210e30bc0e37fe7&ReportType=2&regl=en-US"},{"course_code":"HIST 82F","useful_title":"The Origins of the Cold War The Yalta Conference (1945)","course_score_mean":4.43,"rec_score_mean":4.21,"gem_score_mean":0.0,"sentiment_score_median":0.91065,"best_gem_comment":"","workload_score_mean":6.62,"best_gem_comment_short":"","best_comment":"This is a truly fantastic course. I really enjoyed it. A few things to note for the apprehensive prospective student: yes, the readings are a lot. No, they are not boring (I loved doing all of them!) and are quite balanced. Yes, the research will take up your time. But it's something you're interested in, so it should be fun! You will learn a ton about World War II and the post–war order, and you will get to learn from Prof. Plokhii which itself is a very special experience given his depth of expertise. Another note: the course is called \"the origins of the Cold War,\" but there isn't too much Cold War–study going on. It's mostly WWII focused,  but your papers can focus on the early Cold War. All in all, take the course! I had a great experience, it definitely is one of my favorite courses thus far and might be my FAVORITE course","best_comment_short":"I had a great experience, it definitely is one of my favorite courses thus far and might be my FAVORITE course","best_comment_first":"This is a truly fantastic course.","course_id":"124495","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8800822cfb7c14dc09e8e1e9bb349e081a0f5fcfc69898116b07c83609b1f1cf77840143d4aa301854843a2152811fc7&ReportType=2&regl=en-US"},{"course_code":"HISTSCI 3003A","useful_title":"Historiography of the History of Science","course_score_mean":4.89,"rec_score_mean":4.89,"gem_score_mean":0.0,"sentiment_score_median":0.76205,"best_gem_comment":"","workload_score_mean":11.25,"best_gem_comment_short":"","best_comment":"Helpful to get started in history of science; also worthwhile and rewarding to engage with the texts","best_comment_short":"Helpful to get started in history of science; also worthwhile and rewarding to engage with the texts","best_comment_first":"Helpful to get started in history of science; also worthwhile and rewarding to engage with the texts","course_id":"203602","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1a7024505588e80c1a2ac7c50e6d6f2c64c84caffe2855e971f7a1c9afae5bab8b37f68b2b4fd536a3ed09e3c7b61762&ReportType=2&regl=en-US"},{"course_code":"MATH 232A","useful_title":"Introduction to Algebraic Geometry I","course_score_mean":4.59,"rec_score_mean":4.69,"gem_score_mean":0.0,"sentiment_score_median":0.9231,"best_gem_comment":"","workload_score_mean":15.71,"best_gem_comment_short":"","best_comment":"A very tough class (probably the most difficult psets I've ever had) but incredibly rewarding (and Dori and Alice don't make it harder than it has to be). Compelling and enlightening lectures, terrific feedback, outstanding instructor support. If you have the background and the time, I'd recommend in the strongest possible terms.","best_comment_short":"Compelling and enlightening lectures, terrific feedback, outstanding instructor support.","best_comment_first":"A very tough class (probably the most difficult psets I've ever had) but incredibly rewarding (and Dori and Alice don't make it harder than it has to be).","course_id":"123441","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=79cd552e035de50e63ff90e1571209adaadfe1ebf3ee30f5c062cfc6ac4db6614b3d9592d182ba731cfcd7c1fbea2707&ReportType=2&regl=en-US"},{"course_code":"PSY 1950","useful_title":"Intermediate Statistical Analysis in Psychology","course_score_mean":4.53,"rec_score_mean":4.63,"gem_score_mean":0.0,"sentiment_score_median":0.8379,"best_gem_comment":"","workload_score_mean":4.31,"best_gem_comment_short":"","best_comment":"It may be useful for students to take an R focused course prior to learn the platform and then enroll in this course to learn how to apply the knowledge\/use of R in statistical contexts. This course is most helpful if you want to learn how to apply R to data analyses you want to work on for your research, but is really the most helpful when you already know R (e.g., it is not a course focused on training you in R although it provides some information in this regard). I would recommend that students who enter this course choose this because they want to learn applied statistics approaches that happen to involve analyzing data in R, rather than to choose this course as a starting point for learning R for the first time. (However, this comment is given with the caveat that I came into the course already knowing R, but  from my own prior experiences entering similar courses without R training and from what I have heard from those who haven't had prior R training before enrolling in this course, I can imagine that for me it would have been very difficult and incredibly time–consuming involving substantives amount of time (beyond the average\/recommended) to put in to finish problem sets compared to peers who do know). That all being said, this course can be a helpful tool for students ready to engage in independent research to gain the tools to conduct the appropriate data analyses for their work consistent with current statistical and reporting standards for research publication.","best_comment_short":"That all being said, this course can be a helpful tool for students ready to engage in independent research to gain the tools to conduct the appropriate data analyses for their work consistent with current statistical and reporting standards for research publication.","best_comment_first":"It may be useful for students to take an R focused course prior to learn the platform and then enroll in this course to learn how to apply the knowledge\/use of R in statistical contexts.","course_id":"121738","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c74656b7bc9d46f8add26655505f2b2fc83aab239e1386463233ac0c34f9c5c90c72864b84cc984d2f9b90a5040dd610&ReportType=2&regl=en-US"},{"course_code":"CHNSE 130A","useful_title":"Pre-Advanced Modern Chinese","course_score_mean":4.7,"rec_score_mean":4.6,"gem_score_mean":0.0,"sentiment_score_median":0.8173,"best_gem_comment":"","workload_score_mean":7.56,"best_gem_comment_short":"","best_comment":"Def take if you want the citation, similar to 120 but more content, great teachers, would recommend if you want to learn more mandarin and feel more comfortable with the language.","best_comment_short":"Def take if you want the citation, similar to 120 but more content, great teachers, would recommend if you want to learn more mandarin and feel more comfortable with the language.","best_comment_first":"Def take if you want the citation, similar to 120 but more content, great teachers, would recommend if you want to learn more mandarin and feel more comfortable with the language.","course_id":"159629","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9a20a156d4ab6ecd307201743bdf799842584cfb743a2ef2330c7ea9c903c3f7ddc3b0df1fb6b7eac3fc3e757aa7cffd&ReportType=2&regl=en-US"},{"course_code":"IMMUN 315QC","useful_title":"Therapeutic Antibody Engineering – From Bench to Bedside","course_score_mean":4.71,"rec_score_mean":4.71,"gem_score_mean":0.0,"sentiment_score_median":0.7107,"best_gem_comment":"","workload_score_mean":2.57,"best_gem_comment_short":"","best_comment":"Very worthwhile course if you are interested in immunology and the diverse therapeutic applications of antibodies. Awesome papers and discussions.","best_comment_short":"Very worthwhile course if you are interested in immunology and the diverse therapeutic applications of antibodies.","best_comment_first":"Very worthwhile course if you are interested in immunology and the diverse therapeutic applications of antibodies.","course_id":"208013","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=eca91cd26cc8ff95a42637c88065576f9209102dd839306acd6d0701ea808176b31623daa54710328efbf61be13af227&ReportType=2&regl=en-US"},{"course_code":"ESPP 90G","useful_title":"The Law and Policy of Climate Change Influencing Decision Makers","course_score_mean":4.6,"rec_score_mean":4.53,"gem_score_mean":0.0,"sentiment_score_median":0.8407,"best_gem_comment":"","workload_score_mean":4.47,"best_gem_comment_short":"","best_comment":"TAKE THIS COURSE!!! Whether you are pre–law, environmentally oriented, or just have any sort of interest, it is an incredible course taught by an amazing professor. Definitely one of the best courses I have taken at Harvard. Professor Joroff is so kind and willing to help students to learn. Don't be intimidated by the long class, it goes by really quickly and for the rest of the week you're done! assignments aren't heavy nor is the readings so it is a hugely high return class.","best_comment_short":"Professor Joroff is so kind and willing to help students to learn.","best_comment_first":"TAKE THIS COURSE!!!","course_id":"208113","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3aa789fe118cb47e85251ab36bf44f889d4da3bf1599a0099a2f3c3ac3307358edf88d17aa52be944c1a1ebf30bf2fc2&ReportType=2&regl=en-US"},{"course_code":"TDM 143","useful_title":"GAGA Movement","course_score_mean":4.8,"rec_score_mean":4.89,"gem_score_mean":0.0,"sentiment_score_median":0.82265,"best_gem_comment":"","workload_score_mean":0.86,"best_gem_comment_short":"","best_comment":"Gaga dance class was an amazing experience that I would highly recommend to anyone. Despite being a dance class, I found that I learned more in this class than in some of my CS classes. This is likely due to the immersive and hands–on nature of the class, which made it feel like I was really learning in a meaningful way.One of the best things about this class is its convenience and proximity to the quad. It was easy to fit into my schedule and attend regularly, which allowed me to make the most of the class. The workload was also manageable, with only a couple of short assignments to complete in addition to the dancing.Overall, I would say that Gaga dance class is a must–take if you are in the quad area. It is a fun and enjoyable way to learn, and I feel like I came away from the class with a lot of valuable knowledge and skills. So, it is highly recommended to all the students.","best_comment_short":"It is a fun and enjoyable way to learn, and I feel like I came away from the class with a lot of valuable knowledge and skills.","best_comment_first":"Gaga dance class was an amazing experience that I would highly recommend to anyone.","course_id":"204031","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ea4a5e9aa3aa882b01537254bbef90bf9449a788a6420eabb7528ec5fb20863be42e2471f114c199c2a67f5de9743ca7&ReportType=2&regl=en-US"},{"course_code":"SPANSH 80T","useful_title":"Words of Which History is Made Translation Workshop on Modern Spain","course_score_mean":4.92,"rec_score_mean":4.92,"gem_score_mean":0.0,"sentiment_score_median":0.89525,"best_gem_comment":"","workload_score_mean":3.33,"best_gem_comment_short":"","best_comment":"This is a great class to learn about translation! Daniel creates a really fun and dynamic environment, and the reading isn't too much so most of the work you do is only in the class itself. The structure of the class has you on your feet\/working with groups for a lot of it which is fun, and it was cool to learn Spanish in a more technical format like that. This class also teaches you how to find other words\/ways to express yourself in Spanish even if you don't have the exact words that you're thinking of. I would definitely recommend it!!!","best_comment_short":"Daniel creates a really fun and dynamic environment, and the reading isn't too much so most of the work you do is only in the class itself.","best_comment_first":"This is a great class to learn about translation!","course_id":"126860","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a20370f3b9654015eb6cffbd0fc0fb50682c4fd2a7183230469b8d590559f85d9289ce14cde929a8866ace28fbaf50da&ReportType=2&regl=en-US"},{"course_code":"PSY 2660R","useful_title":"Research Seminar in Mindfulness Theory","course_score_mean":4.86,"rec_score_mean":4.71,"gem_score_mean":0.0,"sentiment_score_median":0.8204,"best_gem_comment":"","workload_score_mean":3.57,"best_gem_comment_short":"","best_comment":"Langer is the best. She creates an equal working environment where everyone is encouraged to share their ideas instead of be judged and graded for them.","best_comment_short":"She creates an equal working environment where everyone is encouraged to share their ideas instead of be judged and graded for them.","best_comment_first":"Langer is the best.","course_id":"114362","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b378121675dcac7cadcbe01b499069abe59bc390e8d31068bda8052d568faa506c2262198495972432dbfa993f9327dd&ReportType=2&regl=en-US"},{"course_code":"ANTHRO 3626","useful_title":"Research Design\/Proposal Writing","course_score_mean":4.8,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.6808,"best_gem_comment":"","workload_score_mean":7.5,"best_gem_comment_short":"","best_comment":"Really developed my project (not only in terms of framing, but the content of the project itself), and got to do this in a supportive environment. I also learned a lot about how to have conversations about my own work and others' work, and how to do it in ways that are fruitful and supportive.","best_comment_short":"Really developed my project (not only in terms of framing, but the content of the project itself), and got to do this in a supportive environment.","best_comment_first":"Really developed my project (not only in terms of framing, but the content of the project itself), and got to do this in a supportive environment.","course_id":"116522","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2371865410aa37a2ef95f830a3bc1220276480457a0e65ea3712f81bcef499577e13e36d46cabecddae50b4fe7e5e2bc&ReportType=2&regl=en-US"},{"course_code":"ENG-SCI 157","useful_title":"Biological Signal Processing","course_score_mean":4.78,"rec_score_mean":4.75,"gem_score_mean":0.0,"sentiment_score_median":0.79845,"best_gem_comment":"","workload_score_mean":6.89,"best_gem_comment_short":"","best_comment":"I loved this class.  Prof. Ba is fantastic and is so knowledgeable and just very fun to learn from in the classroom.  His structure of splitting the class with a break in the middle makes it so much easier to digest lecture, and the time flew by during this class period every time surprisingly quickly.  The material is engaging, it isn't easy given the higher level concepts, but it definitely is doable alongside other difficult classes.  The weekly work felt a little relentless possibly because OH were scheduled right before the work was due most of the time, so we all ended up cramming a lot of the work into the day before due dates, but the grading is nice, and getting an A is certainly not out of reach for most people. Just pay attention in class, don't get distracted on your computer, go to section, and take advantage of the time with the great course staff! Shubham, Manos, and Demba are gems and this class was fantastic.  Sometimes the psets got a little disorienting because it felt like we had never seen the material before, but looking back, they were so helpful in seeing how the concepts are applied.  Although it sometimes felt like the psets weren't aligned with the lecture schedule.  Review your linear algebra before coming in.  And your derivatives and series knowledge!","best_comment_short":"Prof. Ba is fantastic and is so knowledgeable and just very fun to learn from in the classroom.","best_comment_first":"I loved this class.","course_id":"109358","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=39b30518af41deb9988c8b0b5649712c4f55bc41f94d04e9ac946f1ab158918f83e255cb2f428021ef06713f84396944&ReportType=2&regl=en-US"},{"course_code":"EXPOS 40","useful_title":"Public Speaking Practicum","course_score_mean":4.73,"rec_score_mean":4.91,"gem_score_mean":0.0,"sentiment_score_median":0.7707,"best_gem_comment":"","workload_score_mean":4.64,"best_gem_comment_short":"","best_comment":"TAKE THIS COURSE!!! I know you guys see a bunch of comments like this, but Nick was a fantastic preceptor who cares about his students. The class community is amazing, and you honestly become a much better public speaker.","best_comment_short":"I know you guys see a bunch of comments like this, but Nick was a fantastic preceptor who cares about his students.","best_comment_first":"TAKE THIS COURSE!!!","course_id":"125227","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0e1356bc679a8ff109d2fc0698f7581bb92b7a92ff7363a74808c12b48f5cf6388476126f820e2525bfcf91cf6b146f0&ReportType=2&regl=en-US"},{"course_code":"MUSIC 107","useful_title":"Advanced Ensembles","course_score_mean":4.38,"rec_score_mean":4.75,"gem_score_mean":0.0,"sentiment_score_median":0.74425,"best_gem_comment":"","workload_score_mean":3.67,"best_gem_comment_short":"","best_comment":"The pieces we work on can be difficult, but there are so many people willing to help you, and the concerts are always so rewarding","best_comment_short":"The pieces we work on can be difficult, but there are so many people willing to help you, and the concerts are always so rewarding","best_comment_first":"The pieces we work on can be difficult, but there are so many people willing to help you, and the concerts are always so rewarding","course_id":"220622","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=97ef804253a2e6588e0c3aea5c1baa2f851816cd758d96637da6686cbe41f48a89c815b77da7dd2e27cad0ed925e4760&ReportType=2&regl=en-US"},{"course_code":"COMPSCI 229R","useful_title":"Topics in Theoretical Computer Science Essential Coding Theory","course_score_mean":4.48,"rec_score_mean":4.27,"gem_score_mean":0.0,"sentiment_score_median":0.76045,"best_gem_comment":"","workload_score_mean":10.27,"best_gem_comment_short":"","best_comment":"TAKE ANYTHING THAT MADHU TEACHES! That's it. Amazing lecturer, amazing person, just incredible. Madhu is exactly what a professor should be: extremely knowledgeable,  brilliant lecturer, kind to the student, and cares deeply about educating the next generation. I admire him for being a true leader in the theory CS community, and for the amount of care that he puts into making sure that theory CS is a welcoming space for everyone. A lot of male professors will use empty words and say that they care about gender diversity; but in practice, they do nothing and continue to alienate minorities from their fields. But Madhu, unlike most of these professors, actually takes action: he makes sure everyone is comfortable in class, he encourages questions from the students, he always responds to these questions with a smile even if they are elementary, and it was so fun to go to his office hours. I always looked forward going to class and I only wished they lasted longer! I wish I could take so many more classes with Madhu –– he is such an inspiration and someone I really look up to. He always generated enthusiasm for the class material and it made me so excited about continuing to study theory CS. Thanks for everything! You really are bringing change to the next generation of computer scientists.","best_comment_short":"But Madhu, unlike most of these professors, actually takes action: he makes sure everyone is comfortable in class, he encourages questions from the students, he always responds to these questions with a smile even if they are elementary, and it was so fun to go to his office hours.","best_comment_first":"TAKE ANYTHING THAT MADHU TEACHES!","course_id":"120237","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a7043b13ebb37704b77b097cb2be72a72744b3318dc32b03c23e11fd93435d763b84b97a0d0b54d66d21f5365e96aa38&ReportType=2&regl=en-US"},{"course_code":"COMPLIT 119X","useful_title":"History of the Book Using Harvard's Treasures to Study the Material Text","course_score_mean":4.89,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.79385,"best_gem_comment":"","workload_score_mean":5.5,"best_gem_comment_short":"","best_comment":"Take this class!! If you're looking for a unique Harvard educational experience, it does not get any better. You get to touch and engage with really rare and fascinating materials (obviously the Gutenberg Bible, but also stuff like Shakespeare's first folio, ancient scrolls, Renaissance scientific books, etc.), and learn to see them with new eyes. The class itself is laid back but if you engage with the materials and take advantage of your time in the rare books library, you'll get a really meaningful experience out of it. Also, our class really bonded and even hung out outside of class, which I think goes to show how Professor Stern does a great job of building community.","best_comment_short":"The class itself is laid back but if you engage with the materials and take advantage of your time in the rare books library, you'll get a really meaningful experience out of it.","best_comment_first":"Take this class!!","course_id":"220266","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f65139407786695900bb2498ff0b6b4fd3d596eb02dc88d4d9275b1930de64380928c24c3c380cac060833862055a5f4&ReportType=2&regl=en-US"},{"course_code":"NEC 107","useful_title":"The History of the Book Using Harvard's Greatest Treasures to Study the Material Text","course_score_mean":4.89,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.79385,"best_gem_comment":"","workload_score_mean":5.5,"best_gem_comment_short":"","best_comment":"Take this class!! If you're looking for a unique Harvard educational experience, it does not get any better. You get to touch and engage with really rare and fascinating materials (obviously the Gutenberg Bible, but also stuff like Shakespeare's first folio, ancient scrolls, Renaissance scientific books, etc.), and learn to see them with new eyes. The class itself is laid back but if you engage with the materials and take advantage of your time in the rare books library, you'll get a really meaningful experience out of it. Also, our class really bonded and even hung out outside of class, which I think goes to show how Professor Stern does a great job of building community.","best_comment_short":"The class itself is laid back but if you engage with the materials and take advantage of your time in the rare books library, you'll get a really meaningful experience out of it.","best_comment_first":"Take this class!!","course_id":"219718","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f65139407786695900bb2498ff0b6b4fd3d596eb02dc88d4d9275b1930de64380928c24c3c380cac060833862055a5f4&ReportType=2&regl=en-US"},{"course_code":"ANTHRO 99A","useful_title":"Thesis Tutorial in Anthropology - Senior Year","course_score_mean":4.57,"rec_score_mean":4.7,"gem_score_mean":0.0,"sentiment_score_median":0.70415,"best_gem_comment":"","workload_score_mean":7.25,"best_gem_comment_short":"","best_comment":"This is required, of course, but it is genuinely helpful! It's great to hear feedback from your peers on your writing and you become pretty familiar with each others' projects. It is stressful to produce 8 pages in two weeks as the course makes you do sometimes for the biweekly meetings (and let's be real we cram it last minute) but it is so helpful for progress on the thesis. You'll live! Pretty fair thesis tutorial compared to other departments.","best_comment_short":"It is stressful to produce 8 pages in two weeks as the course makes you do sometimes for the biweekly meetings (and let's be real we cram it last minute) but it is so helpful for progress on the thesis.","best_comment_first":"This is required, of course, but it is genuinely helpful!","course_id":"205184","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=287988da6fd67d168056fafd6a94b3b229584f1daee07d10775edfe18d6992396692ed8948ca00aeff16bb61b5330ba3&ReportType=2&regl=en-US"},{"course_code":"HIND-URD 101A","useful_title":"Introductory Hindi-Urdu","course_score_mean":4.69,"rec_score_mean":4.88,"gem_score_mean":0.0,"sentiment_score_median":0.84355,"best_gem_comment":"","workload_score_mean":3.73,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS! Richard ji is enthusiastic, funny, and a great instructor. He makes sure that everyone is comfortable with the material and you will learn so much in just a semester. I found myself looking forward to Hindi class every day because I knew I'd be able to relax, laugh, and learn about my culture.","best_comment_short":"Richard ji is enthusiastic, funny, and a great instructor.","best_comment_first":"TAKE THIS CLASS!","course_id":"113639","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d2bd4b82e772a896718816e4b33c425b0331147da1a01660889bb2e38b417a1009b177895f81b2387b2fa07dcbb66d1d&ReportType=2&regl=en-US"},{"course_code":"SCRB 111","useful_title":"Regeneration Phenomena to Mechanisms","course_score_mean":4.43,"rec_score_mean":4.35,"gem_score_mean":0.0,"sentiment_score_median":0.8517,"best_gem_comment":"","workload_score_mean":3.32,"best_gem_comment_short":"","best_comment":"Take this class! It's honestly been one of my favorite courses I've taken at Harvard (I'm a senior).  Dr Whited is so enthusiastic and is a wonderful person –– she conveys her excitement for regeneration so well, and all the discussions were fascinating. I learned so much about regeneration. It's really interesting to think about the role of the immune system and nerve cells, as well as signaling proteins in inducing regeneration. I also liked that the course encompassed a fair amount of biodiversity (planarians, axolotls, newts, lizards, stick insects, frogs, mice, zebrafish...), and discussed different strategies of regeneration that these organisms have, as well as similarities across distantly related species. I found the discussions to be really thought–provoking and I've been recommending this class to all my friends.","best_comment_short":"Dr Whited is so enthusiastic and is a wonderful person –– she conveys her excitement for regeneration so well, and all the discussions were fascinating.","best_comment_first":"Take this class!","course_id":"212688","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=29352d15957cc9f9f231b07f1a431ea0b0322b27107e2256103151f557fe1e37439b5919fc4d9bd70d7a1c98b8d5d736&ReportType=2&regl=en-US"},{"course_code":"WOMGEN 1217","useful_title":"Psychology of the Gendered Body","course_score_mean":4.31,"rec_score_mean":4.23,"gem_score_mean":0.0,"sentiment_score_median":0.8961,"best_gem_comment":"","workload_score_mean":3.92,"best_gem_comment_short":"","best_comment":"This class is amazing and so is Dr. Noll. Take this class if you are at all interested in how gender comes to be, how gender can be performed, how gender can be embodied, and anything relating to development, consciousness, the brain, and the body. Conversations can get meta, but that is part of the fun, and you will learn so much and think differently as a result of this class! It is a great environment. Take it!","best_comment_short":"Conversations can get meta, but that is part of the fun, and you will learn so much and think differently as a result of this class!","best_comment_first":"This class is amazing and so is Dr. Noll.","course_id":"205489","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7c4f8bbebfe971785c990a8a9a2eaacc919513a2b4f0cc29ee365785dbbb2e9dbc648b53890aa0137bbe1ceb4e1cc3f5&ReportType=2&regl=en-US"},{"course_code":"EXPOS 10","useful_title":"Introduction to Expository Writing","course_score_mean":4.71,"rec_score_mean":4.71,"gem_score_mean":0.0,"sentiment_score_median":0.8193,"best_gem_comment":"","workload_score_mean":5.43,"best_gem_comment_short":"","best_comment":"I was personally not looking forward to Expos but this class ended up being my favorite of the semester. Felt like I had loads of fun while also learning so much. Dr. Hanes is an absolutely amazing professor.","best_comment_short":"Felt like I had loads of fun while also learning so much.","best_comment_first":"I was personally not looking forward to Expos but this class ended up being my favorite of the semester.","course_id":"118262","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=33dbb128045d3d5f85d5c3849719132cb6a7173b3d18906c06f30613cac52c8cdf21891cddc88833fcfb5b447ba5f12a&ReportType=2&regl=en-US"},{"course_code":"AFRAMER 11","useful_title":"Introduction to African Studies","course_score_mean":4.62,"rec_score_mean":4.54,"gem_score_mean":0.0,"sentiment_score_median":0.7223,"best_gem_comment":"","workload_score_mean":4.92,"best_gem_comment_short":"","best_comment":"This class is great as an introduction to contemporary Africa. I took it to learn more about the continent and it sure was one great class. The conversations were so engaging, and the class was relatively like a seminar class and I felt included in all the conversations. Some of the  discussions were really eye–opening and I just can't emphasize how much my perspectives of the African content have been shaped. For those wondering about the workload, don't even think about it. It's really manageable. Just make sure you do your readings ahead of time and prepare a few points for discussions in class. The rest is a smooth ride back home!","best_comment_short":"I took it to learn more about the continent and it sure was one great class.","best_comment_first":"This class is great as an introduction to contemporary Africa.","course_id":"123591","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b2599b5651407aa017df7078d3d5f9dbb03fa8bd812fc661a4f6849fe24989659e7cee22769b84e2502d5855381b6227&ReportType=2&regl=en-US"},{"course_code":"COMPSCI 249R","useful_title":"Tiny Machine Learning","course_score_mean":4.35,"rec_score_mean":4.35,"gem_score_mean":0.0,"sentiment_score_median":0.81435,"best_gem_comment":"","workload_score_mean":7.5,"best_gem_comment_short":"","best_comment":"The class is very instructive and entertaining. You will get out of the class as much as you put in, so make sure you choose a project that you are passionate about and start working on it early.","best_comment_short":"You will get out of the class as much as you put in, so make sure you choose a project that you are passionate about and start working on it early.","best_comment_first":"The class is very instructive and entertaining.","course_id":"212687","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=36e49c24557dc648b74c9abeab23439b5d89f5a684766e7ecce9f03d1d3d2a7a625cfec7742b9ebadad4199fd3968696&ReportType=2&regl=en-US"},{"course_code":"ARABIC 243BR","useful_title":"Introduction to the Rational Sciences","course_score_mean":4.57,"rec_score_mean":4.57,"gem_score_mean":0.0,"sentiment_score_median":0.6648,"best_gem_comment":"","workload_score_mean":8.71,"best_gem_comment_short":"","best_comment":"This is one of the best ways to improve your classical Arabic past \"Upper–level\" and Prof. El–Rouayheb is extremely good at accommodating different students' goals.","best_comment_short":"This is one of the best ways to improve your classical Arabic past \"Upper–level\" and Prof. El–Rouayheb is extremely good at accommodating different students' goals.","best_comment_first":"This is one of the best ways to improve your classical Arabic past \"Upper–level\" and Prof. El–Rouayheb is extremely good at accommodating different students' goals.","course_id":"109802","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2144b2dc816942519d9691578fd4de90839186e8d318368e9f5e9b86277efcfe1d52f20a601cad1bd206cf7135d2f61c&ReportType=2&regl=en-US"},{"course_code":"WOMGEN 1310","useful_title":"Transgender Rights and the Law Assumptions and Critiques","course_score_mean":4.82,"rec_score_mean":4.91,"gem_score_mean":0.0,"sentiment_score_median":0.6892,"best_gem_comment":"","workload_score_mean":5.0,"best_gem_comment_short":"","best_comment":"This class was incredible!!! I was in a community of trans people in an academic setting for the first time ever and it was the most rewarding experience. Kendra is a very knowledgeable and supportive professor, and they are very approachable. I had a great time in this class and learned so much.","best_comment_short":"I had a great time in this class and learned so much.","best_comment_first":"This class was incredible!!!","course_id":"216115","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6542082f967e3284d63a91fecd3426fef6a1862a79b4abf60be35a5486adeb43fd753f8d744ded1281931e52cd00e9bc&ReportType=2&regl=en-US"},{"course_code":"LING 116","useful_title":"Semantic Theory I","course_score_mean":4.78,"rec_score_mean":4.75,"gem_score_mean":0.0,"sentiment_score_median":0.6439,"best_gem_comment":"","workload_score_mean":5.56,"best_gem_comment_short":"","best_comment":"take this course if you’re interested! definitely have some background, but this course was really nice!","best_comment_short":"definitely have some background, but this course was really nice!","best_comment_first":"take this course if you’re interested!","course_id":"122515","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d7f33fe3a59bafcba2ba17672f8a23c6641816cb9feb6c03fe30f09916e04c27c2b1887aa10e184e200d3a90eb658679&ReportType=2&regl=en-US"},{"course_code":"ROM-LANG 310","useful_title":"Article Publication Workshop","course_score_mean":4.67,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.7495,"best_gem_comment":"","workload_score_mean":4.5,"best_gem_comment_short":"","best_comment":"Prof. Kim is one of the most generous and sharp readers that I have encountered throughout the Phd. She is a really fantastic professor and her course teaches crucial lessons for everyone who wants to follow an academic career.","best_comment_short":"She is a really fantastic professor and her course teaches crucial lessons for everyone who wants to follow an academic career.","best_comment_first":"Prof. Kim is one of the most generous and sharp readers that I have encountered throughout the Phd.","course_id":"212926","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=75adc9063ca75ef2dfabbe30cc3064efc63cc68c932eaa34892c4b753b94dc84cfa13e7274e155e6ef9050fc0e1969ac&ReportType=2&regl=en-US"},{"course_code":"SOC-STD 98VG","useful_title":"Capitalism, Subjectivity, and the \"Entrepreneurial Self\"","course_score_mean":4.44,"rec_score_mean":4.44,"gem_score_mean":0.0,"sentiment_score_median":0.77315,"best_gem_comment":"","workload_score_mean":6.11,"best_gem_comment_short":"","best_comment":"This class (or any future class that Tracey is teaching) is objectively very good! Tracey is the goat fr fr, she straight up does not miss. If you’re like me, then this class is going to go from very good to phenomenal. If you aren’t (totally fine!), it might go to good.This class is very theory heavy while still being grounded. There’s a lot of psychoanalysis, a lot of neoliberalism, some marx, a good amount of sociological theory, etc… Im very theory pilled, so I loved the readings, but if you aren’t, it might not be the class for you BUT at the same time Tracey helps orient theoretical discussions around the actual happenings of the world, which keeps things grounded and present. I don’t mean to make it sound all theory (it really isn’t!!!), but it’s definitely the most theoretical class I’ve had that still ostensibly about ethnographies and studying particular societal trends.The class is about entrepreneurialism in the loosest of senses. We read about entrepreneurialism in the first week, then we never really discussed it again (which I honestly didn’t mind one bit.) It’s really a class about identity formation under capitalism. And, as mentioned, it is also very theoretical, so ideally for people who like theory and like Freud, Foucault, Butler, etc… I will also say that though the more theoretical texts DO connect with the more ethnographic readings (which come mainly in the second half) the connections are not always explicitly drawn. My personal only real complaint is that in class presentations from other students were quite long. TLDR; Tracey is a great great teacher, if you like studying theory, psychoanalysis, identity formation, and capitalism as not just an economic system, it’ll probably be a GOAT class, if you don’t, probably still quite good, but know what you’re getting into.","best_comment_short":"And, as mentioned, it is also very theoretical, so ideally for people who like theory and like Freud, Foucault, Butler, etc… I will also say that though the more theoretical texts DO connect with the more ethnographic readings (which come mainly in the second half) the connections are not always explicitly drawn.","best_comment_first":"This class (or any future class that Tracey is teaching) is objectively very good!","course_id":"220409","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=11971f01d5c15736074ee396aad46ba8390edfafc8f1888f13749b5b120edc651fa87fce4777c0bee34888dec8292b90&ReportType=2&regl=en-US"},{"course_code":"WSTAFRCN AA","useful_title":"Elementary West African Pidgin","course_score_mean":4.14,"rec_score_mean":4.64,"gem_score_mean":0.0,"sentiment_score_median":0.7177,"best_gem_comment":"","workload_score_mean":2.77,"best_gem_comment_short":"","best_comment":"I highly recommend this course! This year, it was taught by Grace A. and she's great. Learned so much about a fascinating language, 10\/10","best_comment_short":"This year, it was taught by Grace A. and she's great.","best_comment_first":"I highly recommend this course!","course_id":"204110","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c4bc5a79b2d4f0d9e190ef9b2df8b890f4d9e86103f697e393b78d86f2e6d08f86f824c2472ea013600828c66f2f8fcd&ReportType=2&regl=en-US"},{"course_code":"ECON 10B","useful_title":"Principles of Economics (Macroeconomics)","course_score_mean":4.43,"rec_score_mean":4.47,"gem_score_mean":0.0,"sentiment_score_median":0.805,"best_gem_comment":"","workload_score_mean":4.5,"best_gem_comment_short":"","best_comment":"Take this class! I think it's a very different experience to take ECON 10B off–cycle, when there are just a few dozen students and not hundreds of students. You can get a lot more individualized attention and ask questions in lecture, and it feels like a really nice community. I also think it's important to know that you don't need a background in micro in order to take macro. Maybe it would make things a little easier to have taken an economics class before, but I thought this was totally manageable without micro, so I wish someone had assured me of that earlier so I didn't have to worry about it.Overall, I had a really wonderful experience in this class! Understanding macro even at a basic level makes me feel so much stronger. If you take this class, you actually understand at an intuitive level how the labor market works, and what it actually means when someone says the dollar's getting stronger, and how the Fed will fight inflation, and why some countries are so much richer than others. I feel like I have a much more granular and thoughtful understanding of the world now. Also, if Andres is teaching it again, then definitely take it, because he's so knowledgeable and funny and cares about his students a lot! I'm really glad I took this class, I really couldn't recommend it more highly.","best_comment_short":"Maybe it would make things a little easier to have taken an economics class before, but I thought this was totally manageable without micro, so I wish someone had assured me of that earlier so I didn't have to worry about it.Overall, I had a really wonderful experience in this class!","best_comment_first":"Take this class!","course_id":"109894","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c900932b43555cfefbb532f4de0e23bd5536b5ff4a33dca3fc8ba1719fb0109f1f336ebf7f692f516920b9fbb1978d58&ReportType=2&regl=en-US"},{"course_code":"PORTUG 20","useful_title":"Intermediate Portuguese I Justice, Equity and Rights in the Lusophone world","course_score_mean":4.88,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.6696,"best_gem_comment":"","workload_score_mean":5.25,"best_gem_comment_short":"","best_comment":"Cris is an incredible professor –– definitely the kind of professor you will remember fondly years after taking this course. She teaches with so much enthusiasm and passion that it is difficult not to fall in love with Portuguese. The social issues and speakers that make up this course make it an academically enriching experience, but Cris makes it an enjoyable course.","best_comment_short":"She teaches with so much enthusiasm and passion that it is difficult not to fall in love with Portuguese.","best_comment_first":"Cris is an incredible professor –– definitely the kind of professor you will remember fondly years after taking this course.","course_id":"121934","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8b49ff700fc1a57161f3af6826bf0f1899498bbe30d5dd96469658e4d84e62501bff6afca2f5c1f4ec90e2d7bb2d0e5d&ReportType=2&regl=en-US"},{"course_code":"EXPOS 40","useful_title":"Public Speaking Practicum","course_score_mean":4.58,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":0.76375,"best_gem_comment":"","workload_score_mean":3.42,"best_gem_comment_short":"","best_comment":"Take this class! Even if you hate public speaking. It's a very safe environment to practice and become more comfortable public speaking. You get to know your classmates pretty well so you feel comfortable speaking in front of them and receiving feedback from them. I definitely feel more comfortable public speaking and I learned a lot of techniques for speaking outside of public speaking, like how to network and how to answer common job interview questions.","best_comment_short":"You get to know your classmates pretty well so you feel comfortable speaking in front of them and receiving feedback from them.","best_comment_first":"Take this class!","course_id":"125227","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=868203d1f9b896b96849c27779be8bc42f7be921cdd695d703c078a41d6c247ade3b5257870049a1391736decfed8e9c&ReportType=2&regl=en-US"},{"course_code":"SOCIOL 97","useful_title":"Tutorial in Sociological Theory","course_score_mean":4.56,"rec_score_mean":4.32,"gem_score_mean":0.0,"sentiment_score_median":0.82845,"best_gem_comment":"","workload_score_mean":6.83,"best_gem_comment_short":"","best_comment":"If you're interesting in sociological canon, take this course! I took this since it was a requirement, but even as someone not necessarily interested in canon, this was really interesting! I definitely had an overall positive experience because of the professor, Dr. Dromi. I know someone who took this with someone else and they didn't have a good time. HOWEVER, if this is being taught by Dr. Dromi, take it!!! He's an amazing professor and such a nice person. The way he structured this course was amazing and I learned a lot without feeling too overwhelmed. This course is also really section–heavy, so I'd recommend trying to get someone who seems nice. My TF was Zehra and she's such a gem. She's genuinely so so kind and an overall interesting person. She really looks out for you and clarifies things really well. I also don't think she was a difficult grader (not super easy, but pretty medium leaning towards easier). I heard some not great things about Emma, so just be wary there. I also know someone who had John when the professor was not Dr. Dromi and he was apparently really not great + when some people I knew interacted with him this semester (he was the head TF), they had not great experiences as well. The workload is all right though there can be a lot of readings. More generally though, you just have to complete a certain number of weekly posts, make a group presentation for a book, and write the midterm + final papers. Overall, I would recommend this course!! Dr. Dromi makes it really worth it and as long as you like your TF in the end, it'll be a good time","best_comment_short":"She's genuinely so so kind and an overall interesting person.","best_comment_first":"If you're interesting in sociological canon, take this course!","course_id":"115130","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1d560bea29df1d0ac1e562c504f813d8c30261877f61ee5d4b9f5103bce9fedcbfdd5c98cdfa47ceafcd6f32e78dd6bb&ReportType=2&regl=en-US"},{"course_code":"LATIN 3","useful_title":"Introductory Latin 3","course_score_mean":4.7,"rec_score_mean":4.56,"gem_score_mean":0.0,"sentiment_score_median":0.69555,"best_gem_comment":"","workload_score_mean":3.1,"best_gem_comment_short":"","best_comment":"Like any language class, it takes work, but it's worth it! I'm sure that this is probably a class that varies based on who is instructing and in the class each semester . . . but we were blessed with the best group of people. It made coming to class a highlight of the day.","best_comment_short":"but we were blessed with the best group of people.","best_comment_first":"Like any language class, it takes work, but it's worth it!","course_id":"203227","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7673915667fc3f2214cdd4ef0058cc833ee014347cf1166469720519d98dc6159414315038d4a503bacf0e84f0e7ab39&ReportType=2&regl=en-US"},{"course_code":"ECON 2340","useful_title":"Spatial Mobility and Development Evidence and Quantitative Models","course_score_mean":4.85,"rec_score_mean":4.85,"gem_score_mean":0.0,"sentiment_score_median":0.80605,"best_gem_comment":"","workload_score_mean":7.62,"best_gem_comment_short":"","best_comment":"1. If you are interested in any development related topics, including transportation, schooling, immigration, climate adaptation infrastructure, etc., this course  covers frontier research in these topics in a spatial setting. 2. You can learn how to build structural models, how to estimate them, how to conduct empirical analyses, and how to use GIS models, some useful math\/modelling tricks. Very worthwhile!3. The instructor (Gabriel) and the TF (Tilman) teach well–organized materials very clearly. 4. I feel the course is very inspiring.","best_comment_short":"I feel the course is very inspiring.","best_comment_first":"1.","course_id":"215901","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2e3af0ec5524733f7aa52652fef15a95ad3cae1373b02069b5585f5957a356ecc11091f77e06cd3ec185591227e06634&ReportType=2&regl=en-US"},{"course_code":"MATH MA","useful_title":"Introduction to Functions and Calculus I","course_score_mean":4.73,"rec_score_mean":4.55,"gem_score_mean":0.0,"sentiment_score_median":0.6428,"best_gem_comment":"","workload_score_mean":8.3,"best_gem_comment_short":"","best_comment":"Take this class! It goes by slow so you can take in more information at a time but has an incredible department that are super willing to help!","best_comment_short":"It goes by slow so you can take in more information at a time but has an incredible department that are super willing to help!","best_comment_first":"Take this class!","course_id":"111161","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2f224e87ae59016c0cdf43a6f5e50f7e4548093f45af23cc09a7f35a714248eef8c582b2fb05dfef5538fd1098ca1abe&ReportType=2&regl=en-US"},{"course_code":"MUSIC 10","useful_title":"Harvard-Radcliffe Orchestra","course_score_mean":4.61,"rec_score_mean":4.47,"gem_score_mean":0.0,"sentiment_score_median":0.65835,"best_gem_comment":"","workload_score_mean":5.77,"best_gem_comment_short":"","best_comment":"Definitey join HRO! Although it can be a bit of a time commitment, the community is awesome and music making level is very high!","best_comment_short":"Although it can be a bit of a time commitment, the community is awesome and music making level is very high!","best_comment_first":"Definitey join HRO!","course_id":"110112","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=403d22dbac641bdc91d49004dacddc7e94d0112f3487ac64ded3a07d36982ded3a49b90bb0bf8c2b1788d0862e71034d&ReportType=2&regl=en-US"},{"course_code":"BCS CR","useful_title":"Advanced Bosnian, Croatian, and Serbian","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.6178,"best_gem_comment":"","workload_score_mean":3.6,"best_gem_comment_short":"","best_comment":"Tatiana Kuzmic is incredible! The Slavic Department is incredibly lucky to have her. She's been my professor for three years now, and her class is genuinely a highlight of my semester!","best_comment_short":"The Slavic Department is incredibly lucky to have her.","best_comment_first":"Tatiana Kuzmic is incredible!","course_id":"110075","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=cb7738253654db2787d50bee604cf4dcc09a18e7ef0b0efa1de88fd5c616f7136741f5285a0f33118667c02a58cea29f&ReportType=2&regl=en-US"},{"course_code":"LING 73A","useful_title":"Beginning American Sign Language I","course_score_mean":4.72,"rec_score_mean":4.72,"gem_score_mean":0.0,"sentiment_score_median":0.7579,"best_gem_comment":"","workload_score_mean":3.18,"best_gem_comment_short":"","best_comment":"This was my favorite course this semester by a long shot.  There are a few things that played into this being such a great course.  First off, Andrew Bottoms is a fantastic teacher.  He is kind, funny, informative, and never makes you feel bad for making mistakes.  With ASL being new to most students in the class,  Andrew fostered a positive culture around taking risks and having fun.  This course is not a major time suck at all.  Homework never took more than 3 hours in a week other than preparing our final presentation.  Tests are all reasonable, and if you pay attention in class and review a bit you'll find success.  I never found myself stressed  over this class.  I will say that Andrew can be slow to give feedback on videos or emails, so just know that going into the course.  In person, however, Andrew loves getting to know students and helping them dive deeper into ASL.","best_comment_short":"There are a few things that played into this being such a great course.","best_comment_first":"This was my favorite course this semester by a long shot.","course_id":"203507","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=54aa2e21ad37d044adaab8ae30837cbac662f8d5ca65096e08cbb897bea05fa34e98d33f24df6288ea1daa6a07f05571&ReportType=2&regl=en-US"},{"course_code":"BCMP 218","useful_title":"Molecular Medicine","course_score_mean":4.69,"rec_score_mean":4.88,"gem_score_mean":0.0,"sentiment_score_median":0.6249,"best_gem_comment":"","workload_score_mean":2.87,"best_gem_comment_short":"","best_comment":"This class is amazing as someone who is passionate about medicine, either pre–med or from a research standpoint. As an undergraduate, I definitely was out of my depth several times in a class geared more towards graduate students, but the course does a good job of bridging gaps in knowledge as long as you're passionate about the subject material and willing to be diligent with reading the papers.","best_comment_short":"As an undergraduate, I definitely was out of my depth several times in a class geared more towards graduate students, but the course does a good job of bridging gaps in knowledge as long as you're passionate about the subject material and willing to be diligent with reading the papers.","best_comment_first":"This class is amazing as someone who is passionate about medicine, either pre–med or from a research standpoint.","course_id":"122596","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ae4cf658ca6490cf949865c6c526b16d67327c3de2e14f210bd57ac5c2178492e85952c1f3cb8cbb0914d1e9e5f33264&ReportType=2&regl=en-US"},{"course_code":"AFVS 40H","useful_title":"Introduction to Still Photography","course_score_mean":4.75,"rec_score_mean":4.63,"gem_score_mean":0.0,"sentiment_score_median":0.67075,"best_gem_comment":"","workload_score_mean":4.75,"best_gem_comment_short":"","best_comment":"I HIGHLY recommend taking this course if you have any interest. Regardless of what you typically study, it's worth the adventure! The class has a wonderful environment, incredibly fun assignments, and also teaches a ton about how to look at the world, and about the world of photography in general. The professor is amazing, as well as Navid \/ the course TFs! Everyone is so kind and willing to learn!","best_comment_short":"The class has a wonderful environment, incredibly fun assignments, and also teaches a ton about how to look at the world, and about the world of photography in general.","best_comment_first":"I HIGHLY recommend taking this course if you have any interest.","course_id":"220429","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c89f4fd5d2e0ddf101dfaa32d7f3ec440b04a28783a9f835d6d7b15a4a336d4d4cc36bddf022f1116ab596087eb2f509&ReportType=2&regl=en-US"},{"course_code":"CELLBIO 306QC","useful_title":"Teaching 100 The Theory and Science of Teaching","course_score_mean":4.78,"rec_score_mean":4.83,"gem_score_mean":0.0,"sentiment_score_median":0.7,"best_gem_comment":"","workload_score_mean":5.71,"best_gem_comment_short":"","best_comment":"This is a great course to take if you are interested in pedagogy. You get to read many pieces of primary literature on education studies and see the data of the studies behind various pedagogical practices. Tari is an excellent instructor who presents the material in an easy–to–digest manner while simultaneously promoting lots of active discussion among the class. Tari made the classroom environment very welcoming which helped students feel comfortable speaking up.","best_comment_short":"Tari is an excellent instructor who presents the material in an easy–to–digest manner while simultaneously promoting lots of active discussion among the class.","best_comment_first":"This is a great course to take if you are interested in pedagogy.","course_id":"107400","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=63fee478fcc29d80caa340dbc9e4a711f2414caed387057062c78cc8e516aa4a8787999664aeaa5df38cef55a63dedc5&ReportType=2&regl=en-US"},{"course_code":"JAPAN 130A","useful_title":"Intermediate Japanese II","course_score_mean":5.0,"rec_score_mean":4.71,"gem_score_mean":0.0,"sentiment_score_median":0.6078,"best_gem_comment":"","workload_score_mean":10.71,"best_gem_comment_short":"","best_comment":"Yagi sensei is a bit quieter than the other senseis, but definitely the nicest :–)","best_comment_short":"Yagi sensei is a bit quieter than the other senseis, but definitely the nicest :–)","best_comment_first":"Yagi sensei is a bit quieter than the other senseis, but definitely the nicest :–)","course_id":"114292","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e4d7c0a48d09618a8cb0bae66f48ced7ba9805c84bd23adeccf3517947fe6ea0c245ddcf765b4aff948a34a55b37032d&ReportType=2&regl=en-US"},{"course_code":"ECON 2110","useful_title":"Econometrics I","course_score_mean":4.53,"rec_score_mean":4.47,"gem_score_mean":0.0,"sentiment_score_median":0.56755,"best_gem_comment":"","workload_score_mean":10.27,"best_gem_comment_short":"","best_comment":"Great course for a quant requirement, not too technical, so I think it's useful for most social sciences","best_comment_short":"Great course for a quant requirement, not too technical, so I think it's useful for most social sciences","best_comment_first":"Great course for a quant requirement, not too technical, so I think it's useful for most social sciences","course_id":"120668","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=51497fdd7684b736d538ede0653fac7393a974b200fc6b58f6f3430ebf61e17cd2e741761af8cad3d343fc49a1967b3c&ReportType=2&regl=en-US"},{"course_code":"GHHP 30","useful_title":"Global Oral Health Healthy Teeth, Healthy Societies","course_score_mean":4.75,"rec_score_mean":4.75,"gem_score_mean":0.0,"sentiment_score_median":0.7766,"best_gem_comment":"","workload_score_mean":2.87,"best_gem_comment_short":"","best_comment":"If you love global health, oral health, or are interested in medicine, this class is for you. Professor Seymour teaches the class with a lot of reflection and application which will help you have a non–traditional learning experience. There is no memorization to this course. If you immerse yourself in conversations, readings, etc. you will really enjoy this class! It builds a very good community too!","best_comment_short":"If you love global health, oral health, or are interested in medicine, this class is for you.","best_comment_first":"If you love global health, oral health, or are interested in medicine, this class is for you.","course_id":"216336","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a8e3701bd5a719d6a28e8015a1f4135bd66660704252bc32e6981b4884b421340508afcb950925ccb83886a1966c8b2c&ReportType=2&regl=en-US"},{"course_code":"ECON 1346","useful_title":"Closed Borders and Crowded Buses The Economics of Human Mobility","course_score_mean":4.43,"rec_score_mean":4.5,"gem_score_mean":0.0,"sentiment_score_median":0.6597,"best_gem_comment":"","workload_score_mean":4.79,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS!! One of my favorite ec electives I've taken at this school. First and foremost – Gabe Kreindler is amazing. Really smart and incredibly kind\/knowledgable. Topic is really interesting, and by the end of the course you're up to speed on CURRENT research across a number of really interesting mobility and migration economics topics. What are the economic gains from international migration? Domestic migration? What is the impact of increasing access to public transit on the labor market? etc etc. all really interesting things, and the empirical research is methodologically interesting as well. You develop a much better understanding of empirical study design, IVs, discrete choice models. This course is organized in a really satisfying way which feels a little different from other ec electives I've taken. Most of the meat of the course is in learning about empirical research and study design. Therefore, the class is organized more around discussing tons of different recent empirical papers, rather than learning a ton of theory and maybe reading one or two empirical papers. Limited background is necessary for success. If you come in having taken probability, stats, and micro theory, you will have a good time. P sets are easy; exams are very doable.","best_comment_short":"all really interesting things, and the empirical research is methodologically interesting as well.","best_comment_first":"TAKE THIS CLASS!!","course_id":"220386","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8198e7b39a2fd98ed4f94f4eaefdcf6c14fa8b9bdc1a420a30122ce5c690499fec7dd313fc3a771a949678d95454e999&ReportType=2&regl=en-US"},{"course_code":"HAA 97R","useful_title":"The Sophomore Seminar","course_score_mean":4.36,"rec_score_mean":4.45,"gem_score_mean":0.0,"sentiment_score_median":0.91825,"best_gem_comment":"","workload_score_mean":3.91,"best_gem_comment_short":"","best_comment":"I looked forward to coming to this class every week. Isabel McWilliams was a wonderful, reliable TF. It's like HUM 20 but even more intimate and personal!!This course had such wonderful breadth (as promised)!! The response paper prompts challenged us to engage with the weekly readings\/material but allowed us to explore our personal interests. Our time at the art museum was very special and kept us on our toes\/kept things from losing any energy on a Wednesday afternoon. We got to meet amazing professors and get a comprehensive taste of the HAA department. The TF was definitely a strength of the course –– accessible, energetic, encouraging, and willing to share her own interests and expertise!","best_comment_short":"The TF was definitely a strength of the course –– accessible, energetic, encouraging, and willing to share her own interests and expertise!","best_comment_first":"I looked forward to coming to this class every week.","course_id":"126539","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6e101ee8add322eee5c083c4e7474213298a48103b1f485303658851a46dcc480646e667c48e10d59a0fec647cbb44de&ReportType=2&regl=en-US"},{"course_code":"HEB 1306","useful_title":"Wearable sensors measuring activity, health, and performance","course_score_mean":4.9,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.7687,"best_gem_comment":"","workload_score_mean":3.44,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS!! It is awesome. It is low stress but you actually learn a lot and you get to program a lot of really cool things.  You also get to know your class really well and the sets are not very hard when you work through them together. Ali is awesome and its so fun!","best_comment_short":"Ali is awesome and its so fun!","best_comment_first":"TAKE THIS CLASS!!","course_id":"220757","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=942fe5a219321deda49a16f7cf2b0caacc07bc2923a1032a54b469d6c7392e86dfe7b5411d5f66e7d259e85887e338c3&ReportType=2&regl=en-US"},{"course_code":"ASTRON 130","useful_title":"Cosmology","course_score_mean":4.6,"rec_score_mean":4.6,"gem_score_mean":0.0,"sentiment_score_median":0.7856,"best_gem_comment":"","workload_score_mean":6.4,"best_gem_comment_short":"","best_comment":"Going to just copy\/paste what I said in the \"strengths of this course question\" but: One of the best physics\/astro classes I've taken at Harvard. Professor Xingang explains concepts in intuitive and easy–to–understand ways, and his lectures & lecture notes are very easy to follow. He always explains where he gets mathematical processes & results, and is willing and able to re explain concepts in different ways if someone didn't understand something the first time. He & Misha (the TF) were both incredibly responsive and helpful throughout the semester. In addition, it's just a really cool class––the subject matter is super interesting and you get to learn about the formation of the universe down to within fractions of seconds from the Big Bang. We derived some large equations that were simply quoted in previous astro classes I've taken, and it was very cool to see where those concepts and equations came from. All in all an excellent class.","best_comment_short":"In addition, it's just a really cool class––the subject matter is super interesting and you get to learn about the formation of the universe down to within fractions of seconds from the Big Bang.","best_comment_first":"Going to just copy\/paste what I said in the \"strengths of this course question\" but: One of the best physics\/astro classes I've taken at Harvard.","course_id":"125883","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2e7c4775c2cb0112939a5a2b9694f61efbf2ab8b0a4cc8110e942f117e189b0a4a187d99a2cd1604dd7aa85a4222f631&ReportType=2&regl=en-US"},{"course_code":"ECON 2416","useful_title":"Advanced Topics in Empirical Macroeconomics","course_score_mean":4.75,"rec_score_mean":4.5,"gem_score_mean":0.0,"sentiment_score_median":0.6997,"best_gem_comment":"","workload_score_mean":8.86,"best_gem_comment_short":"","best_comment":"The lectures are long and relatively dry but very comprehensive with useful notes to look back to later. Comprehensive intro to empirical macro but not much intuition in the first half, which is on methods and is pretty dry.","best_comment_short":"The lectures are long and relatively dry but very comprehensive with useful notes to look back to later.","best_comment_first":"The lectures are long and relatively dry but very comprehensive with useful notes to look back to later.","course_id":"207940","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e194110b0460c4ac1721e85cb6e302bf5201b2eb598208c18093e539261b979769a31eba23e0329bcc8f267fad80ca2b&ReportType=2&regl=en-US"},{"course_code":"PHYSICS 95","useful_title":"Topics in Current Research","course_score_mean":4.67,"rec_score_mean":4.83,"gem_score_mean":0.0,"sentiment_score_median":0.6974,"best_gem_comment":"","workload_score_mean":1.83,"best_gem_comment_short":"","best_comment":"This is an awesome course! I felt like I learned so much about so many different fields in physics. The workload is incredibly reasonable—you just need to prepare a presentation for one of the speakers and write a final paper, both of which turned out to be quite enjoyable ways to learn a lot about a certain topic. You gain exposure to a wide array of physics sub–topics, so if you're interested in pursuing physics research and want to find a good topic (or even if you're not going into physics and just want to know about what's going on in the field), this is a perfect class for you!","best_comment_short":"You gain exposure to a wide array of physics sub–topics, so if you're interested in pursuing physics research and want to find a good topic (or even if you're not going into physics and just want to know about what's going on in the field), this is a perfect class for you!","best_comment_first":"This is an awesome course!","course_id":"111967","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d5cd83cb0feb8f23122d18c39a2cab964b2bbc7f78ee10be4d75c093790de5bc21728b25c2bb030cfe103585b80323ae&ReportType=2&regl=en-US"},{"course_code":"TURKISH AA","useful_title":"Elementary Modern Turkish I","course_score_mean":4.6,"rec_score_mean":4.6,"gem_score_mean":0.0,"sentiment_score_median":0.59055,"best_gem_comment":"","workload_score_mean":8.2,"best_gem_comment_short":"","best_comment":"This a great way to learn Turkish.","best_comment_short":"This a great way to learn Turkish.","best_comment_first":"This a great way to learn Turkish.","course_id":"111729","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=79121293e98b34ddc3004197badac6be48f9c17d961addbcc372e59cb6b4b829e820a5cf2687e1576668ad08b136ec9a&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 222","course_score_mean":5.0,"rec_score_mean":4.8,"gem_score_mean":0.0,"sentiment_score_median":0.9201,"best_gem_comment":"","workload_score_mean":4.7,"best_gem_comment_short":"","best_comment":"The class covers super interesting material. Each unit provides interesting readings and the smaller assignments done in this class build up to a interesting essays that are enjoyable to write.","best_comment_short":"Each unit provides interesting readings and the smaller assignments done in this class build up to a interesting essays that are enjoyable to write.","best_comment_first":"The class covers super interesting material.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=eb8e534ed9e15a24e33b505512c7c31cd1dcdacb6f25c0a66b7ae3b5f581452c8f8356980770533778f23917c5e73a99&ReportType=2&regl=en-US"},{"course_code":"SPANSH 59","useful_title":"Spanish and the Community","course_score_mean":4.73,"rec_score_mean":4.6,"gem_score_mean":0.0,"sentiment_score_median":0.87975,"best_gem_comment":"","workload_score_mean":4.79,"best_gem_comment_short":"","best_comment":"Highly recommend! Class discussions are relevant and low–stress, the teaching pair is excellent and supportive. The community service element is the cornerstone of your experience, so make the most out of your assigned organization! The class gets you out of the Harvard language bubble and into the actual Spanish–speaking world –– which I personally think is the place where we should be speaking Spanish anyway. Assignments are mostly movie notes and short readings, and the essays are brief and centered around the work you're doing with your organization. Find something fun and meaningful for your final project, the second half of the semester is all about your work there.","best_comment_short":"Class discussions are relevant and low–stress, the teaching pair is excellent and supportive.","best_comment_first":"Highly recommend!","course_id":"115919","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=62e4ad05957dc628e039b54f53ed7453972c7ce7378cca04941a4a63d373dc65248200a426135730c3470ca0ffc3ddb7&ReportType=2&regl=en-US"},{"course_code":"MCB 99A","useful_title":"Laboratory Research for Honors Thesis","course_score_mean":4.33,"rec_score_mean":4.38,"gem_score_mean":0.0,"sentiment_score_median":0.60495,"best_gem_comment":"","workload_score_mean":14.5,"best_gem_comment_short":"","best_comment":"Have clear communication with PI and MCB, lean on other thesising friends, and overall enjoy learning cool things YOU discover!","best_comment_short":"Have clear communication with PI and MCB, lean on other thesising friends, and overall enjoy learning cool things YOU discover!","best_comment_first":"Have clear communication with PI and MCB, lean on other thesising friends, and overall enjoy learning cool things YOU discover!","course_id":"122530","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d72b95f3e38f4948c8e200b3053364140e0ca26f1e872e09bd6180362f4c505b0e0a3db90176c50d439fb5b11da810b9&ReportType=2&regl=en-US"},{"course_code":"MUSIC 15","useful_title":"Harvard Glee Club","course_score_mean":4.87,"rec_score_mean":4.8,"gem_score_mean":0.0,"sentiment_score_median":0.836,"best_gem_comment":"","workload_score_mean":2.7,"best_gem_comment_short":"","best_comment":"If you are in the Glee Club and have space in your schedule there is no reason not to take Music 15! There is already a big time commitment with rehearsals and trips, so I'd say getting credit for it makes a lot of sense. The Harvard Glee Club has the best community among the Choirs, for sure. It does feel like a family, with traditions and huge support. Really, I've had immense financial support for tails, and get to travel to sing for free. Andrew, our conductor, is also the type of person I know cares a lot about the singers, and if ever needed to talk to hum, I know he will be around the corner. So, if you like music and are open to learning more about it with other cool people, join and take Music 15!!!","best_comment_short":"The Harvard Glee Club has the best community among the Choirs, for sure.","best_comment_first":"If you are in the Glee Club and have space in your schedule there is no reason not to take Music 15!","course_id":"110115","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=822a7aa06129adb9ee2931dd3c5caa3e5661a8f50644ffdd9b84c5c2b80d46336d54b8aa8dc43ec7239b0a0be05ecf9e&ReportType=2&regl=en-US"},{"course_code":"MATH 21A","useful_title":"Multivariable Calculus","course_score_mean":4.33,"rec_score_mean":4.13,"gem_score_mean":0.0,"sentiment_score_median":0.6114,"best_gem_comment":"","workload_score_mean":9.77,"best_gem_comment_short":"","best_comment":"This class is awesome! It was so fun to take and I definitely recommend it to everyone. As someone who was never passionate or fascinated with math, this class changed my perception of the whole field. Although it has a daunting 3 psets a week, they are short and manageable and help you learn a lot and the teaching staff is fantastic. It is one of the more chill math classes and was my favorite class this semester as a premed student who isn't a math person. If you take this class, I would definitely recommend finding a good group of people to work on psets with and study for exams (3 hour practice tests for the final are brutal without a pal). MQC is a really underutilized resource because the CAs are super helpful and willing to sit down with you for however long you need. Also, start studying for exams early!!!","best_comment_short":"It was so fun to take and I definitely recommend it to everyone.","best_comment_first":"This class is awesome!","course_id":"119196","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=eeeecbc6baaf41235bc15f2098aecf82bac3eda1286bb570a33c43797c64ca70bb9803e9bff5af7c1543d9457015190c&ReportType=2&regl=en-US"},{"course_code":"ASTRON 110","useful_title":"Exoplanets","course_score_mean":4.93,"rec_score_mean":4.86,"gem_score_mean":0.0,"sentiment_score_median":0.62995,"best_gem_comment":"","workload_score_mean":3.71,"best_gem_comment_short":"","best_comment":"Professor Johnson is my favorite astro professor at Harvard, and 110 is a great example of why. He really cares about learning, and that goal is really emphasized throughout the course. The in–class \"quizzes\" are meant to make sure that students are keeping pace with the rest of the class and I never felt overwhelmed by the course content. The class is also pretty dependent on the students, so it's best to come in with a good faith attitude to the course.","best_comment_short":"The class is also pretty dependent on the students, so it's best to come in with a good faith attitude to the course.","best_comment_first":"Professor Johnson is my favorite astro professor at Harvard, and 110 is a great example of why.","course_id":"125881","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0aec698a7977ca0b2cdb0e64134f268a6c41a3245f9ac211eb6905043e5ab7f52c773a6865fc9c68d0efa708ca153197&ReportType=2&regl=en-US"},{"course_code":"EXPOS 10","useful_title":"Introduction to Expository Writing","course_score_mean":4.44,"rec_score_mean":4.5,"gem_score_mean":0.0,"sentiment_score_median":0.5267,"best_gem_comment":"","workload_score_mean":5.0,"best_gem_comment_short":"","best_comment":"I would recommend taking this class because you get a solid foundation in college writing. The Professor was also very understanding and helpful and gave great feedback on how to improve my writing skills.","best_comment_short":"The Professor was also very understanding and helpful and gave great feedback on how to improve my writing skills.","best_comment_first":"I would recommend taking this class because you get a solid foundation in college writing.","course_id":"118262","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=86b08cf4c797a91225033930a9653d38bdf17aac8d18d8fc1a5a9b97e1b552c093411da4bb34a31e54cac77c95ae4715&ReportType=2&regl=en-US"},{"course_code":"EXPOS 10","useful_title":"Introduction to Expository Writing","course_score_mean":4.67,"rec_score_mean":4.56,"gem_score_mean":0.0,"sentiment_score_median":0.6382,"best_gem_comment":"","workload_score_mean":4.67,"best_gem_comment_short":"","best_comment":"Expos Studios 10 was a good course. Although sometimes it felt like busy work I enjoyed the pacing.","best_comment_short":"Although sometimes it felt like busy work I enjoyed the pacing.","best_comment_first":"Expos Studios 10 was a good course.","course_id":"118262","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f790a0d5d80e7de24f62883c71d8cd567dfb9629956216b7adb488cdcb5eff9f83385a5f8b427f8ca0dbb345b154a1a0&ReportType=2&regl=en-US"},{"course_code":"RELIGION 1589","useful_title":"Truths & Reconciliations","course_score_mean":5.0,"rec_score_mean":4.57,"gem_score_mean":0.0,"sentiment_score_median":0.5487,"best_gem_comment":"","workload_score_mean":4.4,"best_gem_comment_short":"","best_comment":"This is an amazing class! Although challenging at times, the topics and discussions held in class are extremely important and meaningful. You don't need any background in Canadian history to take this class! The assignments are very reasonable and Pamela is a great professor. We had many great guest lecturers and we even got to go on a few outings. This class does have a lot of readings in the first half of the semester but you can manage your time you should be fine. Please please please take one of Pamela's classes if you get the chance!","best_comment_short":"Please please please take one of Pamela's classes if you get the chance!","best_comment_first":"This is an amazing class!","course_id":"220581","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ef685d73d4e6abc5702d0d8ccf466383cf614a72743e9669c7c6e757c6e71ab1b79d31191b03f886e7e9618641c97b3f&ReportType=2&regl=en-US"},{"course_code":"GOV 94JH","useful_title":"American Cyber Politics","course_score_mean":4.38,"rec_score_mean":4.42,"gem_score_mean":0.0,"sentiment_score_median":0.7837,"best_gem_comment":"","workload_score_mean":4.85,"best_gem_comment_short":"","best_comment":"Halen is an amazing professor who truly wants to get to know her students and make sure they are thriving. The assignments aren't too bad, with emphasis on weekly reading responses and a project and paper. Highly recommend this course!","best_comment_short":"Halen is an amazing professor who truly wants to get to know her students and make sure they are thriving.","best_comment_first":"Halen is an amazing professor who truly wants to get to know her students and make sure they are thriving.","course_id":"213604","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=99fa24b5317a0071e115ded154632ff03059c7b114531ff06767422547d404e7b4bc04a81353c37cb6485958394da1f5&ReportType=2&regl=en-US"},{"course_code":"MOD-HEB 120A","useful_title":"Intermediate Modern Hebrew I","course_score_mean":4.83,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":0.7964,"best_gem_comment":"","workload_score_mean":6.0,"best_gem_comment_short":"","best_comment":"Irit is an amazing professor and you should do anything you can to take this class with her! There is a lot of course work and time in the classroom, but it feels intentional and is all for the purpose of helping you learn the language. This isn't an easy pass at getting your language out of the way, but is fun and meaningful and anyone interested in learning Hebrew and appreciating the historical roots of modern Hebrew should take this class.","best_comment_short":"This isn't an easy pass at getting your language out of the way, but is fun and meaningful and anyone interested in learning Hebrew and appreciating the historical roots of modern Hebrew should take this class.","best_comment_first":"Irit is an amazing professor and you should do anything you can to take this class with her!","course_id":"110947","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=60b732a5ceabb3152ebf1f9e7047d07ab7d477c8f1aa38956407c7934e4fe1b26e769fb36163599492e0e61d648ae993&ReportType=2&regl=en-US"},{"course_code":"E-PSCI 200","useful_title":"Atmospheric Chemistry and Physics","course_score_mean":4.6,"rec_score_mean":4.7,"gem_score_mean":0.0,"sentiment_score_median":0.5847,"best_gem_comment":"","workload_score_mean":4.7,"best_gem_comment_short":"","best_comment":"The class is detailed, relevant, and fun. Steve is an especially dynamic lecturer and supplemented the class material with his own personal expertise on different topics, field campaigns, and environmental policies. I highly recommend this class.","best_comment_short":"The class is detailed, relevant, and fun.","best_comment_first":"The class is detailed, relevant, and fun.","course_id":"111855","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8fa3f183b22f86b30e95fcb82af8f9f0a3a8fa102080b5cabf4c3dde6f298e65fe33f8e08198ed325447db18bf61dd51&ReportType=2&regl=en-US"},{"course_code":"ECON 1499","useful_title":"Macroeconomic Stabilization Policies","course_score_mean":4.5,"rec_score_mean":4.71,"gem_score_mean":0.0,"sentiment_score_median":0.631,"best_gem_comment":"","workload_score_mean":5.15,"best_gem_comment_short":"","best_comment":"To me, one of the most unique and important things I gained from this course is how to think about and explain complex problems with immediately understandable analogies––this is perhaps the most important general learning tool I have taken away, and it is one of the key hallmarks of Larry's wit and brilliance. The second major thing I learned is how to understand and react to weekly macroeconomic and financial markets changes: things like new data releases on inflation, the JOLTS survey, BLS data, etc. I most appreciated the opportunity to sit in on Larry's teaching and hear him reason through all the current macro bombs that happened each week, the broader macro questions we were asking, his work on secular stagnation, his take\/explanation on the papers of others, and his live feedback to the students that presented almost every week. This constant exercise of hearing Larry speak and reason through his thoughts and analogies was the MOST valuable takeaway from this course, and would not be received in any other economics experience elsewhere. It was a great privilege to get such constant, consistent, and timely live feedback from Larry and Paul on our presentations, as well as to have them advise us on one paper that we are working towards throughout the entire semester. The weekly student presentations on the papers we read were important as students should have a frequent exercise in the presentation of academic papers; it enforces close engagement with the material, solidifies understanding, and points out areas of confusion. However, most of the papers were over our heads, and it is certain that most students did not have a strong understanding of the academic papers. I wish we had more pedagogical experiences learning to understand these papers from Larry and Paul, after students presented, instead of us trying to make sense of the papers (often the blind leading the blind). If we could increase paper understanding to 80%+, then that would be an incredible achievement and benefit to future students. Lastly, like my peers have said, this course would benefit from an equalization of the floor at the onset of the class by having Larry and Paul teach about foundational macro finance principals in the first few weeks. The students that were not in FED challenge or did not have the privileges of joining FED challenge had a harder learning curve to makeup.","best_comment_short":"It was a great privilege to get such constant, consistent, and timely live feedback from Larry and Paul on our presentations, as well as to have them advise us on one paper that we are working towards throughout the entire semester.","best_comment_first":"To me, one of the most unique and important things I gained from this course is how to think about and explain complex problems with immediately understandable analogies––this is perhaps the most important general learning tool I have taken away, and it is one of the key hallmarks of Larry's wit and brilliance.","course_id":"217408","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a92c0bae13a5cd87339ae03f91a35f29f79443a30c3b4ba994b0cfb5b91ad29cbf09669b938837d947c4b6a6e7a8bcba&ReportType=2&regl=en-US"},{"course_code":"MUSIC 107","useful_title":"Advanced Ensembles","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.6105,"best_gem_comment":"","workload_score_mean":3.13,"best_gem_comment_short":"","best_comment":"Great course if you are in jazz band – doesn't add a ton of work to your plate and is a good way to learn more about what you are playing within the ensemble.","best_comment_short":"Great course if you are in jazz band – doesn't add a ton of work to your plate and is a good way to learn more about what you are playing within the ensemble.","best_comment_first":"Great course if you are in jazz band – doesn't add a ton of work to your plate and is a good way to learn more about what you are playing within the ensemble.","course_id":"220622","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7a7503d91fa136fb70c79747c790085df74f127cf154c7bf70620817ea74e260f914c79148e392fa1158efc77f918df8&ReportType=2&regl=en-US"},{"course_code":"EXPOS 10","useful_title":"Introduction to Expository Writing","course_score_mean":4.56,"rec_score_mean":4.33,"gem_score_mean":0.0,"sentiment_score_median":0.5106,"best_gem_comment":"","workload_score_mean":6.22,"best_gem_comment_short":"","best_comment":"Take this class only if you feel uncomfortable with writing. Professor Vilbig is great professor although his response time could definitely be better. I would recommend anyone taking this class to make sure to take notes on the actual pdfs as it can make it easier to follow along what the professor is talking about. It can be boring at some points of the semester, but you gain good knowledge into what a good essay should look like.","best_comment_short":"It can be boring at some points of the semester, but you gain good knowledge into what a good essay should look like.","best_comment_first":"Take this class only if you feel uncomfortable with writing.","course_id":"118262","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0cd8cc4920d3aa505ed68e0b36381cfa47e19dd27b15be0012a8a6f866ade2599fc36dcbea145f94a914b0e6ff5a3e9e&ReportType=2&regl=en-US"},{"course_code":"COMPSCI 165","useful_title":"Data Systems","course_score_mean":4.77,"rec_score_mean":4.38,"gem_score_mean":0.0,"sentiment_score_median":0.6983,"best_gem_comment":"","workload_score_mean":15.72,"best_gem_comment_short":"","best_comment":"One of the best courses, if not the best course, I've taken at Harvard. If you're thinking about taking the course, do it! Find some friends to take it with you, clear space in your schedule, and deep dive into the course. It's definitely worth it; don't be deterred by any reviews. A few reasons the class stands out:1) Stratos and his lab are some of the most chill, yet cracked people I've ever met—just look at the awards they win. This translates to easy–to–understand lectures and a good introduction to research. Lectures teach you how to walk step–by–step through the different operators you learn about, as well as how to break down any high–level database concept into the fundamentals: cache utilization, branching, etc. (I would suggest taking CS 61 before this course; I will note that I found the project easier than the psets in CS 61). Furthermore, doing database research is comparable to the work you do in lectures.2) You learn how to code—independently. Unlike in CS 61, where the projects were contained to 1–2 weeks of work, no one besides you in this class (not the TFs nor Stratos) will know your entire database implementation because you'll be working on it throughout the semester. Besides the handout code—which you can revamp to your heart's content—you decide which functions to create and how they work, how to parse inputs, and how to return results. Attending lectures should provide a rough outline for you to follow, but besides that, you learn how to debug your code. (Please, please, please install Valgrind immediately after starting the course. I promise you'll save 2 weeks' worth of time you'd otherwise spend debugging weird errors and dealing with memory management in C. You can either launch an EC2 instance or run it through Docker). Modularize your functions, unit test new operators, and spend time thinking about the high–level concepts (you should really only spend 30% of your time on this project actually coding); this project isn't bad once you realize how to break a big task into a collection of smaller ones. 3) The grading is very generous with extra credit, namely, on the midterms. You don't need to sweat your grade!","best_comment_short":"One of the best courses, if not the best course, I've taken at Harvard.","best_comment_first":"One of the best courses, if not the best course, I've taken at Harvard.","course_id":"119249","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=75d965d39486289eaa28da3cc126b71715938bf18282358de4c164da034e32070a933273ea7b3906c5349a2409d0ba51&ReportType=2&regl=en-US"},{"course_code":"ECON 985A","useful_title":"Econ 985 Senior Thesis Research","course_score_mean":4.77,"rec_score_mean":4.46,"gem_score_mean":0.0,"sentiment_score_median":0.4767,"best_gem_comment":"","workload_score_mean":8.08,"best_gem_comment_short":"","best_comment":"Martin's section is great and you will get plenty of good feedback. This class is required but is actually really helpful in terms of the structure it gives to the thesis process.","best_comment_short":"Martin's section is great and you will get plenty of good feedback.","best_comment_first":"Martin's section is great and you will get plenty of good feedback.","course_id":"120541","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=39436dd6efda4b5059cb81ba6020e4628911dbf86fff69842c3c6628596320931a99e78462fe7ae59b007240d8081bd0&ReportType=2&regl=en-US"},{"course_code":"PSY 2553R","useful_title":"Behavioral Insights Group Research Seminar","course_score_mean":4.85,"rec_score_mean":4.54,"gem_score_mean":0.0,"sentiment_score_median":0.401,"best_gem_comment":"","workload_score_mean":5.92,"best_gem_comment_short":"","best_comment":"This course is very dependent on who you are paired with, I would assume, but Nicole was amazing and it was so great to learn from her and develop a relationship with her. I worked as a confederate in the Behavioral Lab at HBS which was such a cool experience. That was the bulk of my work. I also helped with some work on Excel. I really liked how different this experience was from my other classes – it was much more experiential obviously and paired well with classes like PSY 1900 and 1901.","best_comment_short":"This course is very dependent on who you are paired with, I would assume, but Nicole was amazing and it was so great to learn from her and develop a relationship with her.","best_comment_first":"This course is very dependent on who you are paired with, I would assume, but Nicole was amazing and it was so great to learn from her and develop a relationship with her.","course_id":"120559","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9ddeea8eb9817f8c290d5ad971ae9a979530c1337c3183ed24fd1b6d28e6648ce1ded8c6cec1991b9674131af5307cfe&ReportType=2&regl=en-US"},{"course_code":"SANSKRIT 102AR","useful_title":"Intermediate Sanskrit I","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.5821,"best_gem_comment":"","workload_score_mean":11.6,"best_gem_comment_short":"","best_comment":"Amazing course! Take it, you'll love it especially as the readings get more interesting and challenging throughout the year. Nell does an amazing job of making the course flexible and making sure everyone is on the same page.","best_comment_short":"Take it, you'll love it especially as the readings get more interesting and challenging throughout the year.","best_comment_first":"Amazing course!","course_id":"114270","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=89d5e935ef55e7a4a360e596cd525178ff4160b0f25bb1455a96efdbca672bb3027d0635053444b3e3f8cf973fe1e617&ReportType=2&regl=en-US"},{"course_code":"PHYSICS 253A","useful_title":"Quantum Field Theory I","course_score_mean":4.27,"rec_score_mean":4.33,"gem_score_mean":0.0,"sentiment_score_median":0.4767,"best_gem_comment":"","workload_score_mean":15.21,"best_gem_comment_short":"","best_comment":"The course is great! You can learn a lot about quantum field theory in this course. The assignments are very helpful to better understand the materials. Some familiarity with undergrad–level complex analysis and working with indices for tensors would be helpful. With Professor Yin, we also had the opportunity to do a final project to explore something interesting related to what we've learned in the course and it was a great way to learn how to approach a theoretical physics topic and very helpful for future work whether you will do theoretical physics or not because you would learn how to think deeply on a scientific issue and question yourself and keep pushing yourself to learn more.","best_comment_short":"With Professor Yin, we also had the opportunity to do a final project to explore something interesting related to what we've learned in the course and it was a great way to learn how to approach a theoretical physics topic and very helpful for future work whether you will do theoretical physics or not because you would learn how to think deeply on a scientific issue and question yourself and keep pushing yourself to learn more.","best_comment_first":"The course is great!","course_id":"122930","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a4fc21480e56a24725e45d5ef42c0b337161e603f97fcc0f80bc849a36a2d2caffe5764e2d8b17214fc441a0480c971b&ReportType=2&regl=en-US"},{"course_code":"ECON 2142","useful_title":"Time Series","course_score_mean":4.68,"rec_score_mean":4.68,"gem_score_mean":0.0,"sentiment_score_median":0.55235,"best_gem_comment":"","workload_score_mean":7.71,"best_gem_comment_short":"","best_comment":"Anna was a great lecturer and brought her expertise to the material. The class also very useful to people outside of macro and finance and made you more comfortable with many statistical concepts. She's just visiting for the year and not staying forever\/teaching it next year, and it's a terrible shame!","best_comment_short":"The class also very useful to people outside of macro and finance and made you more comfortable with many statistical concepts.","best_comment_first":"Anna was a great lecturer and brought her expertise to the material.","course_id":"113904","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0147c5b2dcf22b77a3c51ab08b6e8869e5fa4b13f76b10005e2adacc9ed423df2f3c3cea99f290fda4cd2548dae3a0b1&ReportType=2&regl=en-US"},{"course_code":"EXPOS 10","useful_title":"Introduction to Expository Writing","course_score_mean":4.44,"rec_score_mean":4.56,"gem_score_mean":0.0,"sentiment_score_median":0.27765,"best_gem_comment":"","workload_score_mean":5.44,"best_gem_comment_short":"","best_comment":"This was definitely my favorite course of the semester. Even if you get placed into Expos 20 (like I did) this class is so much fun and so worth it. Even though anybody could take this class without having any college–level writing experience, everybody can learn from this class. Now, I look at writing in a way that I never did before. It was definitely a reasonable workload that helped to ease me into college life.","best_comment_short":"Even if you get placed into Expos 20 (like I did) this class is so much fun and so worth it.","best_comment_first":"This was definitely my favorite course of the semester.","course_id":"118262","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=20f5515c80307d36cde737981566e7f41ff8e20a5f165e2fae79bb9f583a8d507a11fc293ef45fb2253537898db101ca&ReportType=2&regl=en-US"},{"course_code":"HIST 1800","useful_title":"A Critical Introduction to the Study of the Middle East","course_score_mean":4.58,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":0.24695,"best_gem_comment":"","workload_score_mean":8.5,"best_gem_comment_short":"","best_comment":"Enjoy.","best_comment_short":"Enjoy.","best_comment_first":"Enjoy.","course_id":"220729","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d1b2fb3d18bbbc87dd761fbe6edc5da4e8c20de347e34000943cb07b56d506875b3cd08a21a16a936f6a8807b93681e6&ReportType=2&regl=en-US"},{"course_code":"GREEK 1","useful_title":"Introductory Ancient Greek 1","course_score_mean":5.0,"rec_score_mean":4.8,"gem_score_mean":0.0,"sentiment_score_median":0.0,"best_gem_comment":"","workload_score_mean":5.4,"best_gem_comment_short":"","best_comment":"This is a great course to learn ancient Greek if you have any desire to do so! Even if you don't the language will force you to think in ways you may not have thought before; there is definitely a beautiful rigor to the language.","best_comment_short":"This is a great course to learn ancient Greek if you have any desire to do so!","best_comment_first":"This is a great course to learn ancient Greek if you have any desire to do so!","course_id":"203024","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=91d416038019d7738c0cef8ee3f5aaf9a93529d56f6da20937fc0982fcf071de602ade7aad7b80c527ec95c32ba1b3ae&ReportType=2&regl=en-US"},{"course_code":"MCB 91","useful_title":"Research for Credit in Molecular and Cellular Biology","course_score_mean":4.78,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":0.5848,"best_gem_comment":"","workload_score_mean":13.78,"best_gem_comment_short":"","best_comment":"Amazing course!","best_comment_short":"Amazing course!","best_comment_first":"Amazing course!","course_id":"122529","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e2aa47def84b84d7e46073b1413b785eae945e13f2efc003edc650282e74de39ea3cfcf5f035e118930ea145de0bcb9d&ReportType=2&regl=en-US"},{"course_code":"SHBT 201","useful_title":"From Sound to Neuron","course_score_mean":4.67,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.0,"best_gem_comment":"","workload_score_mean":11.5,"best_gem_comment_short":"","best_comment":"Be sure ask questions during class!","best_comment_short":"Be sure ask questions during class!","best_comment_first":"Be sure ask questions during class!","course_id":"108213","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3fa133e47dd270aed1067c9250028bca812686fe95da24e4dcbbe3531fbee8caf763420823da80eb9f5f04c2ade1e166&ReportType=2&regl=en-US"},{"course_code":"MOD-HEB BA","useful_title":"Elementary Modern Hebrew I","course_score_mean":4.8,"rec_score_mean":4.4,"gem_score_mean":0.0,"sentiment_score_median":0.0,"best_gem_comment":"","workload_score_mean":6.4,"best_gem_comment_short":"","best_comment":"","best_comment_short":"","best_comment_first":"","course_id":"114218","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9aefa2e1a47dc1b3949f0ce964b676e1850a5b1eefd86ae693038e504054b375f9397f156986f94b378ff6c1c35eec91&ReportType=2&regl=en-US"},{"course_code":"EXPOS 10","useful_title":"Introduction to Expository Writing","course_score_mean":4.43,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":0.0,"best_gem_comment":"","workload_score_mean":5.57,"best_gem_comment_short":"","best_comment":"","best_comment_short":"","best_comment_first":"","course_id":"118262","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0d813cb538fc8207abc105ad5d67945bb3a51fee85edffb4927d607ac34776cd4cfa7aeed5d6bfba34870a58917e00d8&ReportType=2&regl=en-US"},{"course_code":"ECON 2924","useful_title":"Early Stage Research and Discussions on Deep Learning and Big Data in Economics","course_score_mean":4.57,"rec_score_mean":4.29,"gem_score_mean":0.0,"sentiment_score_median":-0.6997,"best_gem_comment":"","workload_score_mean":2.14,"best_gem_comment_short":"","best_comment":"","best_comment_short":"","best_comment_first":"","course_id":"220408","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=535c1edf566a989eb53c7d4f19cb66d4edc7536b3073289d8d55fc5fe63ef172635757d3981cccfd5f6501e818c0c9eb&ReportType=2&regl=en-US"}]