[
    {
        "course_code": "AFRAMER 133Y",
        "course_title_2025": "The Politics of Paradise: Tourism in Latin America & the Caribbean",
        "course_score_mean": 5.0,
        "rec_score_mean": 5.0,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9286,
        "best_gem_comment": "",
        "workload_score_mean": 4.43,
        "best_gem_comment_short": "",
        "best_comment": "TAKE THIS CLASS! The best course I have taken at Harvard. Politics of Paradise offers an incredibly engaging and thoughtful exploration of tourism, colonialism, and the erasure of indigenous and local perspectives. The readings and lectures were consistently captivating, and the experiential learning component, with its mini excursions, brought the material to life in ways I never expected.This course fundamentally shifted how I think about Latin America and the Caribbean, encouraging me to critically examine the complexities of these regions and the forces that shape their narratives. The weekly discussion posts were a highlight—this was the first time I genuinely looked forward to reading my classmates’ contributions, as they always added depth to the topics we explored.Professor Henry’s teaching approach was exceptional. Her dedication and enthusiasm made every class feel collaborative and inspiring. Thanks to her, I will NEVER look at the word \"Paradise\" the same. I cannot recommend this course enough—it’s rigorous, eye–opening, and transformative.",
        "best_comment_short": "Politics of Paradise offers an incredibly engaging and thoughtful exploration of tourism, colonialism, and the erasure of indigenous and local perspectives.",
        "best_comment_first": "TAKE THIS CLASS!",
        "course_id": "224623",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d3a164a79d4c6a0bb18b5b6ca773152a9c92c2f711fb187a73ec6d32dcdebb17fd6f217ebaca05e0ef92f8e94aea695d&ReportType=2&regl=en-US"
    },
    {
        "course_code": "RUSS AAB",
        "course_title_2025": "Elementary Russian (Intensive)",
        "course_score_mean": 5.0,
        "rec_score_mean": 4.4,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.96695,
        "best_gem_comment": "",
        "workload_score_mean": 10.8,
        "best_gem_comment_short": "",
        "best_comment": "TLDR: Take this class – my favorite class of all time! At the end of this course you will be able to speak, read, and write Russian very well at a basic level! I now feel confident to strike up a conversation and can hold my own. If you're unsure just pull up to the first class, you'll love it so much you'll stay!(Much) Longer version:Professor:– Dima (Dmitrii), the professor, is the best professor of all time. Seriously he cares so much, he's incredible enthusiastic, and makes the course an incredible amount of fun. He is the greatest professor I've ever had and should be a tenured professor with several awards named after him. With him, you don't just learn the language. As you learn more Russian in terms of grammar, vocab, and speaking you will also learn poems, songs, watch a movie, record a video, and read a story! You don't just learn the language but appreciate and learn about the culture. – Dima and Roy (the TF) put in so much work and make it so fun and easy for you to learn. Definitely some of the best and hard working faculty on this campus.If you're thinking of taking this course:1) Go to the first day – if you love it like I did, you'll likely stay but please go – it's incredible2) Yes it is actually 2 courses worth of work – see the structure (if you really want to think of it as 1 course think about it this course has around the same or higher median amount of work outside of class as notorious classes like – Stat110, EC1011a, Chem 27, CS 124 – but instead of 3h of class a week you have 8h).  I.e. think of it as 2 classes and you'll be fine since then it's closer to 2 medium classes work or 1.5 hard classes. If you're between doing Russ AAB (8 credit) vs AA (4 credit) here's what to know:1) you will spend 8h of class instead of 5h and do 1.5–2x the work but move through double the material. You learn much more, become more fluent and it's epic.2) At the end of the semester you will know all the Russian cases and be able to understand and speak basic Russian really well (fluency is gained not only by how much time you spend learning but also but in what timeframe, i.e. doing 2x the work in the same time results in learning more than 2x quicker)3) The students who take this really want to be here. They came to learn the language and so people are more focused, interesting and you learn from each otherIf you want to talk to people who have taken the course\/are unsure:– Talk to Dr Clancy and\/or Dima AND ask them to connect you with students who have taken the course – they are happy to and we are happy to give you our unfiltered takes (which is we loved it but we'll also be real about the amount of work and if this course is right for you).Structure (and to give an idea of what the time breakdown looks like):– To start with the reason you have so much work is because if you do the work you will learn – it's intentionally structured this way. This isn't like other classes where you need to put in time outside of the homework to actually learn. – 8h of class a week of which 3h is small speaking section (usually like 1:30 or like 10:30 or some combo but happens MWF) and 5x normal class every morning. The small speaking sections will fit around your schedule don't worry. Not sure who the TF will be but they will teach Tuesday and Thursday mornings and grade assignments while Dima will teach the small speaking sections as well as the MWF mornings.– Approx 2h a day of HW for Mon–Thurs – Friday you have a vocab test (you should spend like 20m a day studying)– Weekly (take home) unit tests which take more or less 1h– Check your HW and Unit tests after they've been graded to learn from errors– Midterm and Final (Oral and written) – Dima has practice exams which are super useful!!(If we're being honest, even though you should, you're probably not doing it EVERY day, but try space it out, maybe do it in 2 or 3 sessions in a week – DO NOT leave it for one day a week, you will feel behind all week, spend the entire Sunday working, and it's not fun)Grades:– Like most language at Harvard, don't worry – if you learn the language (which you will), you will do well. (no I will not be elaborating but when I say don't worry about the grade I truly mean it because if you instead just learn the language you will do great and have fun).– I mean you're not really taking this course because you are worried about a grade but rather you want to learn the language... BUT this course doesn't have tricks it's straightforward with course staff who want you to success and at no point is there surprises or are you trying to be caught out. Other vibes:– The Russian Students Society host fun and epic events and get to meet and practice Russian.– The Slavic Languages program have fun events like the weekly Lowell Language Table, crepe making etc. The faculty are uber accessible and it's always a good time.– The Davis Center for Eurasian studies has awesome events you should attend to learn more about politics, people, region.",
        "best_comment_short": "Not sure who the TF will be but they will teach Tuesday and Thursday mornings and grade assignments while Dima will teach the small speaking sections as well as the MWF mornings.– Approx 2h a day of HW for Mon–Thurs – Friday you have a vocab test (you should spend like 20m a day studying)– Weekly (take home) unit tests which take more or less 1h– Check your HW and Unit tests after they've been graded to learn from errors– Midterm and Final (Oral and written) – Dima has practice exams which are super useful!!",
        "best_comment_first": "TLDR: Take this class – my favorite class of all time!",
        "course_id": "113925",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f60f658b43156e412ad3f0a08fbfa7972ebbade7fe2344426d5746e9f7eba95ac53eeb0f0d385e0aa0ca2ea54e6f3942&ReportType=2&regl=en-US"
    },
    {
        "course_code": "FYSEMR 41K",
        "course_title_2025": "Human Rights, Law and Advocacy",
        "course_score_mean": 5.0,
        "rec_score_mean": 4.92,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.94135,
        "best_gem_comment": "",
        "workload_score_mean": 4.67,
        "best_gem_comment_short": "",
        "best_comment": "TAKE THIS CLASS!!! I'm fully a STEM major but I enjoyed taking this class so much. Prof. Farbstein is insanely smart, talented, and kind. Readings are incredibly interesting and discussions are very engaging. If you are at all interested in international law or human rights, this is such a good class to take.",
        "best_comment_short": "Prof. Farbstein is insanely smart, talented, and kind.",
        "best_comment_first": "TAKE THIS CLASS!!!",
        "course_id": "121017",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ae074c639bc4dd972f1199bb24a1e0af8a92ed8964f4c39af52433f20012dfc75a8c93c849ceb6c300e50fb51d4987bd&ReportType=2&regl=en-US"
    },
    {
        "course_code": "GOV 1796",
        "course_title_2025": "Central Challenges of American National Security, Strategy, and the Press",
        "course_score_mean": 5.0,
        "rec_score_mean": 5.0,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.68785,
        "best_gem_comment": "",
        "workload_score_mean": 11.5,
        "best_gem_comment_short": "",
        "best_comment": "This class is the best that I've taken at Harvard. It's more rigorous than any undergraduate class I've taken––you'll get honest, un–sugarcoated feedback and you'll be asked to pass judgment on big topics without simple answers. But the problems you tackle are timely, real, complex, and important. Even though it takes a lot of time, thought, and work, it's easy to let this class come to the forefront of your attention week–to–week and be the focus that the rest of your semester revolves around. Every reading and assignment you do in this class is worthwhile and improves your understanding of the international landscape\/helps you develop your own. There are so many opportunities for engagement beyond the classroom (supplemental talks by guest speakers\/policymakers, simulations of NSC meetings, and conferences).",
        "best_comment_short": "There are so many opportunities for engagement beyond the classroom (supplemental talks by guest speakers\/policymakers, simulations of NSC meetings, and conferences).",
        "best_comment_first": "This class is the best that I've taken at Harvard.",
        "course_id": "113210",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=45cd2ddbfbc3ba24955a0476c8626a67602f7dc2b7efc9b46cdb6b3a8dd7d8f560718a652992e033709e019db7f33ab6&ReportType=2&regl=en-US"
    },
    {
        "course_code": "HAA 99A",
        "course_title_2025": "Tutorial - Senior Year",
        "course_score_mean": 5.0,
        "rec_score_mean": 5.0,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.63025,
        "best_gem_comment": "",
        "workload_score_mean": 6.6,
        "best_gem_comment_short": "",
        "best_comment": "don't be scared by the rate of assignments. they're there to keep you on track with your thesis and thinking about your path forward with the project. more than anything, i think this class is here so that thesis writers build a sense of community, and i so so appreciate the other students thesising with me and their perspectives!! when we are all stressed together it is slightly easier to bear.",
        "best_comment_short": "more than anything, i think this class is here so that thesis writers build a sense of community, and i so so appreciate the other students thesising with me and their perspectives!!",
        "best_comment_first": "don't be scared by the rate of assignments.",
        "course_id": "112484",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1b43cfc85718ac6c1a716589c40afbfaa52ac74d061ea065187dcef0d2701492feffccbe5e7f437f40207a06275e7692&ReportType=2&regl=en-US"
    },
    {
        "course_code": "HEB 118",
        "course_title_2025": "Building the Human Body",
        "course_score_mean": 5.0,
        "rec_score_mean": 5.0,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.14625,
        "best_gem_comment": "",
        "workload_score_mean": 4.75,
        "best_gem_comment_short": "",
        "best_comment": "This is definitely a challenging class. But if you really want to be a geneticist, evolutionary biologist, or anything in that realm, it's an awesome bootcamp. I feel like I leveled up from \"biology student\" to \"biologist\" in this class.",
        "best_comment_short": "But if you really want to be a geneticist, evolutionary biologist, or anything in that realm, it's an awesome bootcamp.",
        "best_comment_first": "This is definitely a challenging class.",
        "course_id": "156174",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e1d206c4f1ffd39a6a59e3f5aed2b2ae1999a733b67116d4621ef84f52a36d9ecfdfa6e291d8eca92c1d464f7a29f776&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ECON 2725",
        "course_title_2025": "Corporate Finance and Banking",
        "course_score_mean": 5.0,
        "rec_score_mean": 4.7,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.3276,
        "best_gem_comment": "",
        "workload_score_mean": 6.5,
        "best_gem_comment_short": "",
        "best_comment": "Adi said I wouldn’t find this class interesting, but I beg to differ. This was probably my favorite class this semester. Lectures are interesting, Sam and Adi are amazing, and the assignments are VERY well–designed—just the right level of challenging. The referee reports were a very good experience, and I definitely learned and matured a lot as an economist through this course.That said, if you don’t find the subject matter interesting, don’t take it—I only loved the course because I am seriously interested in finance academia. This class will not help you get a job at Goldman in any way shape or form, so if you are an undergrad who likely wants to go into the finance private sector after graduation, don’t take it.",
        "best_comment_short": "The referee reports were a very good experience, and I definitely learned and matured a lot as an economist through this course.That said, if you don’t find the subject matter interesting, don’t take it—I only loved the course because I am seriously interested in finance academia.",
        "best_comment_first": "Adi said I wouldn’t find this class interesting, but I beg to differ.",
        "course_id": "110731",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1a80c6a8346b8bc76b17a563cac70b07f81f4b602724fe5fd637bed1de1bac8757dca2aab9813eb1d3a6e830506a6d47&ReportType=2&regl=en-US"
    },
    {
        "course_code": "RELIGION 32",
        "course_title_2025": "Introduction to Indigenous Pacific Religion",
        "course_score_mean": 5.0,
        "rec_score_mean": 5.0,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9557,
        "best_gem_comment": "",
        "workload_score_mean": 7.71,
        "best_gem_comment_short": "",
        "best_comment": "Please, please, PLEASE take a class with Therese Lautua while you can. Although I will do absolutely everything in my power to get her a permanent position at Harvard, she is only here on a fellowship contract, so her time with us may be unfortunately limited. I believe that we have zero tenured faculty of Pacific descent at this university, but that is another issue.Taking a class with Therese will not only transform your approach to learning and discussion, but it will require you to engage deeply with some of the most pressing issues of our time from an indigenous Pacific lens. That is a once in a lifetime opportunity. Talanoa, or to talk\/unveil, refers to a collaborative discussion approach to complex problems. Through talanoa, we build community, challenge norms, and facilitate understanding. This class was taught using Talanoa, which means that each student must come to class prepared to fully immerse themselves in the week's texts and topic(s). It was an unparalleled learning experience, and one that enabled students to form genuine connections with both each other and the material. Around 85% of texts that we read in REL 32 were by indigenous Pacific scholars. In most classes about topics in the Pacific that I have come across (at Harvard), the ratio is flipped. I think that in itself speaks volumes. Having an emic perspective on Pacific issues is absolutely fundamental to effectively and deeply engaging with it.  I come from a country in the Pacific, and for lack of a better word, this class felt like home. It felt like home in a place that can sometimes feel isolating. This class gave me an anchor, and it (or any class taught by Therese, for that matter) will give you one too.",
        "best_comment_short": "Please, please, PLEASE take a class with Therese Lautua while you can.",
        "best_comment_first": "Please, please, PLEASE take a class with Therese Lautua while you can.",
        "course_id": "224660",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2318b3afa0710adc57305624e2cb60bdc639080b2c5f38c2cb55784d1bf51a9a3106a7fe1b373ed70d90a593cbbe3488&ReportType=2&regl=en-US"
    },
    {
        "course_code": "E-PSCI 99A",
        "course_title_2025": "Tutorial - Senior Year",
        "course_score_mean": 5.0,
        "rec_score_mean": 5.0,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.7496,
        "best_gem_comment": "",
        "workload_score_mean": 12.5,
        "best_gem_comment_short": "",
        "best_comment": "Thesising is incredibly doable under Chloe's incredible guidance! She's the best ever and is incredibly helpful, kind, and reassuring throughout the whole process. I was incredibly worried about whether writing a thesis would be a good decision for me and whether I could have a happy senior year while doing so, but I have really enjoyed the process thanks to the teaching team and my mentor. Finding good mentorship is key!",
        "best_comment_short": "She's the best ever and is incredibly helpful, kind, and reassuring throughout the whole process.",
        "best_comment_first": "Thesising is incredibly doable under Chloe's incredible guidance!",
        "course_id": "120379",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0d717d7ad2a867f63ac4462ed0090ac4379604edb2cc9186784a4741bfff3a907e2f35e9e9f1fab598799760b1c90c47&ReportType=2&regl=en-US"
    },
    {
        "course_code": "FRENCH 64",
        "course_title_2025": "Exploring French Language in North America through Text, Image, and Culture",
        "course_score_mean": 5.0,
        "rec_score_mean": 4.86,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.6912,
        "best_gem_comment": "",
        "workload_score_mean": 5.0,
        "best_gem_comment_short": "",
        "best_comment": "This class is fantastic! The content is so fascinating. Every day was super interesting and the research project really allowed me to dive into something I care about so much. Definitely a good amount of work but it is all super interesting and I loved every assignment.",
        "best_comment_short": "Definitely a good amount of work but it is all super interesting and I loved every assignment.",
        "best_comment_first": "This class is fantastic!",
        "course_id": "220528",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=61915fd2618a43a25db17bb5142e150e1e744f1f16769c0051d004acc4504bc43ba73284d3537024709e1fc76135dbed&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SPANSH 61N",
        "course_title_2025": "The Ethics of Business in Latin America",
        "course_score_mean": 5.0,
        "rec_score_mean": 4.78,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9127,
        "best_gem_comment": "",
        "workload_score_mean": 4.11,
        "best_gem_comment_short": "",
        "best_comment": "This course was great!! You learn a lot about the different human rights violations that multinational companies commit in Latin America. Truly very eye opening. In terms of assignments, the class does have a decent amount of work. You will have to do readings for each class so you can participate in the discussion, but they are usually very interesting. There are many assignments (writing workshops, oral tests, presentations) but this means each one lower–stakes and all the assignments are very doable. Assignments also usually incorporate a creative component which is nice. Overall, I thought the class was structured well and covered interesting material! I definitely recommend it!",
        "best_comment_short": "Assignments also usually incorporate a creative component which is nice.",
        "best_comment_first": "This course was great!!",
        "course_id": "127573",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=15667b0789925ce30de142d1dca667d82ede61f00b19cfb38599c62944aeccdfd0f027ace33d9a663453c0a5a9040a85&ReportType=2&regl=en-US"
    },
    {
        "course_code": "EXPOS 40",
        "course_title_2025": "Public Speaking Practicum",
        "course_score_mean": 5.0,
        "rec_score_mean": 4.92,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9371,
        "best_gem_comment": "",
        "workload_score_mean": 4.17,
        "best_gem_comment_short": "",
        "best_comment": "Nick is the BEST! His expertise is obvious in everything he does, and he gives the greatest feedback on your speeches. The class is also genuinely so much fun. I got to learn so much about my peers' interests, dreams, backgrounds, etc. just from listening to them, and I lament that my other classes don't have this great of a community. Start submitting the lottery for this class EARLY! You're going to want it by senior year!",
        "best_comment_short": "Nick is the BEST!",
        "best_comment_first": "Nick is the BEST!",
        "course_id": "125227",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=83f6f9eed14baf8ed2e50729fcdd0ea0842232212893abe09c4bc8cf38be935fd6f05b0c20692dec076725623f076c02&ReportType=2&regl=en-US"
    },
    {
        "course_code": "BIOSTAT 230",
        "course_title_2025": "Probability I",
        "course_score_mean": 5.0,
        "rec_score_mean": 4.71,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.7351,
        "best_gem_comment": "",
        "workload_score_mean": 8.5,
        "best_gem_comment_short": "",
        "best_comment": "This class is a great, practical probability course. Jeff is an extremely reasonable professor and provides a really great environment to learn the material. The workload is reasonable.",
        "best_comment_short": "Jeff is an extremely reasonable professor and provides a really great environment to learn the material.",
        "best_comment_first": "This class is a great, practical probability course.",
        "course_id": "119844",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f58fd0235f2497da71d112750cdc9a894ad82cff5c6ad741edbdd06d50e2602a15e69a6efd2ee8eaf71695945fab3f72&ReportType=2&regl=en-US"
    },
    {
        "course_code": "OEB 53",
        "course_title_2025": "Evolutionary Biology",
        "course_score_mean": 4.94,
        "rec_score_mean": 4.67,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9118,
        "best_gem_comment": "",
        "workload_score_mean": 5.11,
        "best_gem_comment_short": "",
        "best_comment": "Take this course if you have even a small, underlying interest in biology and evolution. It really helps to be passionate about this topic in order to put in the work to study. I also recommend studying decently far in advance for each exam and reading over the bullet point notes post–lecture to hold yourself accountable for the information. Prof Berry is entertaining but tends to move quickly through the material so it becomes your responsibility to develop a good, long–lasting understanding to ensure you can regurgitate the info on the exams. Other than preparing for exams, the psets and readings are manageable and the TFs are super willing to help further understanding. Overall, I recommend if you are interested in the material.",
        "best_comment_short": "Prof Berry is entertaining but tends to move quickly through the material so it becomes your responsibility to develop a good, long–lasting understanding to ensure you can regurgitate the info on the exams.",
        "best_comment_first": "Take this course if you have even a small, underlying interest in biology and evolution.",
        "course_id": "142224",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=410529c70c545da684c0861efee29ba1273892993b8c138ff1c78917be06bb3825d258895330ded96eec470bd9749389&ReportType=2&regl=en-US"
    },
    {
        "course_code": "CHEM 10",
        "course_title_2025": "Quantum, Statistical, and Computational Foundations of Chemistry",
        "course_score_mean": 4.92,
        "rec_score_mean": 4.92,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9783,
        "best_gem_comment": "",
        "workload_score_mean": 9.42,
        "best_gem_comment_short": "",
        "best_comment": "This class is fantastic!!!It is so much more accessible than what it may seem on the surface. They definitely weed out at the beginning, and you must be serious about taking this class. It is conceptually difficult, but VERY well structured, and if you’re willing to put the time in, you are 100% capable of learning. That being said, heed the prerequisites. They don’t say much about linear algebra, but I would strongly caution against taking this class without at least reviewing some linear algebra concepts first. It is also quite math and computationally heavy, relative to any chemistry courses you will likely have taken.The course staff are through and through phenomenal. Adam is a super engaging lecturer and I stayed interested for the entire period, which is rare. Section was helpful too.The only downside to this course is the lab. Yes, three hours of matlab a week is indeed that bad. The lab staff were super fun and made it livable, but it’s a rough one. You will learn a ton from labs (mainly how to stay alive and not completely crash out for 3 hours while your homemade spectrometer decides not to work). However, some of the labs were only loosely related to lecture, and when you have three midterms, and lab isn’t covered intensely, it’s hard to lock in. There is simply too much to do for the rest of the class.The final project is fun if you pick something good. You have to seek your own help, because they throw you in the deep end. When they mention a potential project topic during lecture, PAY ATTENTION. Those deadlines sneak up on you, because they also overlap with the third midterm. The third midterm was also the day after H–Y weekend, and the second was after family weekend, so keep that in mind. It does feel like you’re constantly preparing for a midterm, but with no final exam, you can’t really complain. Overall, STRONGLY RECOMMEND. You need to be committed to this class, but it will pay huge dividends. Super awesome course.",
        "best_comment_short": "Adam is a super engaging lecturer and I stayed interested for the entire period, which is rare.",
        "best_comment_first": "This class is fantastic!!",
        "course_id": "222540",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6d9841dcf829dbff8bfe8a72e28ad754623ce16ed0713d6b203856ff762f4312598ee149d5f0caf06ea21dee74080c98&ReportType=2&regl=en-US"
    },
    {
        "course_code": "PSY 1845",
        "course_title_2025": "Stigma, Discrimination, and Health",
        "course_score_mean": 4.92,
        "rec_score_mean": 4.92,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9645,
        "best_gem_comment": "",
        "workload_score_mean": 5.46,
        "best_gem_comment_short": "",
        "best_comment": "This is one of the best courses I've taken in the Psychology department! Professor H is a great lecturer and is a leader in the field of stigma, and his expertise shines through in the depth of his lectures and the care he has put into this course. Lectures are engaging and use a variety of different methods to help learning enforcement like small group discussions, in class quizzes, and short one on one debates that help to build engagement. The course is structured around a stigma a student chooses to study through the semester and provides ample opportunity to explore the aspects of the stigma students find most interesting. Nathan as a section leader is also phenomenal –– he does a great job of making students feel welcome and willing to speak up in section about potentially tender subjects around stigma and mental health. He truly cares about every student and has done a great job in facilitating discussion and intellectual openness in the course and was a key reason I looked forward to section every week.",
        "best_comment_short": "He truly cares about every student and has done a great job in facilitating discussion and intellectual openness in the course and was a key reason I looked forward to section every week.",
        "best_comment_first": "This is one of the best courses I've taken in the Psychology department!",
        "course_id": "216272",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=54dd5823e1787fc46d1cd918dc5e2da63d9d3e51291c35b983907a16947e9e1dfc79a93f1fcea0bcec5c3c2e2d8b29d7&ReportType=2&regl=en-US"
    },
    {
        "course_code": "PSY 980T",
        "course_title_2025": "Eating Disorders",
        "course_score_mean": 4.91,
        "rec_score_mean": 5.0,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9042,
        "best_gem_comment": "",
        "workload_score_mean": 4.82,
        "best_gem_comment_short": "",
        "best_comment": "Dr. Shingleton is the best!! She is an amazing teacher and person. This is a great class to take, but definitely be aware there is a lot of work towards the end of the semester. The 5 \"thought papers\" are not actually bad but would recommend doing them in the beginning of the semester as the rest of class assignments will pile up at the end.",
        "best_comment_short": "This is a great class to take, but definitely be aware there is a lot of work towards the end of the semester.",
        "best_comment_first": "Dr. Shingleton is the best!!",
        "course_id": "119717",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ca975c93169ab3335acfd03747a16da63aae44686ecd29aa38070648ebfa78245ea10c0c8bc5cc9a2cae679c4ac4bdd9&ReportType=2&regl=en-US"
    },
    {
        "course_code": "PHYSICS 245",
        "course_title_2025": "Particle Physics",
        "course_score_mean": 4.9,
        "rec_score_mean": 5.0,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.6249,
        "best_gem_comment": "",
        "workload_score_mean": 8.88,
        "best_gem_comment_short": "",
        "best_comment": "Girma's 245 is awesome! It gives a nice overview of particle physics without drowning you in too much math, which was just the right amount for me (as someone who won't be pursuing particle physics but has always been curious about it). All the assignments are reasonable and low–stress, and the final project was actually quite fun to put together.",
        "best_comment_short": "Girma's 245 is awesome!",
        "best_comment_first": "Girma's 245 is awesome!",
        "course_id": "133281",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=11dccd7dc2e7cfe7556b5f4f50ef6ae4b3761a06330d5579ca3c635e69453fbc7e5d2cf75b5346839d5647a993f2ecb2&ReportType=2&regl=en-US"
    },
    {
        "course_code": "CHNSE 120A",
        "course_title_2025": "Intermediate Modern Chinese",
        "course_score_mean": 4.89,
        "rec_score_mean": 4.67,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8682,
        "best_gem_comment": "",
        "workload_score_mean": 7.89,
        "best_gem_comment_short": "",
        "best_comment": "I am going to focus this review on things first–year students who have placed into Chinese 120a should know. I feel that this is a very good but rather challenging class, especially as a first–year. The workload is equivalent to a pset class, as you have a weekly homework assignment that takes time. On the homework, do the extra credit every single time. It takes only 5 minutes but it will make a huge difference for your grade. There is also a quiz every single Tuesday and Thursday, which covers content for the NEXT lesson (not the previous one). Keep this in mind when you consider your workload and which classes you want to take. The assignments are very much focused on reading, writing, and grammar. I came from a conversationally–focused Chinese program in high school, so this was a big shift for me. If you don't feel confident in your reading and writing (typing) abilities, I would suggest taking Ba or Bb if you want a less demanding experience.  The project is worth a significant proportion of your grade, so do not blow it off. If you use it as an opportunity to genuinely learn about Chinese culture,  you will love it!Do not be discouraged if you perform poorly on the review tests or midterm. They are very hard but  there are plenty of other assignments and  extra credit opportunities to help your grade. The final exam is very hard, too. The instructors are all incredible teachers and care so deeply about their students' success in this class. I cannot say enough good things about them. They are always willing to help, and also make class into a fun environment. A highlight was the tea party they had for us. Because I took a very challenging set of classes this semester, there is a small part of me that wishes I took a lower level class. However, I am ultimately glad I took 120a because I truly learned so much and had a great experience thanks to the instructors. Overall, if you decide to take this class, you will have to work hard but you will have a great time while doing it and also make some great friends along the way.",
        "best_comment_short": "Overall, if you decide to take this class, you will have to work hard but you will have a great time while doing it and also make some great friends along the way.",
        "best_comment_first": "I am going to focus this review on things first–year students who have placed into Chinese 120a should know.",
        "course_id": "113793",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=379560aa91ff77359d80d688216ed00930af67387e30862dee069b1bc7abab15515538c75a58b9884f95c1ef2b6d6e3f&ReportType=2&regl=en-US"
    },
    {
        "course_code": "CHEM 246",
        "course_title_2025": "Advanced Statistical Mechanics: Frontiers in Research",
        "course_score_mean": 4.88,
        "rec_score_mean": 4.57,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.4099,
        "best_gem_comment": "",
        "workload_score_mean": 4.29,
        "best_gem_comment_short": "",
        "best_comment": "Would highly recommend! The problem sets, while difficult, are not numerous (only 2 this year) and were pretty enriching. The paper assignments are fairly easy but also really helpful in the context of lectures, which tended to be more abstract. The final project was really fun to think about and there was a lot of support for it–Prof. Shakhnovich is a great teacher who was always willing to meet and discuss my ideas.",
        "best_comment_short": "The final project was really fun to think about and there was a lot of support for it–Prof.",
        "best_comment_first": "Would highly recommend!",
        "course_id": "222893",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2868d321a18934773c3764ca13ef3ffb912d82656107841fc003078d32a130cb30c56551ef5b429734f82639ed0c67b4&ReportType=2&regl=en-US"
    },
    {
        "course_code": "CHNSE BX",
        "course_title_2025": "Elementary Chinese for Advanced Learners",
        "course_score_mean": 4.88,
        "rec_score_mean": 5.0,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9163,
        "best_gem_comment": "",
        "workload_score_mean": 4.5,
        "best_gem_comment_short": "",
        "best_comment": "This is an excellent course and the course heads are fabulous and super enthusiastic with teaching Chinese. I highly recommend taking this course! Super supportive team.",
        "best_comment_short": "This is an excellent course and the course heads are fabulous and super enthusiastic with teaching Chinese.",
        "best_comment_first": "This is an excellent course and the course heads are fabulous and super enthusiastic with teaching Chinese.",
        "course_id": "120305",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0fe16494c8a86959c316a573436c05c86761814c54c772bc7c38130ea0729762b428006669b3935ba035f99484a9e9da&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SOCIOL 1297",
        "course_title_2025": "Housing and Homelessness",
        "course_score_mean": 4.88,
        "rec_score_mean": 4.65,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8999,
        "best_gem_comment": "",
        "workload_score_mean": 4.06,
        "best_gem_comment_short": "",
        "best_comment": "Definitely take this class! Joey is an amazing instructor and the class discussions were always so interesting. I really enjoyed the reading materials, they were all super different and mixed a lot of different methods \/ perspectives. It's also not too much work or reading at all which is great. (Be sure to do the readings though, the class is all discussion so it'd be pretty obvious). Highly recommend this course, no sociology background necessary!",
        "best_comment_short": "I really enjoyed the reading materials, they were all super different and mixed a lot of different methods \/ perspectives.",
        "best_comment_first": "Definitely take this class!",
        "course_id": "224436",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6773fcdd33175567e8872c12a7a5306ba0dd354ef245a39f597574fd71211f2e65764dd7c95a8587074d130eed3f51a2&ReportType=2&regl=en-US"
    },
    {
        "course_code": "RUSS BA",
        "course_title_2025": "Intermediate Russian I",
        "course_score_mean": 4.86,
        "rec_score_mean": 4.86,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9333,
        "best_gem_comment": "",
        "workload_score_mean": 11.71,
        "best_gem_comment_short": "",
        "best_comment": "I LOVED this course. Russian was the highlight of my day – I knew I would always come out knowing more than when I came in. Professor Clancy, as a foreigner who learned Russian from scratch, is incredibly helpful when it comes to memorization techniques and understanding the grammar. Jenya is amazing at getting everyone to talk in section – she’s really made me more confident about speaking.If you put in the work, you will get a good grade and I guarantee that you will learn an insane amount of Russian. Best of all worlds. I cannot recommend this class strongly enough.",
        "best_comment_short": "Jenya is amazing at getting everyone to talk in section – she’s really made me more confident about speaking.If you put in the work, you will get a good grade and I guarantee that you will learn an insane amount of Russian.",
        "best_comment_first": "I LOVED this course.",
        "course_id": "112823",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e60b2926e3125a80d5b3b7cf4f81259b31f9624fd24e35502cd621afcdd4043e812cb76707406a033c72f7feccd69cfd&ReportType=2&regl=en-US"
    },
    {
        "course_code": "TAM 101A",
        "course_title_2025": "Elementary Tamil",
        "course_score_mean": 4.86,
        "rec_score_mean": 4.57,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.91095,
        "best_gem_comment": "",
        "workload_score_mean": 5.71,
        "best_gem_comment_short": "",
        "best_comment": "This is a great class. Prof is super super kind and understanding, and encourages you to learn the language at your own pace. Course is certainly fast–moving, and assignments can be slightly more time–consuming than you expect. Class itself is often fun and engaging, though the cold call reading and speaking can be a bit nerve–wracking. The 9am course time is difficult morale–wise, but definitely don't miss classes because catching up on missed material is a challenge. Overall, definitely recommend to those who are interested in getting a stronger foundation in the language!",
        "best_comment_short": "Prof is super super kind and understanding, and encourages you to learn the language at your own pace.",
        "best_comment_first": "This is a great class.",
        "course_id": "127491",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=89da5641a931c67d6560bfb978af49d5b4f67ae3247021c002c1bebca37bd24c654dd0376113584d9aa22efa425a6c79&ReportType=2&regl=en-US"
    },
    {
        "course_code": "HEB 99A",
        "course_title_2025": "Tutorial - Senior Year",
        "course_score_mean": 4.86,
        "rec_score_mean": 5.0,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.4019,
        "best_gem_comment": "",
        "workload_score_mean": 7.0,
        "best_gem_comment_short": "",
        "best_comment": "Seek individualized support from the professors or you won't get much out of it",
        "best_comment_short": "Seek individualized support from the professors or you won't get much out of it",
        "best_comment_first": "Seek individualized support from the professors or you won't get much out of it",
        "course_id": "122595",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=49c1629b8108b5a5a4563f3ba6300e4a1e128be338b2dedb2ff0ec8c8ae7229a53923024d9ac36300c8d3f543cad22f4&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SOC-STD 98PM",
        "course_title_2025": "Political Myth",
        "course_score_mean": 4.86,
        "rec_score_mean": 4.43,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9194,
        "best_gem_comment": "",
        "workload_score_mean": 5.86,
        "best_gem_comment_short": "",
        "best_comment": "I strongly recommend this course!! Professor Mueser is so smart and great at facilitating conversation, he did a good mix of lecturing and letting us talk. He provided a lot of guiding assignments throughout the semester to make the final paper easier. He's also very accessible and encourages frequently meeting with him for office hours. The subject matter is very interesting.",
        "best_comment_short": "Professor Mueser is so smart and great at facilitating conversation, he did a good mix of lecturing and letting us talk.",
        "best_comment_first": "I strongly recommend this course!!",
        "course_id": "225033",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d04faf1bece265587ecd7e2ad82097e3b058da17093d504ed684951fdbf3ce54b8556890f293f5f301f3e3e50c7ea8e1&ReportType=2&regl=en-US"
    },
    {
        "course_code": "PSY 1031",
        "course_title_2025": "Psychology in the Classroom",
        "course_score_mean": 4.85,
        "rec_score_mean": 4.86,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9593,
        "best_gem_comment": "",
        "workload_score_mean": 5.93,
        "best_gem_comment_short": "",
        "best_comment": "this is an awesome course! i took this as someone who is not a psych major and is mostly involved in teaching as a CA. the class is a great way to meet a lot of other students who have very different opinions and experiences on how teaching works, which is really valuable. Prof. Levari is also a blessing; she's very helpful and is always available to talk. The policy papers are also a great way to think about how you would also want to design your own educational policies. overall a great course even if you don't have psych background",
        "best_comment_short": "the class is a great way to meet a lot of other students who have very different opinions and experiences on how teaching works, which is really valuable.",
        "best_comment_first": "this is an awesome course!",
        "course_id": "220248",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6ec6b8d3d1d0823ea1594c0c2ed9dd14813481ee4cc8a17d396fe1885068c47bfb910c0d047b456311418e5f95669d9a&ReportType=2&regl=en-US"
    },
    {
        "course_code": "MUSIC 189R",
        "course_title_2025": "Chamber Music Performance",
        "course_score_mean": 4.84,
        "rec_score_mean": 4.86,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.91725,
        "best_gem_comment": "",
        "workload_score_mean": 4.42,
        "best_gem_comment_short": "",
        "best_comment": "Classical musicians looking to play great rep in a formal setting, especially if you want to play with friends—take this class! Such a great opportunity to be mentored by amazing musicians (Parker Quartet is wonderful, Mia Chung is actually just so great), and it's really fun to do music seriously with other people who will take it just as seriously as you. It's certainly a time investment (esp. if you're a piano player), but I think super worth it. There's a reason why people repeatedly do 189R.",
        "best_comment_short": "Such a great opportunity to be mentored by amazing musicians (Parker Quartet is wonderful, Mia Chung is actually just so great), and it's really fun to do music seriously with other people who will take it just as seriously as you.",
        "best_comment_first": "Classical musicians looking to play great rep in a formal setting, especially if you want to play with friends—take this class!",
        "course_id": "153042",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=cb92d5617cd91a40cbc6ebd84809029db44d7aa5d5c622e42048b4f11af828906dbd3766ecfc87ed961425e0e28fcea2&ReportType=2&regl=en-US"
    },
    {
        "course_code": "MBB 980P",
        "course_title_2025": "The Role of Music in Health and Education",
        "course_score_mean": 4.83,
        "rec_score_mean": 4.83,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9352,
        "best_gem_comment": "",
        "workload_score_mean": 5.17,
        "best_gem_comment_short": "",
        "best_comment": "AMAZING COURSE PLEASE TAKE!!! this course was probably my favorite course I've taken so far. Get your foot in the door for course applications early, because the class is very competitive. Dr. Wong and Ayelet are the most fascinating, knowledgable, talented, and caring people I've ever met. Both of them have more accolades than I can count on two hands, and they were able to foster a wonderful community in the classroom. The content you will learn in this class is something so special, you will not find a curriculum like this outside of this class. There were 30–50 ish pages of reading per week, and an amazing guest speaker would come in for part of each class to talk about their special relationship to music. Everyone in the class is basically a pre–health musician. This class reminded me I go to Harvard –– every single student had some beautiful niche talent that was captivating and so cool. AGAIN PLEASE TAKE!",
        "best_comment_short": "Dr. Wong and Ayelet are the most fascinating, knowledgable, talented, and caring people I've ever met.",
        "best_comment_first": "AMAZING COURSE PLEASE TAKE!!!",
        "course_id": "205158",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ffc3e35b133594bbe5008459db7a0a0761f2ac24e53e79db89fb792079509c074750d7981bdd864eee7f61050e2d4e49&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ASTRON 311",
        "course_title_2025": "Astrophysics Writing Intensive",
        "course_score_mean": 4.83,
        "rec_score_mean": 5.0,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.5347,
        "best_gem_comment": "",
        "workload_score_mean": 5.4,
        "best_gem_comment_short": "",
        "best_comment": "This is a great way to help yourself finish a research paper.",
        "best_comment_short": "This is a great way to help yourself finish a research paper.",
        "best_comment_first": "This is a great way to help yourself finish a research paper.",
        "course_id": "224326",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=cce693d3fdba21c24811d0f426d67550cba62b999de1ed03d34606c1173895e2d18f06e43b7cd3e881387d87dcf894f6&ReportType=2&regl=en-US"
    },
    {
        "course_code": "VIETNAM 130A",
        "course_title_2025": "Pre-Advanced Vietnamese",
        "course_score_mean": 4.83,
        "rec_score_mean": 4.83,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9217,
        "best_gem_comment": "",
        "workload_score_mean": 4.17,
        "best_gem_comment_short": "",
        "best_comment": "Have a strong foundation of Vietnamese to build off of the content learned in this course. Have an open mind about the many different topics, and they will bring great interests to you! Also come to Viet tables. They are excellent sources of Viet practice and cultural sharing.",
        "best_comment_short": "They are excellent sources of Viet practice and cultural sharing.",
        "best_comment_first": "Have a strong foundation of Vietnamese to build off of the content learned in this course.",
        "course_id": "116271",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=13688aebd1c7f5846b692196df35461067c51f8134bc92b2fe7af055c179a28e62d293f417670e3a8e6ad0e0160fe3e2&ReportType=2&regl=en-US"
    },
    {
        "course_code": "HIST-LIT 90GT",
        "course_title_2025": "World War II in Image, Text, and Sound",
        "course_score_mean": 4.82,
        "rec_score_mean": 4.82,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8685,
        "best_gem_comment": "",
        "workload_score_mean": 5.27,
        "best_gem_comment_short": "",
        "best_comment": "This course was very well run and I greatly enjoyed it. Dr. Riegel is a great teacher and I highly recommend taking any course that they teach. This course was great for a variety of reasons. The first was that the materials were interesting and well put together. The organization of the syllabus week by week also made it so the class was always talking about something new and it was well organized to lead from one theme to the next. The papers were also varied in the skills they targeted which made them more interesting to write (a primary source analysis, a film review, a research paper). I was grateful for the flexibility provided in what we could write about for each paper and the ability to guide discussions in class to those readings and topics we found most interesting. Dr. Riegel makes a 2 hour seminar feel like it goes by so fast because of all of the great discussions they lead. They are really good at guiding the discussion and answering questions, as well as including multimedia sources to keep the class interested. I am not someone who is very talkative in sections usually but found myself encouraged to share my ideas and that made this class even better. Overall, a great experience and I would take this course or any other taught by Dr. Riegel no matter your concentration.",
        "best_comment_short": "I am not someone who is very talkative in sections usually but found myself encouraged to share my ideas and that made this class even better.",
        "best_comment_first": "This course was very well run and I greatly enjoyed it.",
        "course_id": "224366",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d3a92236ee3941aaa8c974121b9ce1c4f8492033bf7eb073bba6ae0ff023f9caaa8e21cc660050ee07ada4a961498141&ReportType=2&regl=en-US"
    },
    {
        "course_code": "JAPAN BA",
        "course_title_2025": "Elementary Japanese",
        "course_score_mean": 4.82,
        "rec_score_mean": 5.0,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8882,
        "best_gem_comment": "",
        "workload_score_mean": 9.4,
        "best_gem_comment_short": "",
        "best_comment": "Japanese BA is the best class I took this semester!! Kageyama–sensei, Nakatani–sensei, and Matsumoto–sensei all make the classes are so interesting that I want to wake up for it, and it is a great start to my day. They make the content digestible and fun. Besides class, there are SO MANY activities from the Japanese language program\/ RIJS, and the class has a great community too –– I made more friends in Japanese than any other classes. I was a little scared before taking Japanese BA because many people have said the introductory level language classes at Harvard can be a lot, but I think this class is very manageable and fun. I do recommend that the summer before one could preview hiragana\/katakana as I did which will make everything so much easier. And from my friends' perspective, it seems not all other languages are as enjoyable and chill as Japanese, so if you are interested please don't hesitate in trying!",
        "best_comment_short": "And from my friends' perspective, it seems not all other languages are as enjoyable and chill as Japanese, so if you are interested please don't hesitate in trying!",
        "best_comment_first": "Japanese BA is the best class I took this semester!!",
        "course_id": "111193",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=83cdba784300a1bcee3f73dd818c60ee41b64358a83dc45f86e5c67ba676ead8714a09c5e6e3eb83a6bafb06e504f1f1&ReportType=2&regl=en-US"
    },
    {
        "course_code": "FYSEMR 35N",
        "course_title_2025": "The Art and Craft of Acting",
        "course_score_mean": 4.82,
        "rec_score_mean": 4.82,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9326,
        "best_gem_comment": "",
        "workload_score_mean": 4.27,
        "best_gem_comment_short": "",
        "best_comment": "PLEASE take this class! Whether you have taken years of acting classes, or this is your first one, I promise that Remo will teach you something new and in an engaging way. Though they are a bit time–consuming and sometimes inconvenient, the plays we went to see every other week were AMAZING. I especially loved Sojourners, it was my favorite play that I've ever seen and I would have never been exposed to it had it not been for Remo and this class.",
        "best_comment_short": "I especially loved Sojourners, it was my favorite play that I've ever seen and I would have never been exposed to it had it not been for Remo and this class.",
        "best_comment_first": "PLEASE take this class!",
        "course_id": "126838",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ace820989628962403febe5fc2e1685802a3f0e64b7aba495685986125cc7fc8000d61bf238d61936b83db19d4baf9d4&ReportType=2&regl=en-US"
    },
    {
        "course_code": "MODMDEST 158A",
        "course_title_2025": "Modern Arabic Literature Seminar: Displacements in Mod. Arabic Lit",
        "course_score_mean": 4.8,
        "rec_score_mean": 4.7,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9516,
        "best_gem_comment": "",
        "workload_score_mean": 6.33,
        "best_gem_comment_short": "",
        "best_comment": "Take this class! It was one of the most rewarding classes I've taken at Harvard. I grew in so many aspects and appreciated all the texts we engaged in. The structure of the class encourages discussion and it feels more like a conversation than section. Also Prof. Nader is amazing and always makes class exciting and engaging. I really recommend you take this course with him!",
        "best_comment_short": "Also Prof. Nader is amazing and always makes class exciting and engaging.",
        "best_comment_first": "Take this class!",
        "course_id": "156227",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=403e22463db4598c38eab4b2b6ec564ea151c09842ac33fd7ee6dc7c0b656a0416cb39acc634927bf282f530d4f0abea&ReportType=2&regl=en-US"
    },
    {
        "course_code": "PHYSICS 287A",
        "course_title_2025": "Introduction to String Theory",
        "course_score_mean": 4.8,
        "rec_score_mean": 4.4,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.6816,
        "best_gem_comment": "",
        "workload_score_mean": 18.25,
        "best_gem_comment_short": "",
        "best_comment": "Xi is an excellent teacher –– the lectures were engaging and well–motivated, and presented difficult content in an understandable way without sacrificing important technicalities. I did find the course to be a large time commitment though.",
        "best_comment_short": "Xi is an excellent teacher –– the lectures were engaging and well–motivated, and presented difficult content in an understandable way without sacrificing important technicalities.",
        "best_comment_first": "Xi is an excellent teacher –– the lectures were engaging and well–motivated, and presented difficult content in an understandable way without sacrificing important technicalities.",
        "course_id": "111191",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=49365476953d7b0507fc11e415d39b96660a3fe5da50736a1cd7ea35295710a7874296c8eaef25ac6ed382a413f196cf&ReportType=2&regl=en-US"
    },
    {
        "course_code": "FYSEMR 21W",
        "course_title_2025": "Research at the Harvard Forest—Global Change Ecology: Forests, Ecosystem Function, the Future",
        "course_score_mean": 4.8,
        "rec_score_mean": 4.9,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9808,
        "best_gem_comment": "",
        "workload_score_mean": 7.2,
        "best_gem_comment_short": "",
        "best_comment": "If you are interested in climate change, global change, ecology, forests, carbon, or the history of New England's landscape, TAKE THIS CLASS!!!!!This is by far one of the best and most interesting classes I have ever taken! Besides the extremely interesting content of the class, the class itself was an incredible experience. You get to go to the forest, stay in a really nice house, and bond with 9 other students for a whole weekend, three times throughout the semester. These weekends served as extremely nice and relaxing breaks from the rest of the semester, and I still got a lot of work done for other classes at night while there. The group was great and had some of the nicest people I've met on campus, and since you will all share similar interests if you are in this class, there are endless things to talk about with the group. I personally found some great friends in the class, people who I will hopefully stay close with throughout the rest of my 4 years at Harvard. Additionally, as for the class itself, it was the best learning environment I have ever seen in a class. It provided an extremely immersive learning environment where we were enabled not only to be much more interested in what we learned, but we could have a dialogue about each topic and ask further questions about things that were not necessarily pointed out to us, since we were in an immersive environment where our own observations were appreciated and adapted into the fluently shifting yet curriculum–based conversations. We got to see real, clear evidence of global change, learn why and how it happened, and how it can be mitigated or better understood through experiments that were occurring. The content was super interesting and I had some great conversations with Dave and the rest of the class about climate change and just anything that came up in conversation. It really helped me to see that there absolutely is a lot we can do about climate change, and inspired me even more to pursue research in my future. I think I understand global change, forests, and ecology much more than ever before as a result of this class, as there is just so much content, and it is provided in a very digestible and engaging manner.Dave is also great and such a knowledgeable guy, and is typically able to answer just about any question that the students ask him. I truly encourage all to apply for and take this course, it was seriously the best class I had this semester and an incredible introduction to Harvard.",
        "best_comment_short": "The content was super interesting and I had some great conversations with Dave and the rest of the class about climate change and just anything that came up in conversation.",
        "best_comment_first": "If you are interested in climate change, global change, ecology, forests, carbon, or the history of New England's landscape, TAKE THIS CLASS!!!!",
        "course_id": "112349",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6e43f748af9d7d1c13b56f83400e0e90bd52599e87aadb80955e63ed19fa08a5deda9d9969329059b8acc0e214ece489&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ENGLISH CBBR",
        "course_title_2025": "Intermediate Poetry: Workshop",
        "course_score_mean": 4.8,
        "rec_score_mean": 4.8,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9052,
        "best_gem_comment": "",
        "workload_score_mean": 5.1,
        "best_gem_comment_short": "",
        "best_comment": "TAKE THIS CLASS if you like to write poetry! If you're looking for an opportunity to develop your style and get feedback on poems EVERY SINGLE WEEK, take this class! Getting to read peer poems, getting peer and professor review and crit was so amazing and so beneficial to my writing. By the end of the course, I could tell whether the poem I was bringing to the table was strong or not, I could tell as I was writing what feelings my imagery would inflict, whether something was too hard to understand or too on the nose. One of my friends told me that she could see the affect of the workshop on my work before, during, and after I was taking it – it is tangibly stronger than it was before!! So much progress in one semester. Take this.",
        "best_comment_short": "Getting to read peer poems, getting peer and professor review and crit was so amazing and so beneficial to my writing.",
        "best_comment_first": "TAKE THIS CLASS if you like to write poetry!",
        "course_id": "146632",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=758806eb98c4e589e894d8109151201c5d8bffa591f72656bfbd88b9da35259ff51389452524bb0f77a8f8ed25f81a41&ReportType=2&regl=en-US"
    },
    {
        "course_code": "WOMGEN 1209",
        "course_title_2025": "Dangerous Words: Feminist Debates on Speech, Harm, and Representation",
        "course_score_mean": 4.8,
        "rec_score_mean": 4.67,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9389,
        "best_gem_comment": "",
        "workload_score_mean": 5.78,
        "best_gem_comment_short": "",
        "best_comment": "i loved this class. in my opinion the best class ive taken at harvard. the readings and discussion was so interesting and informative and i really felt like. learned a lot. the readings can be a little challenging and dicussion can be overwhelming because of the rigor, but such a good experince. BEST class ive taken so far. the professor is also super understanding. you will get a lot from this class.",
        "best_comment_short": "the readings and discussion was so interesting and informative and i really felt like.",
        "best_comment_first": "i loved this class.",
        "course_id": "218527",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=26b71249bf198386e20a5e746af49592000597a17c4bd0e01cb832810a7d24f7ea0a7bc7c12b6c61ba5427f44677afe4&ReportType=2&regl=en-US"
    },
    {
        "course_code": "HIST 1936",
        "course_title_2025": "The Rights of Nature",
        "course_score_mean": 4.79,
        "rec_score_mean": 4.79,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.972,
        "best_gem_comment": "",
        "workload_score_mean": 5.21,
        "best_gem_comment_short": "",
        "best_comment": "This class is awesome. If you are at all interested in protecting nature or law, this class is a must. It's one of the most creative courses I've taken at Harvard. It was awesome to not only learn from the professors but other law students themselves. Professors Lepore and Salzman are great, and they cover super interesting yet complimentary content. I was always super engaged in lecture and looked forward to it every week. The course does have a decent workload –– readings can be long, and there are substantive assignments throughout the semester. But it was nothing unmanageable. The professors make themselves really accessible to their students. The class definitely had some hiccups, mostly because it's a new class. But even with the hiccups, this class is one of the best classes I've taken at Harvard (and I'm a senior). Highly recommend.",
        "best_comment_short": "Professors Lepore and Salzman are great, and they cover super interesting yet complimentary content.",
        "best_comment_first": "This class is awesome.",
        "course_id": "224205",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b5f1b8d9774fa9de4693d5a8c3ebed57a6aaed635438c0cf68fd5445440698246ec1ece89168e73ae7aac618e2edc570&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SPANSH 70",
        "course_title_2025": "Introduction to Latin American Studies: Aesthetics, Politics, and Anxieties",
        "course_score_mean": 4.79,
        "rec_score_mean": 4.86,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.936,
        "best_gem_comment": "",
        "workload_score_mean": 5.14,
        "best_gem_comment_short": "",
        "best_comment": "This class is one of my favorites ever at Harvard! Professor Vela Martinez and TF Andrea made this course so great. We had very insightful discussions studying what defines \"Latin America\" and the politics and anxieties that accompany this ambiguous definition. These questions are extremely difficult to answer, but they were able to guide our discussions and make them productive by doing close reading and analyzing a variety of works, including novels, short stories, poetry, movies, etc. I loved the course curriculum and everything we read and studied allowed me to broaden my view of Latin America and post–colonial anxieties while improving my close reading and analysis skills. I felt very safe to speak my opinions in class as the environment was very conducive to the sharing of ideas. I think that the rubrics were very fair and clearly defined expectations for our work. I also really enjoyed the liberty we were given throughout the semester project! I had the opportunity to explore a topic that is very personal to me and apply the topics we learned. You will definitely love this class!",
        "best_comment_short": "I also really enjoyed the liberty we were given throughout the semester project!",
        "best_comment_first": "This class is one of my favorites ever at Harvard!",
        "course_id": "116263",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4d9229c6415fa30810629b70cfbe3065fb5c1af1c71ac864428cbcc5f55149d8f882d6b2180f1857aa0fca8e80b139c9&ReportType=2&regl=en-US"
    },
    {
        "course_code": "MATH 25A",
        "course_title_2025": "Theoretical Linear Algebra and Real Analysis I",
        "course_score_mean": 4.78,
        "rec_score_mean": 4.67,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9769,
        "best_gem_comment": "",
        "workload_score_mean": 15.35,
        "best_gem_comment_short": "",
        "best_comment": "TAKE MATH 25A. I was on the fence between 22\/25\/55 but am so happy that I chose to take 25. For context, going into the class, I did not know how to write proofs, had some linear algebra background, and was an AIME qualifier. The class was difficult but very manageable and taught me so much about mathematical thinking. I had no idea I would enjoy theoretical math so much. Wes is an amazing lecturer and clearly cares a lot about his students. I heard a lot about the 55 community but I genuinely think the 25 community is way better. Our class is half the size (around 20 students), so everyone knows each other and I've made some really good friends through this course. The CAs are so good and helpful and chill.However, this class is a big time commitment. If you want to explore a million things in your first semester here, you might want to consider a different course. Also, exams are really hard and there is no curve, so take into consideration how comfortable you are with taking timed tests before choosing 25. If you are on the fence, I would recommend starting in 25 and dropping down to 22 if you think its not for you. 22 is a LOT easier but its a much larger class and you will learn a lot less.",
        "best_comment_short": "Wes is an amazing lecturer and clearly cares a lot about his students.",
        "best_comment_first": "TAKE MATH 25A.",
        "course_id": "110808",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=98748707924686df509c94d89043f1eec58030505c83de55b7d8586613602ca934055ccfa6d71656edd280d99005a4c9&ReportType=2&regl=en-US"
    },
    {
        "course_code": "HIST-LIT 90BR",
        "course_title_2025": "Work and Labor Across the Americas",
        "course_score_mean": 4.78,
        "rec_score_mean": 4.56,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8473,
        "best_gem_comment": "",
        "workload_score_mean": 6.0,
        "best_gem_comment_short": "",
        "best_comment": "PLS TAKE THIS COURSE. Professor Hogan is such a delight! He's super funny, intelligent, and thoughtful about the course's readings, discussions, and assignments. The course itself is really interesting. You definitely get the opportunity to reflect on the connections between labor and meaning, as well as learn about different labor systems throughout the Americas. There's a really good and diverse focus on both North American and Latin America, as well as some details even about trans–Atlantic trades and industrialization in Europe. The course is also pretty evenly covers lots of different time periods, from the 1100s all the way up to present day. This was a really great experience and I can't reccommend taking this course enough!",
        "best_comment_short": "He's super funny, intelligent, and thoughtful about the course's readings, discussions, and assignments.",
        "best_comment_first": "PLS TAKE THIS COURSE.",
        "course_id": "159793",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=62aa42650ff3fc5813631c7c5957c5207457761d05d3b06c1e957e1386097d8f3a59feafcbc7f6d122585b45d8f1ceb0&ReportType=2&regl=en-US"
    },
    {
        "course_code": "FYSEMR 64I",
        "course_title_2025": "Looking for Clues. Ancient and Medieval Art @ Harvard",
        "course_score_mean": 4.78,
        "rec_score_mean": 4.89,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9393,
        "best_gem_comment": "",
        "workload_score_mean": 4.22,
        "best_gem_comment_short": "",
        "best_comment": "Take it!!!!!!!!!! This course perfectly exemplifies what we came to Harvard for. Each seminar is brilliantly crafted with meaningful discussions and plethoras of relevant centerpiece objects that change every week. In few other contexts does one have the opportunity to interact with so many priceless artifacts of Mesopotamia, ancient Greece and Egypt, and pre–Columbian indigenous civilizations. Professor Georganteli is EXCELLENT. Her expertise is astounding and her passion for the subject unquestionable, yet she is also humble enough to take genuine interest in each of her students and their passions. She welcomed us to lengthy office hours, where she would always greet us with treats and lively discussion. I literally went to her office hours to discuss personal problems on several occasions. And did I mention that she took the class out for croissants and a guided MFA trip?????",
        "best_comment_short": "Her expertise is astounding and her passion for the subject unquestionable, yet she is also humble enough to take genuine interest in each of her students and their passions.",
        "best_comment_first": "Take it!!!!!!!!!!",
        "course_id": "224626",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=66372f73d5f7dc993bc79f69f68dfa93a30446a62a42279b6826d598488794d524fabf2f874539cbeaf1fa1139b9f2b0&ReportType=2&regl=en-US"
    },
    {
        "course_code": "WOMGEN 1217",
        "course_title_2025": "Psychology of the Gendered Body",
        "course_score_mean": 4.78,
        "rec_score_mean": 4.78,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.96355,
        "best_gem_comment": "",
        "workload_score_mean": 4.67,
        "best_gem_comment_short": "",
        "best_comment": "This is the best class I have taken at Harvard when I balance my enjoyment of it and what I come away having learned. It is not a walk in the park because there are weekly graded response papers to the readings, but the readings are interesting and important. Dr Noll is the best teacher I have ever had. She is genuine, understanding, brilliant, and so incredibly invested in her students. If you have any interest in gender theory or the psychology of the body you should most definitely take this class. I felt like I bonded with my fellow students and developed a real understanding of the material from multiple perspectives. I loved this course, and I feel prepared to use the information in other classes. I can not describe what an excellent learning environment this was. Dr. Noll allows you to learn and participate in your own way, as yourself, and I feel as though she truly knows me as a student and a person now. I believe she will have been the teacher who most impacts my view on what it truly means to teach.",
        "best_comment_short": "This is the best class I have taken at Harvard when I balance my enjoyment of it and what I come away having learned.",
        "best_comment_first": "This is the best class I have taken at Harvard when I balance my enjoyment of it and what I come away having learned.",
        "course_id": "205489",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e65ea44c5edffb6b63ac7e303579fe34bff5ce73eabb61ef43183f303538b643df5f1a389fc0d5234282c68dcf4aa037&ReportType=2&regl=en-US"
    },
    {
        "course_code": "FYSEMR 33X",
        "course_title_2025": "Complexity in Works of Art: Ulysses and Hamlet",
        "course_score_mean": 4.75,
        "rec_score_mean": 4.71,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9872,
        "best_gem_comment": "",
        "workload_score_mean": 6.0,
        "best_gem_comment_short": "",
        "best_comment": "Complexity has set the bar for humanities at Harvard incredibly high. This is the most transformative and enlightening academic experience I have ever had, and I doubt that it can be surpassed (though I wholeheartedly hope that it will). I cannot recommend this class enough. I mean it. I do not know how to convey just how much I loved this course. I cannot be more grateful to have ended up in this class – it's the best thing that has happened to me academically and I will do my best to convey why it is such a special course.Complexity realizes the full potential of what a First Year Seminar can be. A First–Year Seminar is a pass\/fail course, which means that you should treat the course as if the grade was completely irrelevant. For some, it may mean that you can put in a minimal amount of work to get by. If this is what you expect, you should consider another course. Not having a lettered grading scale offers the opportunity for you to learn for the sake of learning: there is no upper limit to how much work you can put into this course. There is no assurance of \"having done enough\" that an \"A\" offers. This is a class where how much you put in is how much you get out of it. I mean this in the best sense possible – as long as you are willing to put in the work, there is simply no limit to the amount of intellectual gratification you can get out of this course. That's why I appreciated this course so much. I spent an average of ten hours per week on this course; it is my biggest time commitment of the term. I can say that every single ounce of effort I put into it was worth it. My point is that you should take this course if and only if: 1) you are passionate about the content, 2) you are willing to learn for the sake of learning, and 3) you are willing to put a lot of work into it because you enjoy learning.What makes Professor Fisher and Complexity phenomenal is his willingness to treat you as an intellectual equal and his care. From the very first week of class, the guiding questions were complex and they never stopped being complex. One can build a course based on the questions listed in each week's handout alone. Professor Fisher does not dumb down the content so that you can understand; he presents Hamlet and Ulysses in their full complexity and thereby illustrates their greatness and their full interpretative potential. Each weekly lecture was the highlight of my week. Professor Fisher cares a lot about the content, and he gets you to care, too. I would always walk away feeling ineffably inspired, even if I had spent the night before writing my response paper until 5 AM. The lectures were so engaging and for the lack of a better term, so, so, so intellectually stimulating. It is truly a privilege to be able to take this course, and knowing that this course has ended makes me feel very sad.Professor Fisher also provides very helpful feedback on your weekly response papers. His detailed annotation of my weekly response papers motivated me to push myself to write better and gave me the critical perspective I needed to do so. That alone makes taking the course worth it. Furthermore, I have also gained so many invaluable insights into literature and into what I want to do with my undergraduate years from talking to him during his office hours. Again, I cannot overstate my appreciation.As a cherry on top, you will also be reading Hamlet and Ulysses, some of the greatest works of art ever created. I had no idea what Ulysses was before I started and I will never regret reading it. But if I hadn't read it with the guidance of this course, I do not think I would have been able to get nearly as much out of it as I did; Ulysses is, as Professor Fisher says, a scholarly book that is best read in an academic setting. If anything I said resonates with what you want academically, you should take this class.",
        "best_comment_short": "My point is that you should take this course if and only if: 1) you are passionate about the content, 2) you are willing to learn for the sake of learning, and 3) you are willing to put a lot of work into it because you enjoy learning.What makes Professor Fisher and Complexity phenomenal is his willingness to treat you as an intellectual equal and his care.",
        "best_comment_first": "Complexity has set the bar for humanities at Harvard incredibly high.",
        "course_id": "116807",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=68af61e2bfe19b6b3e049602932e3493b3cd497f25d07be0dcf69b750ef8a2a0e4ce2593b754a32e40fb720fb943f778&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ENG-SCI 250",
        "course_title_2025": "Information Theory",
        "course_score_mean": 4.75,
        "rec_score_mean": 4.42,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9707,
        "best_gem_comment": "",
        "workload_score_mean": 12.09,
        "best_gem_comment_short": "",
        "best_comment": "I took this as a college senior, and I found it pretty tough with my only statistics background coming from Stat 110 and 242 and CS 181\/184. Measure theory came up very rarely, but it was never necessary to understand the concepts. Flavio is an outstanding and engaging lecturer, and we had two excellent guest lectures as well. Overall a super cool class to get up to speed on compression and get a taste for various modern applications of information theory such as differential privacy.",
        "best_comment_short": "Flavio is an outstanding and engaging lecturer, and we had two excellent guest lectures as well.",
        "best_comment_first": "I took this as a college senior, and I found it pretty tough with my only statistics background coming from Stat 110 and 242 and CS 181\/184.",
        "course_id": "119057",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d1dc927da6a9149970f6476d774a0dfe6a06e6221e340b827ab2d22bc3218f43a9fb76503515e17d9751b39f6be9cf7b&ReportType=2&regl=en-US"
    },
    {
        "course_code": "PHYSICS 195A",
        "course_title_2025": "Introduction to Solid State Physics",
        "course_score_mean": 4.75,
        "rec_score_mean": 4.88,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.95255,
        "best_gem_comment": "",
        "workload_score_mean": 7.25,
        "best_gem_comment_short": "",
        "best_comment": "Physics 195a is a great class! You learn all about a new domain of physics that is quite different from others, but draws from quantum mechanics, electricity and magnetism, waves, and even some chemistry. Professor Mundy is awesome, and does her absolute best to make the course accessible for all. Some pros of the course include: – Generous grading on Psets and Exams– Infinite time on exams (Proctored by Professor Mundy)– Small \"gimme problems\" on psets  and chill class pacing (oftentimes we would pause at the halfway point in class for a short break)– a wide scope of content (which means that if you don't like something, you will be doing something else the next week anyways)–  Very nice, accessible, approachable, and knowledgeable teaching staff– Sections are essentially just pset help, and office hours are helpful too– Taking 195a primes you well to take other Quantum Materials coursesSome criticisms:– Psets can be a bit tedious–  Section isn't made to answer questions, it's mainly just there to explain hard Pset problems–  I don't think that the course will be taught by Professor Mundy next year, so it may have very different course structureTL;DR: Physics 195a is a great course that will teach you all about Solid State Physics, a very unique realm of physics. Professor Mundy is awesome, and the course is structured to be quite chill. The course is a decent time commitment (~7 hours per week outside of class), but there are plenty of support resources. Take this class if you're interested!",
        "best_comment_short": "Some pros of the course include: – Generous grading on Psets and Exams– Infinite time on exams (Proctored by Professor Mundy)– Small \"gimme problems\" on psets  and chill class pacing (oftentimes we would pause at the halfway point in class for a short break)– a wide scope of content (which means that if you don't like something, you will be doing something else the next week anyways)–  Very nice, accessible, approachable, and knowledgeable teaching staff– Sections are essentially just pset help, and office hours are helpful too– Taking 195a primes you well to take other Quantum Materials coursesSome criticisms:– Psets can be a bit tedious–  Section isn't made to answer questions, it's mainly just there to explain hard Pset problems–  I don't think that the course will be taught by Professor Mundy next year, so it may have very different course structureTL;DR: Physics 195a is a great course that will teach you all about Solid State Physics, a very unique realm of physics.",
        "best_comment_first": "Physics 195a is a great class!",
        "course_id": "112107",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c0736a29c534bb6f3770a847be046cce80fe2dad044bc72fb681e1273362b74e2860102fb11fc011c0b02b97f44ef7ad&ReportType=2&regl=en-US"
    },
    {
        "course_code": "KOREAN BX",
        "course_title_2025": "Elementary Korean for Advanced Beginners",
        "course_score_mean": 4.75,
        "rec_score_mean": 4.63,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.85525,
        "best_gem_comment": "",
        "workload_score_mean": 5.75,
        "best_gem_comment_short": "",
        "best_comment": "This is a very good class – the pacing is great for everyone despite the range in experience of BX students, and the teachers are great at exposing the students to both the language and the culture of the country throughout the class. Highly recommend",
        "best_comment_short": "This is a very good class – the pacing is great for everyone despite the range in experience of BX students, and the teachers are great at exposing the students to both the language and the culture of the country throughout the class.",
        "best_comment_first": "This is a very good class – the pacing is great for everyone despite the range in experience of BX students, and the teachers are great at exposing the students to both the language and the culture of the country throughout the class.",
        "course_id": "114383",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=291af93b5c3d09ec1cbb019b31eade72c8f75970744ff625761ab1f0b44e512dc6541f2d5f071e0e498cd61c6f23c8cb&ReportType=2&regl=en-US"
    },
    {
        "course_code": "COMPSCI 1650",
        "course_title_2025": "Data Systems",
        "course_score_mean": 4.75,
        "rec_score_mean": 4.5,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9365,
        "best_gem_comment": "",
        "workload_score_mean": 13.75,
        "best_gem_comment_short": "",
        "best_comment": "Have you ever played Factorio? It is a legendary game of automation. It has such a great learning curve where the more you put into it, the more you learn. There is constant iteration and constant improvement on your existing designs. You lose track of time when playing that game. 30 minutes spent eating lunch are better used expanding the factory. The factory must grow of course. Anyways, like that game, this class is the most potent form of crack you can find at Harvard. For a certain kind of student, you know it if you are, this class will give you everything you ever wanted from a class. Welcome to my qreport for my new favorite course. ...Ahem.....Background: Junior CS AB\/SM student. Previous CS courses: CS50,124, 61, 121,181,263; ES143. Extensive prior python coding experience and experience with C through classes only. Time Statistics:I kept strict track of time spent on everything productive I did over the semester. The first time entry begins on September 2nd 2024 and each entry is one week's worth of time starting from the monday of the week. (Format is hour:minutes:secs. or hour:min)By week:(Beginning day given only)|  Start  |   End   | Duration  ||–––––––––|–––––––––|–––––––––––|| Sep 02  |  Sep 08\t| 3:02      || Sep 09  |  Sep 15\t| 2:04      || Sep 16  |  Sep 22\t| 1:51      || Sep 23  |  Sep 29\t| 2:11      || Sep 30  |  Oct 06\t| 6:17      || Oct 07  |  Oct 13\t| 18:08     || Oct 14  |  Oct 20\t| 26:34     || Oct 21  |  Oct 27\t| 6:03      || Oct 28  |  Nov 03\t| 11:38     || Nov 04  |  Nov 10\t| 19:12     || Nov 11  |  Nov 17\t| 5:23      || Nov 18  |  Nov 24\t| 15:09     || Nov 25  |  Dec 01\t| 11:25     || Dec 02  |  Dec 08\t| 30:04     || Dec 09  |  Dec 15\t| 23:57     || Dec 16  |  Dec 22\t| 40:23     |  By category: | Task                                   | Time     ||–––––––––––––––––––––––––––––––|––––––––––|| Midway Check in (Milestone 1) | 25:33:27 || Final Report                  | 09:21:11 || Lab                           | 02:42:00 || Learn B+ Trees                | 00:27:04 || Learn tmux                    | 00:34:43 || Lecture                       | 21:23:35 || Midterm                       | 12:07:12 || Midterm 2                     | 05:36:31 || Milestone 1                   | 53:32:42 || Milestone 1 Serverside        | 02:34:15 || Milestone 2                   | 29:05:51 || Milestone 2 Lecture Review    | 00:41:15 || Milestone 3                   | 41:15:25 || Milestone 4                   | 07:13:51 || Non–Milestone Coding          | 00:59:00 || Project 0                     | 02:51:27 || Read Paper                    | 00:43:43 || Reading                       | 00:34:04 || Section                       | 06:11:41 |Only Milestones (Merged):Milestone 1\t77:40:24Milestone 2\t29:47:06MIlestone 3\t41:15:25Milestone 4\t07:13:51Remarks:This course took me around 223.5 hours. This puts it easily in first place followed by CS61, CS124, and Stat 111 at 193, 180, 172 hours total. In all cases, these times including _everything_ done for the class. Suffice it to say, this class has a HEAVY workload. If I had attempted more of the extra credit and interesting add–ons to the project, I would have easily been able to put in 300+ hours into this class. So, the usual warnings of time management apply here. You might notice that I put in almost no time in the first third of the course. This was, in my opinion, a massive mistake.In the beginning, you will start with a handout code of a couple hundred lines. However, by the end, you will end up writing 6000+ lines of code. In my case, I ended up writing 9979 lines of .c and .h code. Of course there are empty and comment lines included in that, but you see my point. As such, code organization will be very important. For example, your project will need code to parse and execute various database operators. How will you do this? Perhaps consider putting each operator into its own file such as parse_select.c and execute_select.c as an example. Similarly, there will need to be thought put into the load and print commands whose execution will require logic dissimilar than the other operators. How will you deal with cases where you need to find a specific result column from its handle? How about when you need to find a database column from its full name? how about finding the specific entry in the client context for a relevant search? How will you handle database persistance? Where will code for btree and sorted index creation go? In the file with execute_create? maybe a separate create_index.c file? Where will the functions doing the search within the indices go? There is just simply a lot of code to be written. Think about semantic ways of separating your code into different files. If not, your files such as db_manager, parse and execute will baloon to thousands of lines. If using vscode, things like ctrl shift o, ctrl p, and various vim–esque keyboard shortcuts will be increase your productivity. The lectures were very dissimilar to other lecture–style CS classes I took. I was with a great cohort of students and we tried our best to ask so so many questions. We questioned everything and Stratos was great and he encouraged us in that. I think this class wins the award for the most knowledge learnt through slides per word on the slides :D To the point and keeps the focus on the conversation we are having with Stratos. CS165 has the most generous course policies of any course. I want to thus go into a tangent on the many many generosities shown by the class. Both exams are take–home and start at 9AM and last until 12pm the next day. It is open book, open computer, open internet, AND, most importantly, open people! You are able to talk through the problems with others taking the class! Of course your writeup needs to be done separately, but this is the kind of confidence they have in their problems and in their teaching philosophy. I learned so much from the back–and–forth discussions we had when trying to come up with the best algorithm for a task. How is it that the Midterm _taught_ me something? Incredible. The class has almost no deadlines. There is a midway check–in mid october by which you need to pass the first 3 of the 59 tests. This is to give you a sense of the gigantic scope of this project compared to any other class you have ever taken. Beyond that, there is only one deadline, the final one. Essentially, the course trusts you completely and leaves almost everything to you. You make any kind of design decisions. The midterms were fine. There is extra credit galore in each midterm and your first midterm doesn't count if you do better on your second. Nothing to worry about. ezpz. I highly suggest using Ubuntu\/Linux for developing this project. You will be directly developing in the OS that your testing server will use. You will also be able to compile and run natively without worrying about cstdlib functions not being present on mac or windows. Please god please don't use windows.  `gdb` is essential for this project. Specifically, learn how to create a .gdbinit file and create various layouts which will come in handy. A particularly useful layout for me was `tui new–layout <layout_name> {–horizontal src 3} 2 cmd 1`. You can switch to this layout using `layout <layout_name>`. Learn also how to use vgdb to use gdb together with valgrind for a powerful duo. I heavily suggest using tmux as a terminal multiplexer. Learning it and setting it up as I like is has been an absolute game changer. For example, I didn't do this myself and it cost me dear time at the end: create a test execution script that can start the server and client processes as well as can input specific tests into the client. Use the test generation scripts to create tests of different magnitudes. You should at least create the 10million row version of the tests. Then, develop your project only using the larger tests. I personally always used a 1million row dataset and its tests. It served me very well. 10 million is for the stress tests. For example, did you know that there is a max limit size of a stack allocated array? This means any stack allocated array should make sure it doesn't go past that size. This is very niche: the course uses C99 but C99 does not have a address aligned malloc function. HOWEVER, you can create one yourself if you would like. The way you do this can be found on the internet, but what this allowes you to do is to assume almost every memory region you allocated is cache\/page aligned. How about that :DSome Areas that the course could improve upon: 1– The CS165 language needs to be updated. For example, there are tests that require single–threaded execution. Thus, there is a single_core() and single_core_execute() command that essentially enable and disable multicode performance. Very easy to implement, however, it must be included in the language regardless. 2– Certain things about the project need to be clarified. For example, it is possible for certain tests to create an internal variable, say s1, and then overwrite it with a new result also named s1. However, at least from my look at the project, there is no text on whether this is allowed. 3– The create column command specification is `create(col,<col_name>,<tbl_var>)` however, the examples shown just below it show examples such as `create(col,\"project\",awesomebase.grades,unsorted)`. However, this `unsorted` argument is not allowed given the language. These kinds of inconsistencies need to be resolved and not left to be clarified every year using Ed. 4– Many students including me experience issues with permissions and with the docker container running as root. This is extremely unnecessary and dangerous I believe. If the docker container has any issues, it will execute with root access. My docker container should not be able to nuke my computer :D I mean this is an exageration, but there is no reason to not have a basic user such as `cs165–student`. This would remove a lot of issues with root permissions. For example, after every time I used run_mile with the make file, it compiles the project with the docker root user. Thus, I need to then run a `sudo` make clean instead of just being to use my normal user. I needed to use sudo so much and I find that this is not good practice and makes it so unnecessary. I had input mu 25 char password every time I needed to do this. I seriously considered reducing my computer's password length or removing it entirely to stop password authentication every single time I needed to compile my code after a run_mile. 5– Some of the section recordings are extremely old and the audio and video quality is really showing its age. I would humbly that the class invest some TF time to rerecord these videos with hopefully better production. 6– Certain things mentioned in the milestone requirements turned out to be optional and worth extra credit point. The course needs to clarify what counts as a minimum and what not. For example, I later in the course learned that there would be no inserts done after index creation. This meant that I could make many assumptions about my structure. This lead me to design a –I think– novel way to store the btree in memory without needing a reference to each node's start address. I literally halved my btree size and made it perform much better in terms of cache locality. Final thoughts:There is so much to say about this class, but just know that this class really cares about your success. There were office hours and help available almost every single day. What can I say, I feel that I didn't make the most of this class and I could have done so much more for this class. I am definitely going to implement the project in Rust at some point:D I wish you luck. If class difficulty is not an immediate no for you, then class will deliver. Take the plunge and learn how one can learn so much in just a semester. Like, the largest project I had worked on before this has 2800 lines of python code. Of course, c gets way less done in the same number of lines, but still, this was a big personal achievement for me to have finished this. May you stand unshaken amidst a crashing world...",
        "best_comment_short": "I think this class wins the award for the most knowledge learnt through slides per word on the slides :D To the point and keeps the focus on the conversation we are having with Stratos.",
        "best_comment_first": "Have you ever played Factorio?",
        "course_id": "119249",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=41d8fe552cbdd109942e6fe0bd271933d1a9455f684e7e198aef40b3f6731df769764af4751802602ba882c015d0c91e&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SOCIOL 1197",
        "course_title_2025": "Poverty in the United States",
        "course_score_mean": 4.75,
        "rec_score_mean": 4.75,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9266,
        "best_gem_comment": "",
        "workload_score_mean": 5.22,
        "best_gem_comment_short": "",
        "best_comment": "I HIGHLY RECOMMEND this course to anyone interested in understanding the complexities of poverty and social justice issues. The guest speakers were definitely one of the best parts of the class. They brought real–world perspectives that helped connect the material to real–life experiences, making the course content much more engaging and accessible. Their personal stories really brought the issues to life in a way that statistics and theories alone couldn’t. I also really enjoyed the course section with Kyle—it provided an opportunity to dive deeper into topics like education, low–wage work, homelessness, and housing, exploring how they are all interconnected and contribute to poverty. These discussions were thought–provoking and sparked some truly meaningful conversations.That said, be prepared for a heavy reading load each week—it can get overwhelming if you're not on top of your time management. But if you can manage it, this course will definitely expand your perspective and help you understand the structural issues that keep poverty in place. One of the things I loved most about this course is that there are NO EXAMS—just field report assignments, which are only five pages, and the final is another field report plus a five–page reflection on the class. I really liked this because it gave us the chance to conduct interviews or observational studies, which made the assignments feel more hands–on and connected to real–world issues. TAKE THIS CLASS—it’s easy and a great way to learn about such an important subject. Plus, Professors Waldman and Wallerstein are both so nice and supportive!",
        "best_comment_short": "TAKE THIS CLASS—it’s easy and a great way to learn about such an important subject.",
        "best_comment_first": "I HIGHLY RECOMMEND this course to anyone interested in understanding the complexities of poverty and social justice issues.",
        "course_id": "220192",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8191793067c3854a84c7285b2e4eb1350770036fa87b6bf7aebfe45b95b7251d7eeeae9ce60619fd4af23df1963c4595&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ASTRON 130",
        "course_title_2025": "Cosmology",
        "course_score_mean": 4.75,
        "rec_score_mean": 4.44,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9489,
        "best_gem_comment": "",
        "workload_score_mean": 4.81,
        "best_gem_comment_short": "",
        "best_comment": "This is an excellent course taught\/supported by a great lecturer and great TFs! The course content is conceptually challenging but (like any astro class) extremely interesting, and the psets are very reasonable. If you are an astro concentrator or even a STEM person looking for a good elective, this'll be right up your alley. Cosmology is a deeply interesting subject (with a lot of open questions), and with this course you are really able to immerse yourself in all that we do not yet know. As an astrophysics concentrator doing cosmology research, I found that this class not only greatly enhanced the concepts central to my research,  but also reaffirmed my love for cosmology!",
        "best_comment_short": "This is an excellent course taught\/supported by a great lecturer and great TFs!",
        "best_comment_first": "This is an excellent course taught\/supported by a great lecturer and great TFs!",
        "course_id": "125883",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e1b9870d1545ba082ca6ccff10f53acd9fd89cdfc1d765e942c4dc07d5e0bae2fca37911aadd6446e96e27996c5972d4&ReportType=2&regl=en-US"
    },
    {
        "course_code": "FYSEMR 53G",
        "course_title_2025": "Literature of Spiritual Crisis",
        "course_score_mean": 4.75,
        "rec_score_mean": 4.63,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9169,
        "best_gem_comment": "",
        "workload_score_mean": 4.14,
        "best_gem_comment_short": "",
        "best_comment": "If you want to learn more about the ways that seemingly irresolvable crises of good and evil and significance have been experienced and resolved since the Book of Job to the last few centuries, this is a fantastic overview.  The books are all interesting and add new facets to the singular experience of spiritual crisis. They also provide a reasonable amount of reading per week.There is really only so much you can do to prepare for or understand these fundamental spiritual questions, but this class will definitely make you wiser and more prepared to face them.I came in with a religious background (Christian) and I found that this class deepened my understanding of my own faith.  The class is structured in such a way that it is friendly regardless of your spiritual background.I think your experience in this class may depend on how much people are willing to participate. There will definitely be at least some people willing to add a lot to the discussion since this is a first year seminar, but I feel like my class could have been a bit more intimate than it was (some people seemed uncomfortable contributing the discussion often).Professor FitzGerald is a thoughtful moderator whose questions always raise the level of the discussion to a new level. If you put in the modest level of effort required, you will do well in the short assignments he gives. (Always make sure to capitalize the G in FitzGerald, though!)",
        "best_comment_short": "They also provide a reasonable amount of reading per week.There is really only so much you can do to prepare for or understand these fundamental spiritual questions, but this class will definitely make you wiser and more prepared to face them.I came in with a religious background (Christian) and I found that this class deepened my understanding of my own faith.",
        "best_comment_first": "If you want to learn more about the ways that seemingly irresolvable crises of good and evil and significance have been experienced and resolved since the Book of Job to the last few centuries, this is a fantastic overview.",
        "course_id": "224632",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0a5e45b970de7234814f9c3a45a499eff84dffe2767739b238aa8742e8f81346233a183ec81a20b37900ad4a75b4f68c&ReportType=2&regl=en-US"
    },
    {
        "course_code": "WOMGEN 97",
        "course_title_2025": "Tutorial - Sophomore Year",
        "course_score_mean": 4.75,
        "rec_score_mean": 4.75,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9775,
        "best_gem_comment": "",
        "workload_score_mean": 7.57,
        "best_gem_comment_short": "",
        "best_comment": "I think this was an awesome class, and I especially loved the final archival research project in which we led our own exploration of Schlesinger's archives, ultimately writing a research paper. Writing the paper was SO fun, and although I went in a little afraid of my ability to get it done, the process was so easy because of Linda and Mattlyn's guidance. In many ways, this class pushed me outside of my comfort zone. Sometimes the readings were hard to understand, but I felt that in class discussions did overall help distill different ideas and pick apart heftier texts, making the course quite rewarding. I honestly recommend this course to non–concentrators as well, as the ideas are important to learn and unlike something you could takeaway from a different course.",
        "best_comment_short": "Writing the paper was SO fun, and although I went in a little afraid of my ability to get it done, the process was so easy because of Linda and Mattlyn's guidance.",
        "best_comment_first": "I think this was an awesome class, and I especially loved the final archival research project in which we led our own exploration of Schlesinger's archives, ultimately writing a research paper.",
        "course_id": "120677",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1852ead03e685dbcbf9d785a95d62264bf15ebaec8be93d01a07b26741dcbfb03da51388893ec08d563db6fdde89c330&ReportType=2&regl=en-US"
    },
    {
        "course_code": "TDM 174PO",
        "course_title_2025": "Performing the Orient",
        "course_score_mean": 4.73,
        "rec_score_mean": 4.55,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8716,
        "best_gem_comment": "",
        "workload_score_mean": 5.0,
        "best_gem_comment_short": "",
        "best_comment": "Chan is truly phenomenal. best tdm class at harvard hands down. the readings and performances we watch every week are so interesting, eye–opening, and fun. LOVE LOVE LOVED this class. learned and grew so much–––also healed my relationship with ballet!",
        "best_comment_short": "LOVE LOVE LOVED this class.",
        "best_comment_first": "Chan is truly phenomenal.",
        "course_id": "224593",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=15f05ba22cc92d9a3208e5fd034fd21d4843e00652f419e8b5495f1f82031eba0cf2e68d9820ab91012a477bc68f3a6d&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ENGLISH CKR",
        "course_title_2025": "Introduction to Playwriting: Workshop",
        "course_score_mean": 4.71,
        "rec_score_mean": 4.71,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.91395,
        "best_gem_comment": "",
        "workload_score_mean": 4.86,
        "best_gem_comment_short": "",
        "best_comment": "This is SUCH a fun class and I'd recommend it to anyone who's vaguely interested in creative writing. I learned a lot of interesting things about plays and the writing process and it's super nice to get your feet wet trying out different techniques and tools. You also get to know really cool people who are in your workshop pretty well. Sam Marks is such an enthusiastic and cool teacher and the plays we read were absolutely awesome. It's kinda hard to know where to start reading plays but once you read the ones in this class, you'll get a better idea of what to read next :) Would one hundred percent recommend!!",
        "best_comment_short": "It's kinda hard to know where to start reading plays but once you read the ones in this class, you'll get a better idea of what to read next :) Would one hundred percent recommend!",
        "best_comment_first": "This is SUCH a fun class and I'd recommend it to anyone who's vaguely interested in creative writing.",
        "course_id": "116875",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=dbf3e5915053cb003d83deb234216e5985b7e61e20d703d37ab6fc050484e7d860df32296ff51e8b1d2f3debcb2c22e3&ReportType=2&regl=en-US"
    },
    {
        "course_code": "KOREAN BA",
        "course_title_2025": "Elementary Korean",
        "course_score_mean": 4.71,
        "rec_score_mean": 4.57,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8291,
        "best_gem_comment": "",
        "workload_score_mean": 4.85,
        "best_gem_comment_short": "",
        "best_comment": "If you are planning on having some important application of Korean in the future (family, friends, job), this class is an excellent introduction. It is not a class to take lightly – you shouldn't come waltzing in with the hope of picking up a few words and phrases – you should be committed to learn the language in its entirety, with weekly writing and speaking evaluations. You will get the most out of what you put in.",
        "best_comment_short": "If you are planning on having some important application of Korean in the future (family, friends, job), this class is an excellent introduction.",
        "best_comment_first": "If you are planning on having some important application of Korean in the future (family, friends, job), this class is an excellent introduction.",
        "course_id": "124296",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=66cdc541447cef2d47a3d4bcef7b334de0e18e3e5fa87248eb504a598074e374c18cfc8234a62d96974ed21f3070d4dc&ReportType=2&regl=en-US"
    },
    {
        "course_code": "HISTSCI 1740",
        "course_title_2025": "The Psychology of War",
        "course_score_mean": 4.71,
        "rec_score_mean": 4.79,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8883,
        "best_gem_comment": "",
        "workload_score_mean": 5.0,
        "best_gem_comment_short": "",
        "best_comment": "Les is an incredible professor, and even beyond that, a mentor that I'm so glad I met. You can tell how much he loves what he teaches, and that energy is infectious. This course changed my mind on many issues within psychology and also the history of American war. The material is super interesting, and though the readings can be long, the workload is manageable. We would often watch movies and other forms of media as well. The final exam gave so much freedom with what I could explore and how I explored it—and he always encouraged taking risks. He gave great feedback and I believe I became a better writer after this course. For the HistSci department, I SUPER recommend taking this class :)",
        "best_comment_short": "For the HistSci department, I SUPER recommend taking this class :)",
        "best_comment_first": "Les is an incredible professor, and even beyond that, a mentor that I'm so glad I met.",
        "course_id": "224481",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=76499b43dbea8b7b67407c9c9586f68a6e0cf5d98174c0baf81b10a2e201bf4a7699c3f1c2cacef093035ad79a28d880&ReportType=2&regl=en-US"
    },
    {
        "course_code": "COMPSCI 2630",
        "course_title_2025": "Systems Security",
        "course_score_mean": 4.71,
        "rec_score_mean": 4.71,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9541,
        "best_gem_comment": "",
        "workload_score_mean": 7.93,
        "best_gem_comment_short": "",
        "best_comment": "If you're interested in systems security, this class is definitely for you! Mickens is a wonderful lecturer, the 3 projects were very fun to do, they're challenging enough to be interesting, but at the same time definitely doable (I didn't feel the need to go to office hours at all). The late policy is definitely harsh, but you're given at least 2 weeks for every project (and in my experience, a project took no more than 2 days to finish, but this definitely depends on programming experience). The readings were consistently interesting to do. The class was still lecture–style so you don't really discuss the papers, but you still submit some observation\/questions you have about the reading assignment before every class. Regarding exams: Mickens has a very distinct exam style that focuses on more conceptual questions (which is very different from the usual exam style in CS 61). On this end, I just wished there would be practice exams, but there weren't any that I could find. For exam preparation, I recommend rewatching lectures and ensuring you feel confident on the topics. There's a final project component that you do within groups of 2–3 people, and the difficulty of the project really depends on the topic you select. Overall, I highly recommend this class, but definitely be mentally prepared – it's very non trivial.",
        "best_comment_short": "Mickens is a wonderful lecturer, the 3 projects were very fun to do, they're challenging enough to be interesting, but at the same time definitely doable (I didn't feel the need to go to office hours at all).",
        "best_comment_first": "If you're interested in systems security, this class is definitely for you!",
        "course_id": "160579",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e54bdebfedfa2610ebdc73831195dffc90a6e34f748a6cc99d9a6c48289d9fce381d803a69e2701c9b3d7d936432ff88&ReportType=2&regl=en-US"
    },
    {
        "course_code": "GOV 2710",
        "course_title_2025": "International Relations: Field Seminar",
        "course_score_mean": 4.71,
        "rec_score_mean": 4.71,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.7716,
        "best_gem_comment": "",
        "workload_score_mean": 10.86,
        "best_gem_comment_short": "",
        "best_comment": "This is the best IR course I have taken through my undergraduate and master's degrees. The course provided a comprehensive graduate–level introduction to International Relations and did so through a very well–constructed syllabus. With 6–7 journal articles\/chapters each week, I felt that I could read closely and think critically about each reading (and was not forced to skim like in other courses). I also appreciated the carefully considered mix of classic and recent readings, along with their theoretical\/methodological diversity. Overall, I felt the course provided me a strong understanding of the major debates in IR, their evolution over time and space, and a good knowledge of the diverse methods used to answer these questions. The instruction and seminars were also excellent. The professors have exceptional command of the material, seminars had active participation, and each class discussed most (if not all) the readings.",
        "best_comment_short": "Overall, I felt the course provided me a strong understanding of the major debates in IR, their evolution over time and space, and a good knowledge of the diverse methods used to answer these questions.",
        "best_comment_first": "This is the best IR course I have taken through my undergraduate and master's degrees.",
        "course_id": "123375",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=5e01dddff7c970d54ba3fb40e461117081b9f008b70d80c141921ce4f3559a03006061d96f04f136bad453878429bf2c&ReportType=2&regl=en-US"
    },
    {
        "course_code": "STAT 185",
        "course_title_2025": "Introduction to Unsupervised Learning",
        "course_score_mean": 4.71,
        "rec_score_mean": 4.57,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9427,
        "best_gem_comment": "",
        "workload_score_mean": 7.0,
        "best_gem_comment_short": "",
        "best_comment": "This is an amazing stats course ! I enthusiastically recommend! Alex is an excellent lecturer and professor. The format of the course is such that it is not stressful but very instructive (biweekly checkins, two midterms, final project instead of a final exam). It may be difficult in the beginning of the course to adjust to some of the matrix algebra if that is not something you use a lot but honestly I think one gets the hang of it by Midterm I. If you are at all interested in unsupervised learning or other data analysis techniques, I think this is a great class to take. It's a good mix of theory and applications, but has an applied bent, and overall super interesting. Highly recommend if you've taken 110\/111 and looking for another stats class.",
        "best_comment_short": "It's a good mix of theory and applications, but has an applied bent, and overall super interesting.",
        "best_comment_first": "This is an amazing stats course !",
        "course_id": "213478",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=69ef848f8d8f8cd1f0c796dfff0347d7aab3148aa48236f32b84e9c1587cb447e84a2640601950a4f060ebba89240d88&ReportType=2&regl=en-US"
    },
    {
        "course_code": "PHIL 165",
        "course_title_2025": "The Structure of the Social World",
        "course_score_mean": 4.7,
        "rec_score_mean": 4.7,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8789,
        "best_gem_comment": "",
        "workload_score_mean": 7.11,
        "best_gem_comment_short": "",
        "best_comment": "Great course. Prof. Pham is so helpful and excels at explaining the material. A lot of grunt work (reading responses, drafts, ...) but if you like that kind of structure, this course is good for you. I would also say that this is a good course for those of you who have taken a lot of history of philosophy courses, but not much contemporary M\/E. This is as contemporary as it gets, insofar as most the people you read are still working (sometimes at universities very close–by). I really enjoyed my time learning in social ontology, so I recommend this course with enthusiasm.",
        "best_comment_short": "I really enjoyed my time learning in social ontology, so I recommend this course with enthusiasm.",
        "best_comment_first": "Great course.",
        "course_id": "212884",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=eafb35af4def00bf3fd5067943affa802572a627a039533a20d41be2f0e918b41b5d78f1af7223cce0eee58d44a04bae&ReportType=2&regl=en-US"
    },
    {
        "course_code": "PHIL 164",
        "course_title_2025": "Metaphysics",
        "course_score_mean": 4.69,
        "rec_score_mean": 4.63,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9312,
        "best_gem_comment": "",
        "workload_score_mean": 5.47,
        "best_gem_comment_short": "",
        "best_comment": "If you are interested in learning more about metaphysics, this is a fantastic course. The readings are super interesting, and Professor Pham does a great job explaining and extending them in lecture. The lectures are very engaging, and she is super helpful and available outside of class. The readings are intellectually challenging but not necessarily super difficult or long; all of the assignments are quite interesting and very fair. By the end of the course, you will have a very good working sense of the field of metaphysics and its major debates, and also have improved philosophical “soft” skills (reading, thinking, writing, etc.). By the nature of the subject matter, this course probably isn’t for you if you aren’t interested in abstract philosophy, but as long as you at least slightly are, it is extremely interesting and enjoyable.",
        "best_comment_short": "The readings are super interesting, and Professor Pham does a great job explaining and extending them in lecture.",
        "best_comment_first": "If you are interested in learning more about metaphysics, this is a fantastic course.",
        "course_id": "156025",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e7af688453692c45b555cc12dfe9d3080f7a066150ac4bd7d50e7b1da982d35883de4a8c57463cdb9df415b64b50afa9&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ENGLISH 97",
        "course_title_2025": "Sophomore Tutorial: Literary Methods",
        "course_score_mean": 4.69,
        "rec_score_mean": 4.56,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8587,
        "best_gem_comment": "",
        "workload_score_mean": 6.5,
        "best_gem_comment_short": "",
        "best_comment": "Take this class! It solidified my desire to be an English major. It is a bit harder than other English classes but it was really validating: STEM students are always talking about how its easy to be an English major, and this is the first course I have ever taken that actually felt like the proper level of difficulty for me as a gifted humanities student. I met classmates who are really interesting and inspiring! Prof. Serpell is incredibly regal, intelligent and kind.",
        "best_comment_short": "It is a bit harder than other English classes but it was really validating: STEM students are always talking about how its easy to be an English major, and this is the first course I have ever taken that actually felt like the proper level of difficulty for me as a gifted humanities student.",
        "best_comment_first": "Take this class!",
        "course_id": "216074",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0258bb726a0f05bbf12bda8333e9c5d7147ff0f183a2a8aaa852369d6683b65100a30380b0dbeee7403c6c1824270b13&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ENGLISH 90LV",
        "course_title_2025": "Consciousness in Fiction from Austen to Woolf",
        "course_score_mean": 4.69,
        "rec_score_mean": 4.69,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.93225,
        "best_gem_comment": "",
        "workload_score_mean": 5.44,
        "best_gem_comment_short": "",
        "best_comment": "I highly recommend this class! The texts don't need any introduction, they truly are *transformative*, and Professor Wood is incredibly smart and knowledgeable (as are the people taking the class with you). Reading these incredible books alongside others and with such insightful guidance was exactly the kind of experience I hoped for when coming to Harvard. However, I found the format of the course a bit challenging—it's a mix between a lecture and a seminar, which didn’t really work for me. For a seminar, the class size was quite large, so contributing often felt intimidating—like giving a speech with 20 people around the table. I would have preferred a more traditional lecture format or a smaller seminar setting. Additionally, while it was wonderful to hear everyone’s scattered thoughts, the discussions tended to feel unstructured. If you’re hoping for a focused exploration of consciousness or a clear thematic thread, you might find it harder to extract cohesive ideas, as our discussions often revolved around whatever we found interesting in the books. Additionally, the grading relies on two essays without rubrics or structured prompts—you have the freedom to write on any topic, but this can feel risky if you’re concerned about your GPA. Despite these structural challenges, I am so glad I took this class. I learned a lot, and the experience of engaging with these texts in such an enthusiastic, intelligent environment was so rewarding!",
        "best_comment_short": "I learned a lot, and the experience of engaging with these texts in such an enthusiastic, intelligent environment was so rewarding!",
        "best_comment_first": "I highly recommend this class!",
        "course_id": "118850",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c4222a68ef3247e3b84ffdc52cffda9fbbe5791c6b51a7638620c9c721315620373de222843b009deb6c4e43126a1cc4&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SPANSH 72",
        "course_title_2025": "Introduction to Contemporary Spanish History, Literature and Culture",
        "course_score_mean": 4.68,
        "rec_score_mean": 4.68,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9473,
        "best_gem_comment": "",
        "workload_score_mean": 5.56,
        "best_gem_comment_short": "",
        "best_comment": "Professor Vega's class is a must! Not just this class in particular, but any classes she teaches! She has such a clear passion for whatever topic she teaches that you can't help but share her enthusiasm! I've taken Spanish for years now, both at the high school and college level, and love seeing professors so kind and passionate like her. She is also very willing to meet with you at any given point, even just to chat! Take advantage of this opportunity to improve your Spanish and get to know faculty! If you feel like you are not understanding something or simply want to improve, she will make herself available at almost any time of the day to make sure you can get the help you need! Truly there isn't a kinder Spanish professor you can have!Not to mention, while the readings can be long and hard, they are enjoyable & get easier as the class goes on!",
        "best_comment_short": "I've taken Spanish for years now, both at the high school and college level, and love seeing professors so kind and passionate like her.",
        "best_comment_first": "Professor Vega's class is a must!",
        "course_id": "207836",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c8f4d9d07504edc8e09c96f923f343dc0070fb86c5b9f628254183b50ab272192cdeb874545bad2027c276734fb7f295&ReportType=2&regl=en-US"
    },
    {
        "course_code": "LIFESCI 50A",
        "course_title_2025": "Integrated Science",
        "course_score_mean": 4.68,
        "rec_score_mean": 4.57,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.972,
        "best_gem_comment": "",
        "workload_score_mean": 14.47,
        "best_gem_comment_short": "",
        "best_comment": "TL; DR – LS50 is (mostly) well–taught and the community is unparalleled, but you will struggle throughout the semester (for better and for worse).In order to succeed in this course, understanding Calc II material is crucial along with some Calc III familiarity; AP Chem and AP Bio (to a lesser extent) are also recommended! Like many have said in past q–reports, LS50 feels like 60% math, 40% everything else. As a non–math person, LS50 allowed me to gain an intuition on the why behind some parts of bio (like thermodynamics, chemotaxis, and cell cycle) but it led to psets and midterms being undoubtedly challenging, despite maximizing practice resources and attending CA office hours (make sure to attend office hours, if you take LS50!!).The content in this course is somewhat scattered but it was all quite fascinating as a look back on the semester; I'll go through each of the main ideas. 1) Probability\/stats – taught by Michael well and was pretty interesting. 2) Chemistry – Emma is an amazing lecturer and will hold your attention for the entire hour and 15 minutes! 3) Lac operon – very fascinating and Andrew is a hilarious lecturer. 4) Dynamical systems – Ben is a great lecturer, but many peers and I agree this material could be removed from LS50. 4) Molecular\/classical genetics – foundational topic in molecular bio and taught by Emma\/Ben. 5) Yeast cell cycle – interesting but most relevant for the lab project with Piyush (taught by Andrew). 6) Thermodynamics\/stat mech – while, in theory, it's interesting material and both Doeke and Michael teach well, this will suck the soul out of you at times and question your will to take LS50. 7) Eukaryotic gene expression\/dev bio – Kara is such an incredible lecturer and will make you excited to attend lecture! 8) Diffusion\/chemotaxis – kind of thrown in at the end and confusing, but still fundamentally interesting.It's important to mention that all of the instructors and CAs are warm, approachable individuals that really try hard to support you along the way, despite the material being challenging. I think everyone ends up with an A, A–, or B+ however, this course is a profound time commitment. You will get very close with your classmates in Cabot until 4 AM some nights; you will walk away from office hours feeling like you learned how to approach a problem but must return the next day; you will simultaneous question your decision to do science and embrace the beauty of the material LS50 teaches. Overall, I recommend this course if you have a strong background but you have been warned (for better and for worse). You will meet some of your greatest friends freshman year and encounter significant challenges along the way.",
        "best_comment_short": "You will meet some of your greatest friends freshman year and encounter significant challenges along the way.",
        "best_comment_first": "TL; DR – LS50 is (mostly) well–taught and the community is unparalleled, but you will struggle throughout the semester (for better and for worse).In order to succeed in this course, understanding Calc II material is crucial along with some Calc III familiarity; AP Chem and AP Bio (to a lesser extent) are also recommended!",
        "course_id": "159706",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c61744e0c6bfa8b30447ab52cdd5687fda5470fb059340cc64f732041ee31ab045ef4d4d247cf435a7252263ebdf90fe&ReportType=2&regl=en-US"
    },
    {
        "course_code": "MATH 55A",
        "course_title_2025": "Studies in Algebra and Group Theory",
        "course_score_mean": 4.68,
        "rec_score_mean": 4.52,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9115,
        "best_gem_comment": "",
        "workload_score_mean": 20.08,
        "best_gem_comment_short": "",
        "best_comment": "Now, to get it out of the way, yes, this class is stupidly difficult. The analogy of drinking water from a firehose is not at all inaccurate and I would not recommend taking it alongside more than one other really difficult course (like physics 16,CS61 from what I've heard for example) – it is possible, but it will likely crush you. One other really difficult course is doable if you're very comfortable with, I have friends that have done it, but they were in a position where those courses were very commensurate with their skill level. Nonetheless, despite the extreme difficulty, I would still recommend this course as strongly as I am capable if you love math. You do NOT have to be a genius with boatloads of competition mathematics experience in order to take this class. The highest level of mathematics I ever did formally in high school was single variable calculus and the basics of complex numbers and some very very elementary proofs, and I was still able to score above average in the course without sacrificing my entire life on its altar. I would however say that it is quite difficult to do well in the class without at least one of the following:– Some experience in high school with more advanced mathematics, especially linear algebra. This is not so much because it will directly come up as something tested in the course, as although we do spend a lot of time on linear algebra it takes a form almost unrecognizable to many of my friends who did linear algebra in high school, but rather because it gives useful intuition as to how to think concretely about very abstract concepts, and a concrete example to reach for when you want to play around with a new idea. – Exposure to and interest in abstract mathematics. This was what I had that I felt helped me the most. This doesn't need to be formal – most of my background came from a nigh–unhealthy amount of mathematics youtube videos watched as well as having worked through the beginnings of several lecture notes covering the beginnings of a couple of the university–level subjects I was interested in. These do not need to be directly related to the course material at all, but rather help get you in the mindset of abstract mathematics – figuring out how to set up a proof, how to see the kinds of patterns and tricks that come up in abstract math, and also just to enjoy the little references to other fields of mathematics that often come up. The course basically assumes being comfortable with this mode of thinking and although you can pick it up along the way, trial by fire and all that, it does help to have it already.With that out of the way, a final couple notes on the difficulty of the course: firstly, although it is indeed incredibly difficult, that difficulty is fairly frontloaded in that it doesn't get too much worse than the first couple problem sets (not that it gets much easier either, but it does mean that if you survive the first couple weeks without completely burning yourself up you can likely survive the rest) and secondly, again despite that difficulty the grading is relatively lenient, and as long as you solve the problems you will likely score quite well. This is especially true of the fact that extensive collaboration is tolerated and actively encouraged by the course – it becomes much much more manageable once you find a good problem set group to work through it with and the scope of what kind of collaboration is permitted is quite broad. A tip on study groups – try and find a group with a roughly comparable skill level to yours in the class, as being in a problem set group with someone much more or less mathematically able than you is generally not very productive for either party. This also helps with another issue that I found to be quite common: impostor syndrome. Since many people taking this course would have been the resident math whiz at their high school but are just another student in this class it can often be easy to feel as if you don't really deserve to be in the class, and having a group of people around you who are going through the same sort of thing and have a similar skill level to you can really help with that. That said, it also helps to have a group of people whose skills complement each other – the joke in my pset group was always that we had the logician (me), the physicist, and the generalist mathematician, and our respective orientations helped a lot with building solutions together; I could often spot slight technicalities that the other two missed, the physicist had very strong concrete intuitions for things and could see angles we couldn't, and the generalist mathematician often had a lot of insights that I was too deep in the weeds to see and that weren't the physicist's style. Now as to the professor. I do not exaggerate when I say Denis Auroux is the BEST professor I have ever had in any academic context. He is a brilliant, lucid lecturer who takes incredibly deep, intricate concepts that I personally would have had to spend many times the number of hours we had to understand otherwise and makes them crystal clear and motivated. He always makes sure to really work through the details of why a result is true while keeping it approachable and comprehensible, which is a terribly difficult balance to strike. He was also eminently available to all of his students – he generally responds to slack questions within minutes (he's so quick that it's become something of a joke amongst classmates) and his office hours are pure gold. He makes a conscious effort in them to make sure every single question is heard and answered throughly and he gives incredibly well thought out hints. One can also very clearly tell how much he cares about his students – he takes the time to get to know each of their idiosyncrasies and work with them. He's also just very approachable and willing to laugh with you. The CAs are also as a whole excellent, giving incredibly useful advice on the problems and having office hours on all but one day of the week.As for the content, it is incredibly deep and interesting (although in order to cover so much it is done at incredibly breakneck pace). The main areas covered are group theory (up to and including the Sylow approach to classification of finite groups), abstract linear algebra (with a stringent focus on doing things rigorously and thoroughly, which makes it look very different to the kind of linear algebra many will have done in high school since we don't do much at all with matrix computations, for example even defining the determinant is the last thing we do in the linear algebra section of the course), and their intersection in the form of representation theory. This is covered in the lectures, but a lot of the growth in the course happens in the problem sets. These are generally 8–12 questions in length and will unless you are really brilliant take you most of the week to solve – finishing a math 55 pset is always a bright moment in the week. The problems are very rarely computational and often force you to be very creative in coming up with a solution. The advantage fo this very heavy problem set workload though is tat generally speaking because they force you to become so intimately familiar with the material in order to solve them you generally have to do very little studying outside of just doing the problem sets.Finally, I just want to issue a final recommendation to please, if you do love math, TAKE THIS COURSE. It will be hard, it will eat up a lot of your time, but you will come out a better mathematician than I daresay any other class at any other university could have made you. I can deal with mathematical problems and concepts now that I could never have even begun to wrap my head around before taking this course, and I am much more confident in my ability to actually contribute to complex math. Furthermore, the content itself is just too beautiful to pass up – you will prove results just in the problem sets that are themselves substantial and will make you wonder at the beauty of math. There are very few other experiences that have made me marvel at the sheer beauty of the thing quite as much as math 55. It has been hands down my favourite course of my first semester and quite possibly my favourite academic experience full stop. If you love math and are willing to really put a lot of time into it and want to beecome a better mathematician, this course will be life–changing. There is nothing else quite like math 55.",
        "best_comment_short": "Nonetheless, despite the extreme difficulty, I would still recommend this course as strongly as I am capable if you love math.",
        "best_comment_first": "Now, to get it out of the way, yes, this class is stupidly difficult.",
        "course_id": "113627",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=992351f7c1fe6620ef2322e1b973d628fdd678600f60ef231c5f89135868f7faa3b507427b64391cdcec1013165a9e26&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SOC-STD 98EO",
        "course_title_2025": "Art, Political Culture, and Civic Life",
        "course_score_mean": 4.67,
        "rec_score_mean": 4.5,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9076,
        "best_gem_comment": "",
        "workload_score_mean": 6.6,
        "best_gem_comment_short": "",
        "best_comment": "I would tell future students that if they are really interested in learning about the intersection of art, politics, and civic life they should either find a specific tutorial that can teach them about their theory interests and perhaps an HAA–listed course to better understand their art interests or they should look for another course, outside of the tutorial framework, to interrogate that intersection and take a tutorial that might teach them an element of theory that they otherwise wouldn't know. The critical framework is not particularly robust, but if they are interested in thinking through popular culture and media in the United States, its criticism, its history, and acquiring a theoretical framework for doing so across a small group discussion seminar then they'll enjoy this class. The professor is quite accessible and loves discussing with students their work and providing input.",
        "best_comment_short": "The critical framework is not particularly robust, but if they are interested in thinking through popular culture and media in the United States, its criticism, its history, and acquiring a theoretical framework for doing so across a small group discussion seminar then they'll enjoy this class.",
        "best_comment_first": "I would tell future students that if they are really interested in learning about the intersection of art, politics, and civic life they should either find a specific tutorial that can teach them about their theory interests and perhaps an HAA–listed course to better understand their art interests or they should look for another course, outside of the tutorial framework, to interrogate that intersection and take a tutorial that might teach them an element of theory that they otherwise wouldn't know.",
        "course_id": "116288",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=16dd29d209a890da89c08eeb4bfed09af9afbd1b23ac35d8c67f0de90b97304f302cb931b315eadf48781c34b5711b06&ReportType=2&regl=en-US"
    },
    {
        "course_code": "RELIGION 1803",
        "course_title_2025": "Exploring the Quran",
        "course_score_mean": 4.67,
        "rec_score_mean": 4.5,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.4466,
        "best_gem_comment": "",
        "workload_score_mean": 5.5,
        "best_gem_comment_short": "",
        "best_comment": "Muslim or not take this class! HDS or not take this class! The Quran is a fascinating book to explore, especially if you are familiar with any other faith based traditions. The course covers a huge scope covering structure, canonization, contextual analysis (you will read the Bible, Torah and many other inter–textual and extra textual sources too), God, life after death, prophetic stories and many other topics too. Prof. Goudarzi facilitates a very open–minded, non–sectarian and safe environment to explore the Quran without judgement.  Goudarzi's own research is also groundbreaking in its own right and it was always a treat whenever he would present on this in the class.  Super smart and humble guy! The class didn't have much emphasis on the ethics or linguistical aspects of Quranic analysis which would have been interesting but that is understandable given how jam packed the course already was. Alongside parts of the Quran as a primary readings, the other readings were fascinating, providing insights into frameworks of analysis, culture around different points in the Qurans history, key polemics, and more. Section wasn't very structured for this class this year but the class did not suffer because of that – I do think this element will be improved upon in future years for sure. Take this class and explore the Quran – a book that like the Bible has influenced the world today and how it is understood.",
        "best_comment_short": "Section wasn't very structured for this class this year but the class did not suffer because of that – I do think this element will be improved upon in future years for sure.",
        "best_comment_first": "Muslim or not take this class!",
        "course_id": "124063",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=24d10f5bcf3400a95e5ad7587066b0a3bb369a73a37c55ffc17575e926538d8521017ffff4141b811f71ef3f597630bd&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ANTHRO 1610",
        "course_title_2025": "Ethnographic Research Methods",
        "course_score_mean": 4.67,
        "rec_score_mean": 4.67,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.86875,
        "best_gem_comment": "",
        "workload_score_mean": 7.11,
        "best_gem_comment_short": "",
        "best_comment": "TAKE THIS COURSE!!! If you have any interest in Anthro, take this class, especially if it's with Dr. Fierman. She is incredible, and the course is amazing. You won't find yourself completing assignments just to do them, but instead, you will inevitably gain a deeper understanding of the topic. The mini–ethnography project is truly so fun and worthwhile. There is a lot of reading, but you will figure out how to manage it, and you will gain so much from this class.",
        "best_comment_short": "The mini–ethnography project is truly so fun and worthwhile.",
        "best_comment_first": "TAKE THIS COURSE!!!",
        "course_id": "119379",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=70411bb9882639937ff333b8979e43df5a35ed2f80eec058cfda206394ad208fe71a669068d06aa2f785ecf0363956a7&ReportType=2&regl=en-US"
    },
    {
        "course_code": "PLSH AA",
        "course_title_2025": "Elementary Polish I",
        "course_score_mean": 4.67,
        "rec_score_mean": 4.83,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.79245,
        "best_gem_comment": "",
        "workload_score_mean": 7.17,
        "best_gem_comment_short": "",
        "best_comment": "This class was absolutely incredible and was probably my favorite this semester. The quality of language instruction was incredibly high and for a language that is so difficult and unlike English, Pani Iryna did a wonderful job with balancing the difficulty of learning so many new concepts so quickly with having fun and reinforcing what we had already learned. Additionally, there were so many enriching things we did outside of class to develop our understanding of Polish language and culture including museum visits, cooking workshops, and visits from past students. Also, the Slavic department does so much amazing programming that I would highly recommend taking advantage of. The expectations of the course are very reasonable and Pani Iryna is very receptive to feedback during the course. Her feedback on assignments and homework is always incredibly fast, helpful, and thorough. I tested out of the language requirement but still took Polish to gain a better understanding of my heritage and have never had a single regret. If you are even a little interested in Polish or are looking for a fun and meaningful challenge, take this class!",
        "best_comment_short": "I tested out of the language requirement but still took Polish to gain a better understanding of my heritage and have never had a single regret.",
        "best_comment_first": "This class was absolutely incredible and was probably my favorite this semester.",
        "course_id": "123076",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=fdb1d9c7f83172324a7d500d70d2e680195cc50294dee86260c586e1e0c812354f0c0908420b90bd136d565749560578&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SOCIOL 1101",
        "course_title_2025": "Inequality Then and Now: The History of Human Suffering",
        "course_score_mean": 4.65,
        "rec_score_mean": 4.65,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9404,
        "best_gem_comment": "",
        "workload_score_mean": 5.03,
        "best_gem_comment_short": "",
        "best_comment": "TAKE THIS COURSE.  The content is so engaging (I never felt bored during a lecture) and you definitely leave the class feeling much more informed about your place in this world.  I will say that it definitely is more history–focused than I had thought, but it's easy to connect these historical topics to our current day. But, honestly I would take any class that Adaner teaches regardless of the topic.  It's clear how much he cares about his students, both as scholars and people.  He holds \"coffee chats\" after class where students can sit with him and discuss anything that they're interested in.  Everytime someone asks a question he'll nod and say \"great question\", regardless of how good the question actually is. Its clear that he wants to provide an environment where everyone feels comfortable to express their opinions and contribute to the class.",
        "best_comment_short": "Everytime someone asks a question he'll nod and say \"great question\", regardless of how good the question actually is.",
        "best_comment_first": "TAKE THIS COURSE.",
        "course_id": "222200",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=deda65f4404051e42fdf7fbad604d8bc3df0e2bb4e3b18aa42b6576bef1703e17d1c3e8823af9088abd1c8f057361d12&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SCRB 111",
        "course_title_2025": "Regeneration:  Phenomena to Mechanisms",
        "course_score_mean": 4.65,
        "rec_score_mean": 4.76,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9563,
        "best_gem_comment": "",
        "workload_score_mean": 4.18,
        "best_gem_comment_short": "",
        "best_comment": "I loved this course! The content was super interesting and taught in a very engaging manner. We learned about many cool experiments and improved our understanding of key SCRB topics. The presentations were fun to prepare and unintimidating. The creative project was also a great way to showcase your understanding in a fun and interactive manner. The exams were very manageable and rewarded you for trying your best! The teaching staff was also incredible. Professor Whited, Nick, and Deets are all very approachable, kind, and supportive.  I couldn't recommend this class enough.",
        "best_comment_short": "The creative project was also a great way to showcase your understanding in a fun and interactive manner.",
        "best_comment_first": "I loved this course!",
        "course_id": "212688",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=dd63671bc5a87b69c925b115f32478fb77cd8c97b9861023bea5b3b279726de42cdfc17d85faf2b9539f77f6b1a09651&ReportType=2&regl=en-US"
    },
    {
        "course_code": "GENED 1034",
        "course_title_2025": "Texts in Transition",
        "course_score_mean": 4.64,
        "rec_score_mean": 4.61,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9527,
        "best_gem_comment": "",
        "workload_score_mean": 4.78,
        "best_gem_comment_short": "",
        "best_comment": "There was so much potential for this class but it kinda fell short. The lectures are dry, and the assignments are not a great use of time.  It's the kind of class where everything is super structured and you know exactly how to check all the boxes, but checking them is just a lot of work and not a lot of learning, and you don't end up really thinking about anything particularly interesting. It feels a little high–schooly, all the little requirements they impose on the assignments and papers. The best GENEDs are interesting, stress–free, and offer a lot of good food for thought per time spent. This is not that.The redeeming factor was the TFs. They are excellent. Super knowledgable about the course content and adjacent fields. They make section discussions very interesting. They are friendly, extremely supportive, and available.",
        "best_comment_short": "The best GENEDs are interesting, stress–free, and offer a lot of good food for thought per time spent.",
        "best_comment_first": "There was so much potential for this class but it kinda fell short.",
        "course_id": "212840",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0ed018b2de05e4b480c9e53ff0aa17eb7e971594859268525ebe5c289fb8967dfa78c258486c3086ddc1e22903c0d097&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SCRB 197",
        "course_title_2025": "Frontiers in Therapeutics: Science of Health",
        "course_score_mean": 4.64,
        "rec_score_mean": 4.58,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9539,
        "best_gem_comment": "",
        "workload_score_mean": 4.55,
        "best_gem_comment_short": "",
        "best_comment": "Truly a class you can only take at Harvard.  The speakers invited were at the forefront of their fields in therapeutic research and the course materials really helped us develop a strong translational framework with which to evaluate current research. I think most of the bio classes are very theoretical, but this course did an amazing job at incorporating student feedback, helping us engage with the material, and understand how the research being conducted can go on to make real changes in people's livelihoods.  Alex, the TF, is definitely a standout — highly recommend trying to get her if you can. This is definitely a survey class, but a really effective one. There are MS\/MBAs, but not that much interaction between undergrads and MBAs.Assignments are weekly Canvas discussion posts, 1 paper presentation, and 2 papers. Really well–spaced out and the papers and presentation in particular really help you develop a great framework to challenge the experimental design, conclusions drawn from experimental results, and understand what are the therapeutic implications of the research presented — all things I haven't found in other courses at Harvard. Grading is fair and if you put in the work, you will definitely do well.",
        "best_comment_short": "I think most of the bio classes are very theoretical, but this course did an amazing job at incorporating student feedback, helping us engage with the material, and understand how the research being conducted can go on to make real changes in people's livelihoods.",
        "best_comment_first": "Truly a class you can only take at Harvard.",
        "course_id": "204358",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e1a6c41361872b97df0decab40760b8b1dd35f769a42f61abfd48efa24133a290dd2ac5079506aed05217f56301eb5c9&ReportType=2&regl=en-US"
    },
    {
        "course_code": "GREEK 1",
        "course_title_2025": "Introductory Ancient Greek 1",
        "course_score_mean": 4.64,
        "rec_score_mean": 4.55,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8878,
        "best_gem_comment": "",
        "workload_score_mean": 6.55,
        "best_gem_comment_short": "",
        "best_comment": "I really really enjoyed this class. It is a lot of work though, and Ancient Greek is not easy (or intuitive)!! But Nadav and Sarah are super helpful, have a lot of OH, and genuinely love Greek and you can tell. I also really love that hey incorporate ancient Greek history, art, and culture into the class, so it feels like a very immersive experience. If I wasn't a senior I would continue Ancient Greek, so my only advice is to take the course earlier rather than later because the Classics department at Harvard is so so awesome and I would love to read ancient texts in their original language.",
        "best_comment_short": "But Nadav and Sarah are super helpful, have a lot of OH, and genuinely love Greek and you can tell.",
        "best_comment_first": "I really really enjoyed this class.",
        "course_id": "203024",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b57aa026caf397b74ea23f82f86b0a90f07ee80ae5ec33c57f802156b5959323f317155f1fa00d6414f244614990efe4&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ECON 1545",
        "course_title_2025": "International Financial and Macroeconomic Policy",
        "course_score_mean": 4.64,
        "rec_score_mean": 4.54,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8591,
        "best_gem_comment": "",
        "workload_score_mean": 7.21,
        "best_gem_comment_short": "",
        "best_comment": "Take this class if you have any interest in global macro policy issues. Professor Rogoff is incredibly generous with his wisdom, and is very accessible to his students. Almost every lecture is a case study, and you will get great exposure to a variety of models.",
        "best_comment_short": "Professor Rogoff is incredibly generous with his wisdom, and is very accessible to his students.",
        "best_comment_first": "Take this class if you have any interest in global macro policy issues.",
        "course_id": "111477",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d2f0f5ba601629d09e14e04bf39d2f490df58b8654ed7b40c59b99cb50fda04678e48eabfe246e6e6dfdc23537f48efc&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SCRB 297",
        "course_title_2025": "Frontiers in Therapeutics: Science of Health",
        "course_score_mean": 4.64,
        "rec_score_mean": 4.58,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9539,
        "best_gem_comment": "",
        "workload_score_mean": 4.55,
        "best_gem_comment_short": "",
        "best_comment": "Truly a class you can only take at Harvard.  The speakers invited were at the forefront of their fields in therapeutic research and the course materials really helped us develop a strong translational framework with which to evaluate current research. I think most of the bio classes are very theoretical, but this course did an amazing job at incorporating student feedback, helping us engage with the material, and understand how the research being conducted can go on to make real changes in people's livelihoods.  Alex, the TF, is definitely a standout — highly recommend trying to get her if you can. This is definitely a survey class, but a really effective one. There are MS\/MBAs, but not that much interaction between undergrads and MBAs.Assignments are weekly Canvas discussion posts, 1 paper presentation, and 2 papers. Really well–spaced out and the papers and presentation in particular really help you develop a great framework to challenge the experimental design, conclusions drawn from experimental results, and understand what are the therapeutic implications of the research presented — all things I haven't found in other courses at Harvard. Grading is fair and if you put in the work, you will definitely do well.",
        "best_comment_short": "I think most of the bio classes are very theoretical, but this course did an amazing job at incorporating student feedback, helping us engage with the material, and understand how the research being conducted can go on to make real changes in people's livelihoods.",
        "best_comment_first": "Truly a class you can only take at Harvard.",
        "course_id": "218466",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e1a6c41361872b97df0decab40760b8b1dd35f769a42f61abfd48efa24133a290dd2ac5079506aed05217f56301eb5c9&ReportType=2&regl=en-US"
    },
    {
        "course_code": "HISTSCI 1490",
        "course_title_2025": "The History and Culture of Stigma",
        "course_score_mean": 4.63,
        "rec_score_mean": 4.63,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8779,
        "best_gem_comment": "",
        "workload_score_mean": 4.64,
        "best_gem_comment_short": "",
        "best_comment": "This class is really well taught, and both professors are very kind and knowledgeable in the field. The discussions in the class were also really good. You know how when you first got into Harvard, you wanted to take classes that felt like THE HARVARD classes you see in movies, but somewhere along the way, you got dragged into big lectures, tests, unresponsive professors, and somehow forgot the kind of education you wished to achieve at this institution? This was the class that made me reflect on that and realize that this is the first class I have taken at Harvard that made it feel like a HARVARD class, where the professors are both soo knowledgeable, the readings are so insightful, your classmates are very good at articulating their words. I learned so much in this class and the feedbacks on papers, especially the second paper. The professors are both the kindest people you will meet and always open to meeting in office hours. They know how to raise discussion questions, how to direct you toward innovation, and how to guide you. They are both amazing. The papers were fun to write. You focus on a topic you are passionate about—on an intervention you are passionate about. I WOULD HIGHLY RECOMMEND.",
        "best_comment_short": "You focus on a topic you are passionate about—on an intervention you are passionate about.",
        "best_comment_first": "This class is really well taught, and both professors are very kind and knowledgeable in the field.",
        "course_id": "110099",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=af97f695815ac484d821ca1a4a2e838eaec44b1d08e50d14f61ab4f93537a1f7b65ddcbbee2c7b6937e290103a469526&ReportType=2&regl=en-US"
    },
    {
        "course_code": "GOV 94OF",
        "course_title_2025": "Law and Politics in Multicultural Democracies",
        "course_score_mean": 4.62,
        "rec_score_mean": 4.75,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.91685,
        "best_gem_comment": "",
        "workload_score_mean": 4.33,
        "best_gem_comment_short": "",
        "best_comment": "This is an amazing class. Professor Liviatan might be the best teacher I've had at Harvard. She's exceptionally talented at leading conversations and helping students master the takeaways.  Students were more engaged in this class than any class I've been in at Harvard.Great reading list too. Ideal class for people interested in law, multiculturalism, sociology, political theory, and related topics. The assignments were great, too. Prof Liviatan really encourages us to choose a topic that is personally or professionally interesting and inspiring to us. And she emphasizes presentation\/multimedia skills. I highly, highly recommend this course.",
        "best_comment_short": "Prof Liviatan really encourages us to choose a topic that is personally or professionally interesting and inspiring to us.",
        "best_comment_first": "This is an amazing class.",
        "course_id": "128009",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8651071ca19cbc20c7e463b00cdb34dd26e2a719a311acda3094168e01a86942010829532c11ab9418cabcf78d695130&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ECON 1343",
        "course_title_2025": "The Economics of Development and Global Health",
        "course_score_mean": 4.62,
        "rec_score_mean": 4.67,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.91355,
        "best_gem_comment": "",
        "workload_score_mean": 4.49,
        "best_gem_comment_short": "",
        "best_comment": "TAKE THIS CLASS 10000%%%% it is a truly special class with an incredible professor and great TFs!!!! There are a lot of classes that if everyone in the school or in the country took, it would do the world a lot of good. This is the best example of that—I think everyone should take it. If you need an elective for Ec then DEFINITELY take it, but still take it regardless of major, because it has so much interesting content and is relevant to every field. You will learn about puzzles\/problems in global health and how people have tried to address them in the past and what worked and what did not, but you will mostly learn about how to tackle these problems and what epistemological issues led to poor solution–development in the past. Professor Basilico is brilliant and will change the way you see the world—I came out of this class a more optimistic person about lots of development issues around the world, and was motivated to do the readings (which are all fascinating and super understandable!!) including the textbook which he wrote which summarizes things really nicely and in a thought–provoking way. You'll learn the methods of lots of quasi–experimental methods in economic research on development\/health issues and also how to read and understand the numbers in those papers, which is super useful in general. They also offer lots of support for the final project, so talk to the TFs and the professor about whatever you are curious\/confused about and they'll be great help.Definitely take it—you will have a great time and learn so much.",
        "best_comment_short": "Professor Basilico is brilliant and will change the way you see the world—I came out of this class a more optimistic person about lots of development issues around the world, and was motivated to do the readings (which are all fascinating and super understandable!!)",
        "best_comment_first": "TAKE THIS CLASS 10000%%%% it is a truly special class with an incredible professor and great TFs!!!!",
        "course_id": "219614",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=40ea52f4fb31bc5f077e0262eabeeef602da89828ba2f6d7f52cd720d74dc082e8fa85de88162df77b7c04d19fb09cb7&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ECON 2110",
        "course_title_2025": "Econometrics I",
        "course_score_mean": 4.61,
        "rec_score_mean": 4.72,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.80955,
        "best_gem_comment": "",
        "workload_score_mean": 10.41,
        "best_gem_comment_short": "",
        "best_comment": "I would highly recommend this class for anyone (including undergraduates) with the right prerequisites (classes in probability, inference, linear algebra)! The course has a good mixture of mathematical derivations and empirical applications, and you will learn a ton of useful skills through the problem sets. Dr. Bruich is a great lecturer and his course materials are great foundations to econometric studies.",
        "best_comment_short": "Dr. Bruich is a great lecturer and his course materials are great foundations to econometric studies.",
        "best_comment_first": "I would highly recommend this class for anyone (including undergraduates) with the right prerequisites (classes in probability, inference, linear algebra)!",
        "course_id": "120668",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c95c80a323ce1d236972b9eafc839000213bf898687ab705f8deb3ba4cd840aee8f162665d5e6cd61f994076d0af263c&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ECON 2416",
        "course_title_2025": "Advanced Topics in Empirical Macroeconomics",
        "course_score_mean": 4.6,
        "rec_score_mean": 5.0,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.3612,
        "best_gem_comment": "",
        "workload_score_mean": 8.33,
        "best_gem_comment_short": "",
        "best_comment": "Nice course to be exposed to state–of–the art techniques and frontier topics in empirical macro",
        "best_comment_short": "Nice course to be exposed to state–of–the art techniques and frontier topics in empirical macro",
        "best_comment_first": "Nice course to be exposed to state–of–the art techniques and frontier topics in empirical macro",
        "course_id": "207940",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=11ac84b4da00f655788bc125e6d659643e9e7b01d83e6ada40adc9d30551781a292d6419b711f8b6b5c5973726b31d89&ReportType=2&regl=en-US"
    },
    {
        "course_code": "GOV 94RC",
        "course_title_2025": "Race in Comparative Perspective",
        "course_score_mean": 4.58,
        "rec_score_mean": 4.58,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9521,
        "best_gem_comment": "",
        "workload_score_mean": 7.08,
        "best_gem_comment_short": "",
        "best_comment": "I highly recommend you take this course! I learned so much about the history of race, and I loved getting the opportunity to compare it across different countries\/cultures. Plus, I loved the final essay prompt! Furthermore, as a white student, I will admit that I was somewhat nervous to take this highly discussion–based course, especially since I am not a student who usually engages with topics of race in my classes. But the discussion culture in this class was really positive! Whenever there was disagreement or strong positions things were always kept respectable (Dr. Rhodes is great at managing discussions) and people often changed their opinions during the course of a lecture. Also, even though the class was technically listed as 6–8:45, Dr. Rhodes usually would let us out at 8, so if you are considering not taking this class because of how late it is, do not let that stop you! It also was not bad having a nighttime course and freeing up my schedule more during the day. There are a lot of readings in the course, but they are all pretty straightforward and Dr. Rhodes does an incredible job curating readings that are actually interesting. I have taken so many gov classes here where I feel like I learned nothing by doing the readings, but that is SO NOT THE CASE with this course.",
        "best_comment_short": "There are a lot of readings in the course, but they are all pretty straightforward and Dr. Rhodes does an incredible job curating readings that are actually interesting.",
        "best_comment_first": "I highly recommend you take this course!",
        "course_id": "218734",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4b79f516dbc1ca684d88bcde408005f5bb13c4987eec46e0abd69c86e7e37307a4672aacef8222ddf4b300d169cdcafd&ReportType=2&regl=en-US"
    },
    {
        "course_code": "GOV 94GK",
        "course_title_2025": "The Politics and Ethics of Health Care",
        "course_score_mean": 4.58,
        "rec_score_mean": 4.67,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.95325,
        "best_gem_comment": "",
        "workload_score_mean": 6.58,
        "best_gem_comment_short": "",
        "best_comment": "Really interesting course materials. Gabe is a great professor. The exam is hard, and considering GOV 94s normally do not have exams, if this component scares you I would not take this course. Super interesting topics covered across the course. You will leave with a good understanding of different ethical concepts and how they conflict with health care, as well as the health care system. Wish we covered the readings and challenges of the health care industry more, felt like we were rushing sometimes. Make sure if you take this class you are good with exams. An understanding of ethics would be helpful before taking it.",
        "best_comment_short": "You will leave with a good understanding of different ethical concepts and how they conflict with health care, as well as the health care system.",
        "best_comment_first": "Really interesting course materials.",
        "course_id": "109731",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=648f67b1792ecf1916a4d4163a59604e953b73bd78416e8199efdf5268448be9b5ce9ada2617df4aa8096af40ecaa50e&ReportType=2&regl=en-US"
    },
    {
        "course_code": "HIST 12M",
        "course_title_2025": "Abolitionist Women and Their Worlds",
        "course_score_mean": 4.58,
        "rec_score_mean": 4.42,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.93735,
        "best_gem_comment": "",
        "workload_score_mean": 7.55,
        "best_gem_comment_short": "",
        "best_comment": "Really amazing class with great people and prof, but definitely very humanities and you really need to love primary source work and the time period to get something out of the class. If that sounds like you, then you'll love it.",
        "best_comment_short": "Really amazing class with great people and prof, but definitely very humanities and you really need to love primary source work and the time period to get something out of the class.",
        "best_comment_first": "Really amazing class with great people and prof, but definitely very humanities and you really need to love primary source work and the time period to get something out of the class.",
        "course_id": "216001",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=fc8af4464a61986cbf6e7af3065d2fc1410cdb44dc704d04a5f0e3eaf88ccbecfd8158d9a399121bcb4215fdc81010e0&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ESE 169",
        "course_title_2025": "Field and Lab-Based Seminar on Local Pollution Issues",
        "course_score_mean": 4.58,
        "rec_score_mean": 4.55,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.951,
        "best_gem_comment": "",
        "workload_score_mean": 6.58,
        "best_gem_comment_short": "",
        "best_comment": "You definitely learn a lot about research skills in environmental engineering, but this class was much more literature review, policy, and health related than I thought it would be. I found the data collection, trips, and analysis much more interesting, but they were hard to follow as they were mostly done for us and we didn't do any of our own coding.  This class is great if you're interested in environmental effects on health or science writing and want to look closely at one issue in preparation for research. I would recommend some prior research work though and ideally be a junior\/senior.",
        "best_comment_short": "This class is great if you're interested in environmental effects on health or science writing and want to look closely at one issue in preparation for research.",
        "best_comment_first": "You definitely learn a lot about research skills in environmental engineering, but this class was much more literature review, policy, and health related than I thought it would be.",
        "course_id": "109341",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=63d48e7c5e16dabd3ae351535f2cbbb61f7abf044e6cd927623b67f6341dd73fcfbf8c6636ea9074e62e020ba58ac0aa&ReportType=2&regl=en-US"
    },
    {
        "course_code": "E-PSCI 169",
        "course_title_2025": "Field and Lab-Based Seminar on Local Pollution Issues",
        "course_score_mean": 4.58,
        "rec_score_mean": 4.55,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.951,
        "best_gem_comment": "",
        "workload_score_mean": 6.58,
        "best_gem_comment_short": "",
        "best_comment": "You definitely learn a lot about research skills in environmental engineering, but this class was much more literature review, policy, and health related than I thought it would be. I found the data collection, trips, and analysis much more interesting, but they were hard to follow as they were mostly done for us and we didn't do any of our own coding.  This class is great if you're interested in environmental effects on health or science writing and want to look closely at one issue in preparation for research. I would recommend some prior research work though and ideally be a junior\/senior.",
        "best_comment_short": "This class is great if you're interested in environmental effects on health or science writing and want to look closely at one issue in preparation for research.",
        "best_comment_first": "You definitely learn a lot about research skills in environmental engineering, but this class was much more literature review, policy, and health related than I thought it would be.",
        "course_id": "216016",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=63d48e7c5e16dabd3ae351535f2cbbb61f7abf044e6cd927623b67f6341dd73fcfbf8c6636ea9074e62e020ba58ac0aa&ReportType=2&regl=en-US"
    },
    {
        "course_code": "AFVS 55P",
        "course_title_2025": "Embodied Practices: Coding and Interactivity for Artists",
        "course_score_mean": 4.57,
        "rec_score_mean": 4.86,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9688,
        "best_gem_comment": "",
        "workload_score_mean": 6.33,
        "best_gem_comment_short": "",
        "best_comment": "Take this course! This is easily one of the best courses I have taken while in college. Pascale is a FANTASTIC teacher and an incredibly kind, supportive person who really wants to see you succeed and achieve your own goals. She was organized, provided thorough feedback, and made herself available to help.This class teaches you real skills that can be incorporated into many different spheres. It was really empowering to learn things that I can actually use (in my art practice and regular life) and to build things with my own hands. Pascale did an amazing job of demystifying tools and methods that can seem inaccessible and intimidating.The assignments are structured enough to give you an idea of what is expected, but open enough to allow you plenty of artistic freedom. The assignments could take me a long time, but I often didn't even notice because they were so much fun to work on. The final project can be demanding, but was really enjoyable and rewarding! I appreciated that this class is accessible to anyone (coding experience in the class ranged from none to very experienced\/skilled). It was great that we had the flexibility to push ourselves, and that Pascale seemed able to understand how much to push each person based on their previous experience.",
        "best_comment_short": "Pascale is a FANTASTIC teacher and an incredibly kind, supportive person who really wants to see you succeed and achieve your own goals.",
        "best_comment_first": "Take this course!",
        "course_id": "224441",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=72a6e930486b8a58ed27d43234cfc22296341777a3cc2c5d29d656ea78cda3b4182d10b1b5edeed08574f481cb277779&ReportType=2&regl=en-US"
    },
    {
        "course_code": "HIST 1993",
        "course_title_2025": "Introduction to Digital History",
        "course_score_mean": 4.57,
        "rec_score_mean": 4.86,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.7767,
        "best_gem_comment": "",
        "workload_score_mean": 8.0,
        "best_gem_comment_short": "",
        "best_comment": "This has been one of the most important classes I have taken at Harvard because it taught be both methodological means to research, gave me meta–instruction on how to best organise research, and most importantly got me to think about how technology can be thoughtfully integrated into our academic lives. This is one of the only classes that actively seeks to integrate and understand available technology rather than shunning or regulating it, and I feel that that is a much more productive way to understand the age we live in. The final project of a digital gallery is also extremely thoughtful as it forces us to think about how to keep research relevant in a digital age –– surely data cannot just all be expressed in written papers. Professor Pizzorno is also a really supportive professor who makes the class what it is, giving us a chance to experiment and fail, and is genuinely committed to our learning. All in all, take the class, if you're any bit interested in rethinking how we study humanities.",
        "best_comment_short": "This has been one of the most important classes I have taken at Harvard because it taught be both methodological means to research, gave me meta–instruction on how to best organise research, and most importantly got me to think about how technology can be thoughtfully integrated into our academic lives.",
        "best_comment_first": "This has been one of the most important classes I have taken at Harvard because it taught be both methodological means to research, gave me meta–instruction on how to best organise research, and most importantly got me to think about how technology can be thoughtfully integrated into our academic lives.",
        "course_id": "156564",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0f0f71ea5b0c4ab7baf4b2925ad0f08f86551b904218f58586cd9e4a25d9e177af9f12d9736769babc9fb33547010eb3&ReportType=2&regl=en-US"
    },
    {
        "course_code": "FYSEMR 73F",
        "course_title_2025": "Socialism",
        "course_score_mean": 4.57,
        "rec_score_mean": 4.57,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9664,
        "best_gem_comment": "",
        "workload_score_mean": 5.71,
        "best_gem_comment_short": "",
        "best_comment": "This is a thought–provoking class, where you learn and build knowledge on socialist theories as a comparison to the status quo. Even if you are not into economics or philosophy this is still one of the only classes from which you actually take a way a lot of interesting information. Professor Marglin is such a sweetheart, he brought us apples from his orchard every single class, and was always attentive to what we had to say. He offers awesome feedback and is a unique resource in the economics department. Every class we had interesting perspectives on socialism, and Professor Marglin didn't shy away from listening to contrarian arguments. He also did well in selecting the members of the seminar, and if you want a course where you get to know your classmates really well on an intellectual level this is such a good pick. The readings were moderate in workload, but it is a seminar afterall and their all relevant to studying economics. I think the best thing about this class is the liberty to think and understand the readings, something you don't often see in economics courses that just assume an ideal market.",
        "best_comment_short": "I think the best thing about this class is the liberty to think and understand the readings, something you don't often see in economics courses that just assume an ideal market.",
        "best_comment_first": "This is a thought–provoking class, where you learn and build knowledge on socialist theories as a comparison to the status quo.",
        "course_id": "222542",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f89924b2c6011f826ddc4c6e017a1f52bb40b7294dd94f4ba5e61324cc6a1a30d4cca6d9f8f72383ce0890a9b11bb0cb&ReportType=2&regl=en-US"
    },
    {
        "course_code": "MATH 114",
        "course_title_2025": "Analysis of Function Spaces, Measure and Integration",
        "course_score_mean": 4.57,
        "rec_score_mean": 4.4,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.88915,
        "best_gem_comment": "",
        "workload_score_mean": 6.99,
        "best_gem_comment_short": "",
        "best_comment": "Wow this class is so great with Kevin!!!! He is incredible!! An amazing lecturer and helps distill the information down into a much more digestable format. The support was great, TFs were great, assignments were hard but fair, assessments were also fair, but definitely there was the sense that your learning is prioritized over everything else, which definitely took the stress off to some degree. I didn't have much experience taking pure math classes because I was nervous about them being too challenging, but this class definitely made me think really hard about some interesting material and in such a supportive and accessible environment. Having math background is definitely necessary, and analysis and topology background makes it way easier, but I didn't have either and still things turned out fine. I would definitely recommend with enthusiasm ANY class that Kevin teaches, because he was so pivotal in making this class what it was. He was incredibly kind, patient, and thoughtful and made the classroom environment fun and lighthearted!!",
        "best_comment_short": "The support was great, TFs were great, assignments were hard but fair, assessments were also fair, but definitely there was the sense that your learning is prioritized over everything else, which definitely took the stress off to some degree.",
        "best_comment_first": "Wow this class is so great with Kevin!!!!",
        "course_id": "123227",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=224a7fe82852e13250ca1de4820c4f3d1745f75896799a8d1467212c6940ed75fd22897901099632e7b4df5bafa16c76&ReportType=2&regl=en-US"
    },
    {
        "course_code": "LING 73A",
        "course_title_2025": "Beginning American Sign Language I",
        "course_score_mean": 4.57,
        "rec_score_mean": 4.69,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8897,
        "best_gem_comment": "",
        "workload_score_mean": 4.69,
        "best_gem_comment_short": "",
        "best_comment": "Of all languages, TAKE ASL!!!! Firstly, it will likely be a bit easier to learn if English is your first language. But more importantly, ASL is SO MUCH FUN, engaging, intellectual, emotional, and lively!! Its culture is so vibrant and being able to connect with others through signing is a completely different experience from talking with someone new. I was in Professor Tomita's section and she was an INCREDIBLE teacher. She made class so engaging and fun and really challenged us when it came to quizzes or assignments. Because of her, I already feel so comfortable with signing. With that being said, you will always get more from a class if you put more excitement and energy into it, so I suggest doing that as well! Practice in your free time, watch ASL videos or shows in ASL, read articles, etc. Go out of your way to find signers to practice with. Definitely top 10 experiences at Harvard or classes I've taken.",
        "best_comment_short": "But more importantly, ASL is SO MUCH FUN, engaging, intellectual, emotional, and lively!!",
        "best_comment_first": "Of all languages, TAKE ASL!!!!",
        "course_id": "203507",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=cfd6da11975e5925bf7d84c79f64192af68a6bbe075639787c8c5ba39006999acf4256e2d2160bf75e2598abe8ae659c&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ESPP 90G",
        "course_title_2025": "The Law and Policy of Climate Change: Influencing Decision Makers",
        "course_score_mean": 4.56,
        "rec_score_mean": 4.4,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9789,
        "best_gem_comment": "",
        "workload_score_mean": 6.1,
        "best_gem_comment_short": "",
        "best_comment": "This is a fantastic class. Joroff is an amazing and very friendly professor, and brings snacks to each class. The meeting time is later at night, which is a bit challenging morale–wise, but the class itself is so interesting and well–taught that it makes up for the late hour. You build a really great community with the other students, and the conversations and assignments are fascinating and stimulating. Joroff is always willing to meet and answer your questions, and is super accessible. Only thing to keep in mind– this class is definitely technical, and as someone with no law or government background, there was a bit of a learning curve. Also, the assignments were graded a bit harshly, and it was difficult to improve for the subsequent assignment, since each paper tests a different legal skill and doesn't build off of the previous. Definitely rewarding, but more time–consuming and a little more challenging than expected.",
        "best_comment_short": "You build a really great community with the other students, and the conversations and assignments are fascinating and stimulating.",
        "best_comment_first": "This is a fantastic class.",
        "course_id": "208113",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=32d90f08c8699c3b664bce71c923ca7c97d194783c14c506bd9874cf3da47d9761b8136cf368d1df402a7dd14663fe7d&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ARABIC AA",
        "course_title_2025": "Elementary Arabic I",
        "course_score_mean": 4.56,
        "rec_score_mean": 4.75,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.99015,
        "best_gem_comment": "",
        "workload_score_mean": 11.44,
        "best_gem_comment_short": "",
        "best_comment": "Coming from a native\/heritage\/at–home Arabic speaker who did not know how to read or write before entering this class, I highly recommend it for anyone with any level of interest in the class. The staff, especially my teacher, Dana Malhas, do an amazing job of synthesizing a very diverse class in terms of skill level. My class contained those with reading\/writing backgrounds but no understanding of the language due to Islamic studies, students like myself who could speak but not write, and students who had absolutely no Arabic experience. I was so impressed by how Dana made the class fun, interesting, and useful for everyone in it. If you have no experience, you will have to put in a lot of work to learn the letters and sounds, but there is SO much in class practice that you can do it. There are also lovely gatherings and outings during which you can practice your Arabic and any level of interaction is encouraged at those events. I had an amazing time in this class and it brought me a lot closer to my Arabic–speaking family; I can’t recommend it more! There is SO much support for you; do not be intimidated by the fact that it is a difficult language. It is difficult, but also beautiful and worth the effort. I made so many friends in class, too, because we do lots of talking and getting to know each other! Take AA!!!!!",
        "best_comment_short": "I was so impressed by how Dana made the class fun, interesting, and useful for everyone in it.",
        "best_comment_first": "Coming from a native\/heritage\/at–home Arabic speaker who did not know how to read or write before entering this class, I highly recommend it for anyone with any level of interest in the class.",
        "course_id": "116746",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7482b024a3537b5379de4082f1c33dbc6e4071e7fc1bf835713cb43d68fb587fb3b2a2175bd49c9987368339e9458200&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SOCIOL 98HB",
        "course_title_2025": "Junior Tutorial: Online Communities",
        "course_score_mean": 4.56,
        "rec_score_mean": 5.0,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9523,
        "best_gem_comment": "",
        "workload_score_mean": 4.78,
        "best_gem_comment_short": "",
        "best_comment": "If you are reading this, you are taking a junior tutorial because you have to, but if you can rank them, I would definitely put Professor Halford high on your ranking. She is such an intelligent woman who showed genuine interest in every single persons project and interests. She was great at keeping discussions going and challenging what you had said without making it sound condescending or like she was doubting your intelligence. Her feedback on assignments was so well done and quickly returned, and I feel like I learned so much in this course through my research.",
        "best_comment_short": "She was great at keeping discussions going and challenging what you had said without making it sound condescending or like she was doubting your intelligence.",
        "best_comment_first": "If you are reading this, you are taking a junior tutorial because you have to, but if you can rank them, I would definitely put Professor Halford high on your ranking.",
        "course_id": "224589",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c654529d5bb5b12cca79d1944e92531db2a3e27591efcb73061b7b129a6e8a66ca92a8ad97d8d7a691aa04638918f33a&ReportType=2&regl=en-US"
    },
    {
        "course_code": "MATH 101",
        "course_title_2025": "Sets, Groups, and Real Analysis",
        "course_score_mean": 4.56,
        "rec_score_mean": 4.44,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.7372,
        "best_gem_comment": "",
        "workload_score_mean": 10.5,
        "best_gem_comment_short": "",
        "best_comment": "Incredible class! Demarco is the best you could hope for. The course is a great introduction to pure math for anyone with absolutely no background in it. It assumes no prior knowledge and really builds up your proof–writing abilities from ground zero. Demarco's lecture notes are wonderful, and the other texts in the course basically just provide further detail. The p–sets are pretty difficult, especially at the beginning, but they seem to get easier throughout the semester as you get the hang of things. I would say the level of the problems was pretty perfect, because it felt challenging and interesting but it really was something that we would be able to do. The CA's are really great and offer tons of OH for when you are stuck. The structure of the classes is that the first half or so is lecture, then you spend the next half working in groups on worksheet problems (usually short proofs). It is super valuable practice and a great time to get feedback from CA's. There was even more practice available in the weekly sections. Exams were not as challenging as homeworks and did not feel too rushed for a class period. All of this feedback comes with the caveat that things may be different under a different instructor, and Demarco won't be teaching next year. However, I think this class is generally well–run and a good introduction to the field if you have an interest. Also, if you ever get a chance to take a class with Demarco, take it!!",
        "best_comment_short": "It is super valuable practice and a great time to get feedback from CA's.",
        "best_comment_first": "Incredible class!",
        "course_id": "122943",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ec0bc779cda9db56447b10a6eff16affe29031d857d2c280072f3cf211706d6c367b79f7c78650f8502f9035d8001cd5&ReportType=2&regl=en-US"
    },
    {
        "course_code": "PHYSICS 125",
        "course_title_2025": "Widely Applied Physics",
        "course_score_mean": 4.54,
        "rec_score_mean": 4.46,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.924,
        "best_gem_comment": "",
        "workload_score_mean": 7.0,
        "best_gem_comment_short": "",
        "best_comment": "This class is amazing! You will learn so much about so many incredibly useful and interesting topics and your physical understanding and problem solving skills will really improve. Other courses usually just have one huge topic and as soon as you stop following in a week you are cooked for the rest of the class. Since you basically do a new topic every week it does not hurt too much if you do not understand something (as long as you catch up with it for exams later on) so it is a great course to balance some other classes. It really fuelled my enthusiasm for physics again that I thought I lost at college and it is great fun. Above all, however, Prof Morin is simply amazing as everyone can tell who ever took a class with him. He is so incredibly structured and really cares about your experience in the class (he also did further readings if we asked silly questions that he could not answer in lecture and sent us follow up emails with further nerdy knowledge). And if you get Anmol as your TF then this class gets even more amazing because he is phenomenal! Take it, take it, take it!!!",
        "best_comment_short": "You will learn so much about so many incredibly useful and interesting topics and your physical understanding and problem solving skills will really improve.",
        "best_comment_first": "This class is amazing!",
        "course_id": "120167",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=92add963537b6f4aae2d1479161616cb492ba2cae5f4a0571f897f2b0a929f98d9e7740e92453412f933b4baf9da8ab6&ReportType=2&regl=en-US"
    },
    {
        "course_code": "GOV 1249",
        "course_title_2025": "Authoritarianism",
        "course_score_mean": 4.54,
        "rec_score_mean": 4.52,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.90165,
        "best_gem_comment": "",
        "workload_score_mean": 5.69,
        "best_gem_comment_short": "",
        "best_comment": "This is one of the best gov classes I have taken at Harvard (and I have taken many). It is extremely engaging and covers interesting topics. It made me engage in class a lot because I enjoyed it so much and would even read a lot about the topics outside of class. Professor Hummel is absolutely amazing and very knowledgeable. She does a great job in incorporating interesting readings, some short videos in class, and captures a wide array of different views on each topic. The assignments were honestly so fun that I had a hard time sticking to the page limit because there was so much to explore. You get to dive deeper into a dictatorship and learn a lot based on your own interests in this class which is awesome! My TF Shady was also an asset to this class. Sections were extremely engaging and hearing about his personal experience was a huge benefit. Please please don't hesitate to take this amazing course!",
        "best_comment_short": "Please please don't hesitate to take this amazing course!",
        "best_comment_first": "This is one of the best gov classes I have taken at Harvard (and I have taken many).",
        "course_id": "213430",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e82cb5999a65c4e98565b094d207cfb83dba182ce97dab136a12ab5a279dc237e93b80c2491f42c7619983f59edab120&ReportType=2&regl=en-US"
    },
    {
        "course_code": "MATH 122",
        "course_title_2025": "Algebra I: Theory of Groups and Vector Spaces",
        "course_score_mean": 4.54,
        "rec_score_mean": 4.45,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.85665,
        "best_gem_comment": "",
        "workload_score_mean": 8.41,
        "best_gem_comment_short": "",
        "best_comment": "Prof. Harris is amazing, and the CAs are all great and super willing to help out in class. It's a great class regardless of whether you plan to study more theoretical math or not.In terms of content, I would say it is pretty manageable especially if you have some background in abstract algebra (i.e. linear algebra or further) and\/or proof–writing, though definitely not a necessary pre–req. Homework is weekly, a bit on the longer side (occasionally some rather tedious exercises) but quite straightforward (takes around 10 hours at most, and Harris is super lenient about extensions). The main textbook (D&F) and class content align pretty closely, so it is helpful to look at. The final follows very closely from homework so if you do well on psets\/understand how to do the problems then you should be set! My only minor concern throughout is that we get feedback on homework quite late, though homework solutions are posted for reference which is nice. Overall a really good class :)",
        "best_comment_short": "Prof. Harris is amazing, and the CAs are all great and super willing to help out in class.",
        "best_comment_first": "Prof. Harris is amazing, and the CAs are all great and super willing to help out in class.",
        "course_id": "122603",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=60494d9eb6c66a2bd7674e31137ae4063c0b5c21deb39e88a571f6ae2544c6914d19c1bd6dafae002bcd2baeae4c1ff6&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ENG-SCI 221",
        "course_title_2025": "Drug Delivery",
        "course_score_mean": 4.53,
        "rec_score_mean": 4.78,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8554,
        "best_gem_comment": "",
        "workload_score_mean": 4.33,
        "best_gem_comment_short": "",
        "best_comment": "Workload: The workload is very manageable as long as you're organized and put in consistent effort. There are typically two assignments due per week, but there are no exams, which is a huge plus. The class structure allows you to focus on assignments and presentations rather than memorizing content for exams. The final project, which is group–based, is a great opportunity to collaborate and apply what you’ve learned.Participation: Participation is a key component of this class. Be prepared to actively engage in discussions and contribute to the presentations. This course thrives on student involvement, and your insights will help deepen your understanding of the material. Stay involved, ask questions, and share your thoughts during discussions!Professor: Professor Mitragotri is a true expert in drug delivery systems. His deep knowledge and passion for the subject shine through in every lecture. He’s very approachable and truly cares about student learning. You will gain so much from his expertise, but also expect to be challenged to think critically and deeply about the subject matter.Overall: 10\/10 – This course offers a perfect blend of theory, application, and real–world relevance. Whether you are interested in drug delivery, biomedical engineering, or the intersections of science and business, this course will leave you with invaluable insights and skills.",
        "best_comment_short": "The final project, which is group–based, is a great opportunity to collaborate and apply what you’ve learned.Participation: Participation is a key component of this class.",
        "best_comment_first": "Workload: The workload is very manageable as long as you're organized and put in consistent effort.",
        "course_id": "122340",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ee81e81dfbd6e7d22c7bfd016be772cd52ee530faffd91d0cb0a28206e06cf185a4f6a11472a16044d74c8963b228129&ReportType=2&regl=en-US"
    },
    {
        "course_code": "HUMAN 10A",
        "course_title_2025": "A Humanities Colloquium from Homer to Joyce",
        "course_score_mean": 4.52,
        "rec_score_mean": 4.64,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9246,
        "best_gem_comment": "",
        "workload_score_mean": 9.06,
        "best_gem_comment_short": "",
        "best_comment": "This class is very fast–paced and can feel overwhelming at times, but I 100% recommend taking it. When I was deciding whether or not to take this course, I weighed 3 important factors: (1) I had always wanted to read some of the texts on the syllabus after hearing about them through so many history classes in high school, and I didn't know when else I would get the chance to read these texts (2) None of the expos course options particularly excited me and I thought it would be better to spend a year engaging with content that actually excited me rather than a semester with content I was not passionate about (3) I am thinking of being on the pre–med track, for which I would need 2 semesters of English classes, and this course would fulfill that relatively early on in my college experience (as opposed to doing expos now and another elective later on). Given these factors, I felt that I should take this course and I wanted to share this thinking in hopes that it can help other students when making the decision of whether to enroll in Hum10. You will definitely be spending a LOT of time on this course because you have 3 meeting times for this class (which is significantly more than expos I believe) because the reading is very intensive. So that could be another factor to consider when deciding whether to enroll. I won't lie, this class can get out of your hands very quickly –– if you miss one book it is very hard to keep going and catch up simultaneously. While it is possible to rely on SparkNotes to know just enough about the texts for lecture and seminar, this will hurt you in the end for the final (which is a pretty intensive exam), and you may feel unfulfilled not having read all the books which were the reason you decided to take this class. Thus, I recommend making a schedule for how much reading you will get done and when (since Lectures are on Tuesday and Seminar Wednesday, view your week as starting on Wednesday and incrementally work through the books until Monday night \/ Tuesday). I feel that because there are no actionable assignments tied to reading, it can become easy to forget \/ overlook until the night before lecture (especially when you have a million other assignments\/psets\/deliverables\/things going on freshman year), thus I think this schedule could be incredibly helpful. The lectures are very cool because you are learning from world–renowned professors, but they can be a bit broad sometimes and I feel don't always do complete justice to the text (which is okay given the fact it is only 75 minutes on some of the most iconic texts in history). However, I feel that the seminars are where the real edification happens. It can be daunting to initially start speaking in seminar, you will probably feel that your thoughts\/insights\/ideas are not as profound as everyone else's and thus not speak. BUT I promise, everyone else feels the exact same way in the beginning (we all ended up talking about this in the beginning), and the professors\/TFs are very open to hearing your thoughts –– they want to hear you speak so they won't judge you negatively for whatever you say (unless it is horribly far off from the text\/shows you didn't read). It's always best to give it a shot and raise your hand, share your thoughts and questions and actively engage in both seminar and lab. I have become a much deeper thinker from this, I found that after the first few seminars, I approached the texts differently and began to ask much more acute questions while reading –– helping to not only prepare me for the next seminar discussion (and eventually, the final exam) but also extract more meaning from the texts. I have definitely learned how to ask better questions and become a better thinker. At the end of the day, make sure to speak in seminar because (1) you will feel better about actively engaging from the texts \/ getting your questions answered (2) other students may be thinking the same \/ could benefit from your points \/ questions (3) participation MATTERS. To that end, don't put too much pressure on yourself to speak either. The paper assignments can be scary, especially since they are worth so much of your grade, but I 100% recommend start planning early, go to your TF office hours, and go to the writing center so that you can plan your writing around when those meeting times are to ensure you are making progress and on track to revise\/edit\/flush out all your points in time for  the deadline. I also recommend signing up for a hum10 mentor and asking them for help! One thing I regret is not going to office hours of other profs\/TFs, it is a rare opportunity to learn from these acclaimed professors, and I wish I went to OH more often. I hope this information\/advice is helpful in deciding (1) whether or not to take this course and (2) how to approach this course once you decide to take it (you definitely should!)I was very apprehensive initially, but I am very glad I took the course and this is all information I wish I knew ahead of time.",
        "best_comment_short": "It's always best to give it a shot and raise your hand, share your thoughts and questions and actively engage in both seminar and lab.",
        "best_comment_first": "This class is very fast–paced and can feel overwhelming at times, but I 100% recommend taking it.",
        "course_id": "110440",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d7ba6a358399fc80eaa308f040551eac5edfca781798ebfc02eeda943d17043782f797371b8c5f118d5f0d5e3b0c7a63&ReportType=2&regl=en-US"
    },
    {
        "course_code": "FOLKMYTH 140",
        "course_title_2025": "Jewish Magic and Folklore: Messages from beyond the Mountains of Darkness",
        "course_score_mean": 4.5,
        "rec_score_mean": 4.44,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.84535,
        "best_gem_comment": "",
        "workload_score_mean": 6.67,
        "best_gem_comment_short": "",
        "best_comment": "Great class. Super interesting and would recommend for people from all backgrounds. I learned a lot and enjoyed the discussions. Very different from classes that I've taken before (in a good way).",
        "best_comment_short": "Super interesting and would recommend for people from all backgrounds.",
        "best_comment_first": "Great class.",
        "course_id": "224633",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=06b69ba9c8695beb658c30c1cc8f7fda4d66e7bc2ab107a281e7843b264a40b3632fd12580a623f0768d375a4bdb8303&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ANTHRO 98A",
        "course_title_2025": "Junior Tutorial in Anthropology",
        "course_score_mean": 4.5,
        "rec_score_mean": 4.75,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.94245,
        "best_gem_comment": "",
        "workload_score_mean": 4.5,
        "best_gem_comment_short": "",
        "best_comment": "Of course, this tutorial is a required course for the anthropology concentration, but I think it was an almost exclusively enjoyable experience! It's probably one of the least arduous junior tutorials, and it's definitely much less taxing than sophomore tutorial. This course is critical for expanding your view of anthropologists' roles and for planning your senior thesis (whether or not that's something you're sure you'd like to do). It's also a really enjoyable class due to the strong support system, including both course staff and the rest of your cohort.",
        "best_comment_short": "It's also a really enjoyable class due to the strong support system, including both course staff and the rest of your cohort.",
        "best_comment_first": "Of course, this tutorial is a required course for the anthropology concentration, but I think it was an almost exclusively enjoyable experience!",
        "course_id": "205494",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8ccf946d7ed2c18a8c73b2b276242ee94931aea3e662439834be6bba4a4bbbd7640c117768702e2594fbb21d77e9974a&ReportType=2&regl=en-US"
    },
    {
        "course_code": "HEB 115",
        "course_title_2025": "Investigating the Human Genome",
        "course_score_mean": 4.5,
        "rec_score_mean": 4.33,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.94955,
        "best_gem_comment": "",
        "workload_score_mean": 7.55,
        "best_gem_comment_short": "",
        "best_comment": "This class is pretty good. It's a surprising amount of work so don't let it catch you off guard. You can get by without doing the readings but they're there if you want them. Eaodain is super friendly and supportive, so it makes you want to do well to just match her energy. It's really fun to stick with an unknown genome and characterize it over the course, but make sure to not leave everything until the last minute because sometimes the Jupyter notebook coding is a pain. But writing weekly practicals really helps you become a better scientific writer by seeing what's important to include or what not to write about.",
        "best_comment_short": "Eaodain is super friendly and supportive, so it makes you want to do well to just match her energy.",
        "best_comment_first": "This class is pretty good.",
        "course_id": "222982",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ee31714209c4701ccd895b313bf2284ee84b650d763160dc036de9a794a5584543a24831e2f4e8481525dbc214cb77f3&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ECON 1640",
        "course_title_2025": "Industrial Organization: Theory and Applications",
        "course_score_mean": 4.5,
        "rec_score_mean": 4.5,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9124,
        "best_gem_comment": "",
        "workload_score_mean": 5.67,
        "best_gem_comment_short": "",
        "best_comment": "I really enjoyed this course. The first half was a bit dense and a review of micro, but I found the second half to be more real–world applicable. This is honestly my favorite econ elective I have taken. The class is very manageable –– the PSETs are super doable and the midterm is very fair. The course is very well taught. Robin does a great job making the material comprehensible and engaging the class in interesting applications\/examples of these theoretical models at play. Ruby's sections are also very helpful for clearing up confusion. I would highly recommend taking this course as the workload is light and the material is interesting!",
        "best_comment_short": "Robin does a great job making the material comprehensible and engaging the class in interesting applications\/examples of these theoretical models at play.",
        "best_comment_first": "I really enjoyed this course.",
        "course_id": "116133",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8586824aae00b4d4bd962fc32cb40b115ef0b83f8dd94f6af35d27857254ad1a6a5766f04c2e75db448a0f686d86c585&ReportType=2&regl=en-US"
    },
    {
        "course_code": "MCB 127",
        "course_title_2025": "Organelle Biology and Cellular Function",
        "course_score_mean": 4.5,
        "rec_score_mean": 4.9,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8427,
        "best_gem_comment": "",
        "workload_score_mean": 4.6,
        "best_gem_comment_short": "",
        "best_comment": "TAKE THIS CLASS!! It was challenging at first not having the strongest bio foundation, but the over and over practice of reading and presenting journal articles \/ experiments really forces you to get comfortable with how cell bio research works, what the common methods are, what the language means, etc. Also gives you a super strong foundation in cell bio that will carry forward. Small class size and amazing instructors make it such a wonderful, communal environment.",
        "best_comment_short": "Small class size and amazing instructors make it such a wonderful, communal environment.",
        "best_comment_first": "TAKE THIS CLASS!!",
        "course_id": "224454",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b5156ea48646913d59955125533ab1a997794992d13121e872d94413bfc8712c7376ae2646c27acbdb828b6ce2bae9be&ReportType=2&regl=en-US"
    },
    {
        "course_code": "MCB 99A",
        "course_title_2025": "Laboratory Research for Honors Thesis",
        "course_score_mean": 4.5,
        "rec_score_mean": 4.6,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": -0.3865,
        "best_gem_comment": "",
        "workload_score_mean": 16.5,
        "best_gem_comment_short": "",
        "best_comment": "",
        "best_comment_short": "",
        "best_comment_first": "",
        "course_id": "122530",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ba22ecf304a2fc095f3b0ec29dfccc07bcc9206d06188703c22be0564fee831ed2de6d6c53fb47a58b67542394db2873&ReportType=2&regl=en-US"
    },
    {
        "course_code": "CLS-STDY 97A",
        "course_title_2025": "Introduction to the Ancient Greek World",
        "course_score_mean": 4.48,
        "rec_score_mean": 4.3,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8883,
        "best_gem_comment": "",
        "workload_score_mean": 5.05,
        "best_gem_comment_short": "",
        "best_comment": "I took this class as a math and physics concentrator looking for something light and interesting to fulfill my Arts and Humanities requirement. I've always been interested in history, but up until this course had never taken a history course at Harvard. It was a great class, and while most people in it were classics\/adjacent to classics, I never felt out of place or like I couldn't contribute ideas for lack of requisite background knowledge.It's a fairly standard survey of ancient Greek history, from the Minoans to the Romans. The primary source readings are quite interesting and read surprisingly easy. You should read Herodotus and Thucydides for section; admittedly, the secondary scholarship readings are a bit of a bore. I did wish the course spent more time on the 4th century period between the Peloponnesian War and Philip's conquests. Prof. Kosmin is great. I think he struck the right balance in acknowledging, for better or worse, the influence Greece – or the ideal of Greece – has had, currently has, and will continue to have on Western society.",
        "best_comment_short": "The primary source readings are quite interesting and read surprisingly easy.",
        "best_comment_first": "I took this class as a math and physics concentrator looking for something light and interesting to fulfill my Arts and Humanities requirement.",
        "course_id": "116729",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=12c416a60a61787e3d1788be16e33259915098df56bebeff92fc902575c58a0d06b562651d720cee601eab45ef1ae788&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SPANSH 59",
        "course_title_2025": "Spanish and the Community",
        "course_score_mean": 4.46,
        "rec_score_mean": 4.62,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9276,
        "best_gem_comment": "",
        "workload_score_mean": 5.54,
        "best_gem_comment_short": "",
        "best_comment": "TAKE THIS CLASS!! It is super wholesome and I loved being able to connect with the local community. Profe Parra is super understanding of students' schedules outside of the classroom. The assignments and homework is very doable and enjoyable. She does a phenomenal job of fostering an inclusive and welcoming enviroment. I loved get to know my peers, practice my spanish, and feel like I was making a true impact through my service work. If you get the opportunity, definetely consider teaching English to Guatemala kids through EDELAC!! It was an amazing experience and it was sooo wholesome to see their eyes light up when concepts start to click in their minds. You will not regret taking this class and it will be a nice breath of fresh air in your schedule!",
        "best_comment_short": "I loved get to know my peers, practice my spanish, and feel like I was making a true impact through my service work.",
        "best_comment_first": "TAKE THIS CLASS!!",
        "course_id": "115919",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c29925954d513928865da60dde157c22cb65bf939382da8716ee010ff5e14e41ea10b81902ab378c328b49eed8bda3c3&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ECON 10B",
        "course_title_2025": "Principles of Economics (Macroeconomics)",
        "course_score_mean": 4.45,
        "rec_score_mean": 4.38,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.88525,
        "best_gem_comment": "",
        "workload_score_mean": 5.92,
        "best_gem_comment_short": "",
        "best_comment": "This class is so great off cycle because of Professor Maggi. He is a great lecturer and teacher and you can tell he really cares about the course and all the students. His office hours are extremely helpful and he will take time to help you and see you succeed. If you have never taken any kind of Econ course be prepared to put in a little more time. I recommend reading the textbook and wish I did earlier in the course. I found the tests pretty difficult especially because they are only multiple choice. I didn’t do great in this course however if I put in more time I think it wouldve been possible to do better.",
        "best_comment_short": "His office hours are extremely helpful and he will take time to help you and see you succeed.",
        "best_comment_first": "This class is so great off cycle because of Professor Maggi.",
        "course_id": "109894",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=683ac796d3e7d56ca9de7701ee0cbb1a0d0a5bfaa21d79bcd709fcbb70aee391611de6f5bb8f5a005a47f2c6234fcaf7&ReportType=2&regl=en-US"
    },
    {
        "course_code": "STAT 210",
        "course_title_2025": "Probability I",
        "course_score_mean": 4.45,
        "rec_score_mean": 4.39,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8286,
        "best_gem_comment": "",
        "workload_score_mean": 11.49,
        "best_gem_comment_short": "",
        "best_comment": "This is a pretty interesting course, but it is a difficult one. This was probably one of my favorite courses at Harvard, even though I didn't do too well on the final (sorry Joe). That said, if you're really interested in probability theory, I would definitely recommend taking this course. However, if you're a bit more worried about your grade and time spent on classes, then this might not be the course for you. For context, took this course as an undergrad (senior). Prerequisites: STAT 110 and comfort with proofs. If you have taken a proof–based math course (e.g. Math 22\/25\/55\/112) or a proof–based CS course (CS120\/121\/124 series or 128), you're probably prepared for the course. There is this question that's posed every year on whether you need real analysis background (Math 112) for this course, but personally I really don't think you need it. It may help as Joe suggests, but you can get through the course and do well without real analysis background. The course also tends to be more probability focused especially on the exams, so I don't think prior experience in real analysis is necessarily super beneficial. So, if you're worried about real analysis, I wouldn't be! You may just need to put a little bit more effort, but there's plenty of students who take this course without having taken real analysis. Joe also makes the real analysis portion of the class pretty self–contained. Homeworks: They're hard, especially the first one on measure theory. They really involve a lot of thinking, which I enjoyed, but it could be time consuming. Exams: Also hard, but there's a lot of practice exams and practice problems in the book, so your performance is typically really based on how much time you spend practicing. Overall, would recommend the course!",
        "best_comment_short": "The course also tends to be more probability focused especially on the exams, so I don't think prior experience in real analysis is necessarily super beneficial.",
        "best_comment_first": "This is a pretty interesting course, but it is a difficult one.",
        "course_id": "111696",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=458551aae2bdd718fcfff8290acb0d27e331cd1cf0c857b583a9e1fc3f0e931b3ce740de45699e68222c37578c16d168&ReportType=2&regl=en-US"
    },
    {
        "course_code": "HIST 15E",
        "course_title_2025": "Writing Histories of Climate Change",
        "course_score_mean": 4.44,
        "rec_score_mean": 4.5,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9382,
        "best_gem_comment": "",
        "workload_score_mean": 4.73,
        "best_gem_comment_short": "",
        "best_comment": "Please take this class if you can! I took it as an elective and had no prior background, but thought it was fantastic. It does a great job of exploring the effects of climate change in terms of the impact of individuals and local histories at different levels of scale. The professors and teaching staff are the sweetest people ever! They really care about the students (they brought us cookies every week! and when it was warm we'd go outside and sit on the grass!) and they are all incredibly knowledgeable . There are also some amazing guest lecturers! The class really encourages exploration and the weekly assignments are super open–ended. You can do really creative things instead of formal academic writing, and the staff are so supportive of that. Even for topics that you might not be as interested in, you can definitely tie the assignment into something you care about. The class is half lecture, half small–group discussion, and everyone's really friendly and engaged. The readings are genuinely so interesting.  I strongly recommend!",
        "best_comment_short": "The class really encourages exploration and the weekly assignments are super open–ended.",
        "best_comment_first": "Please take this class if you can!",
        "course_id": "220075",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9e9b89cbcfa09f004ecfc11000f7e058db1f3b0c445e350e4101ee26d7f9c841516f1ad7556f145e2b6f934a4204784b&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SOC-STD 98WD",
        "course_title_2025": "The Politics of Health and Medicine in the United States",
        "course_score_mean": 4.44,
        "rec_score_mean": 4.44,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9738,
        "best_gem_comment": "",
        "workload_score_mean": 6.56,
        "best_gem_comment_short": "",
        "best_comment": "Take this course! SS98WD w\/ Matt is a delightful course that we'll provide you with a diverse base of knowledge about American healthcare dynamic. It will also support you and provide you the space to do substantive original research on a topic of your choice. We even visited Countway in Longwood and looked at archival documents! This course had a great mix of Social Studies and non–Social Studies, which made it all the more interesting. I think its a great choice for either. The course helped me produce a paper that I'm quite proud of and we'll help with my thesis down the road! Thanks, Matt!",
        "best_comment_short": "This course had a great mix of Social Studies and non–Social Studies, which made it all the more interesting.",
        "best_comment_first": "Take this course!",
        "course_id": "222714",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6f0a635a8c037cb3c2bdb39efaaf16ab8981624f9ff424e07b48ef718a0cd99ab431127c20b99a007e7c000003ad0300&ReportType=2&regl=en-US"
    },
    {
        "course_code": "E-PSCI 102",
        "course_title_2025": "Data Analysis and Statistical Inference in the Earth and Environmental Sciences",
        "course_score_mean": 4.43,
        "rec_score_mean": 4.43,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.6778,
        "best_gem_comment": "",
        "workload_score_mean": 9.0,
        "best_gem_comment_short": "",
        "best_comment": "The class is great and well–structured. If you're looking to complete your statistics requirement, I would highly recommend!",
        "best_comment_short": "The class is great and well–structured.",
        "best_comment_first": "The class is great and well–structured.",
        "course_id": "216019",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7e99ff5989ded9e8c12ffd1c55328426882a02cf233a27f4b9708fc8cece7d2ba611fa3a142392336cce06f317ed75e4&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ENG-SCI 173",
        "course_title_2025": "Introduction to Electronic and Photonic Devices",
        "course_score_mean": 4.41,
        "rec_score_mean": 4.36,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.93925,
        "best_gem_comment": "",
        "workload_score_mean": 4.46,
        "best_gem_comment_short": "",
        "best_comment": "TAKE IT!! Evelyn is truly a highlight of this course. She is incredibly talented at teaching and has boundless knowledge about semiconductor devices and more. I highly recommend if you'd like a classroom environment that is encouraging, relaxing, and allows you to learn about cool EE physics!",
        "best_comment_short": "I highly recommend if you'd like a classroom environment that is encouraging, relaxing, and allows you to learn about cool EE physics!",
        "best_comment_first": "TAKE IT!!",
        "course_id": "119048",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3045a405f263144fb7b2d3f2387ae2b0a36ce83c1c22d2083749c39b65a5693987a5977d45b619a2591375b532a8c782&ReportType=2&regl=en-US"
    },
    {
        "course_code": "RUSS 101",
        "course_title_2025": "Third-Year Russian I",
        "course_score_mean": 4.4,
        "rec_score_mean": 4.4,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.59835,
        "best_gem_comment": "",
        "workload_score_mean": 9.2,
        "best_gem_comment_short": "",
        "best_comment": "Take this class! Meeting 5 days a week is a lot but also very worth it. The teaching is excellent and it never feels like too much work at once, very balanced and spread out. Had so much fun!",
        "best_comment_short": "Had so much fun!",
        "best_comment_first": "Take this class!",
        "course_id": "120717",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3a865b5282e759c045c6ed33c988c215bf1a81ec4158de86c2535ba5cec89eae66cacbec9761bb77e3e83c186c7a13e2&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ECON 2810A",
        "course_title_2025": "Labor Market Analysis",
        "course_score_mean": 4.4,
        "rec_score_mean": 4.53,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8907,
        "best_gem_comment": "",
        "workload_score_mean": 6.31,
        "best_gem_comment_short": "",
        "best_comment": "A great course that is very worthwhile to take. It will change how you think about where you and society in general have come from (childhood education, reasons and effects of immigration), your life and that of society at present (current and future education, returns to education, social programs, labor institutions, immigration, and technology), and the future (the education choices of your children, the rise of automation and technology).While the reading list can be a bit long, it is definitely a good idea to at least read the abstracts and slides before class. Doing so will allow you to gain more from the class and ask the instructor questions. He is very knowledgeable (obviously) and very willing to engage with students. Overall, it is a class worth taking, even if labor economics is not your area of expertise.",
        "best_comment_short": "A great course that is very worthwhile to take.",
        "best_comment_first": "A great course that is very worthwhile to take.",
        "course_id": "114301",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a4d4690663c473ddaed0128b779b4bab99fe1089635098655236340fafd01bcea0e12290aec5d77e313cdc9ef77de8c2&ReportType=2&regl=en-US"
    },
    {
        "course_code": "GENED 1105",
        "course_title_2025": "Can We Know Our Past?",
        "course_score_mean": 4.37,
        "rec_score_mean": 4.25,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8807,
        "best_gem_comment": "",
        "workload_score_mean": 4.92,
        "best_gem_comment_short": "",
        "best_comment": "This class is incredibly interesting, even for someone with no prior background or interest in the topic. I decided to take it after a friend convinced me, and I’m so glad I did! The topics are highly relevant to issues today. Explore the syllabus and see if the topics interest you. If you’re even mildly curious, I think you will really enjoy it. The workload includes one section assignment per week, which usually took me 1.5 to 2 hours to complete. A key tip: start your capstone early! It requires a significant amount of time since you’ll need to write a 2,500–word essay, learn how to use the ArcGIS platform, and format and add visual elements. Both the section assignments and the capstone are engaging and rewarding. The TFs are friendly and helpful, and Jason is an amazing professor—so approachable and kind. If you have the chance, invite him to Classroom to Table! Overall, take this course if you can—you won’t regret it!",
        "best_comment_short": "The TFs are friendly and helpful, and Jason is an amazing professor—so approachable and kind.",
        "best_comment_first": "This class is incredibly interesting, even for someone with no prior background or interest in the topic.",
        "course_id": "112378",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=bbd6ab2daf7ec17aa20aeed1693cf1c6d9416af9472e9a66f4b5b7c1dc413db7c449f03db1128d2b70cb6424935d6cae&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ECON 2120",
        "course_title_2025": "Principles of Econometrics",
        "course_score_mean": 4.35,
        "rec_score_mean": 4.26,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.91135,
        "best_gem_comment": "",
        "workload_score_mean": 11.96,
        "best_gem_comment_short": "",
        "best_comment": "This will be one of the toughest and most rewarding classes that you could take.  If you're reading this, you're either an econ PhD student, an econ–adjacent PhD student, or incredibly precocious undergrad\/masters student who plans on doing an econ PhD.  If you aren't one of those, this probably isn't worth your time, but if you are one of those and you think you can swing the workload (and have strong background in probability, econometrics, statistical inference, linear algebra, calculus, and proofs), then please take this course and let yourself be amazed.  It's tough, but Elie is unmatched in his dedication to building this stuff up from basics to a cohesive theory of generalized least squares, method of moments, and all of their cousins.  Built from Elie's meticulous work as well as Gary Chamberlain's mythical notes.  Great stuff, you should take it just so that you have seen this material once in your life.",
        "best_comment_short": "If you aren't one of those, this probably isn't worth your time, but if you are one of those and you think you can swing the workload (and have strong background in probability, econometrics, statistical inference, linear algebra, calculus, and proofs), then please take this course and let yourself be amazed.",
        "best_comment_first": "This will be one of the toughest and most rewarding classes that you could take.",
        "course_id": "115026",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=77147132fc4a3bccb538217a1f25e989d021a4dfe26a2bc5460ee4a0cc1ba3bbd25aa8488a20c8bba6267d33465f5180&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SOC-STD 50",
        "course_title_2025": "Foundations of Social Science Research",
        "course_score_mean": 4.33,
        "rec_score_mean": 4.3,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9231,
        "best_gem_comment": "",
        "workload_score_mean": 4.7,
        "best_gem_comment_short": "",
        "best_comment": "SS50 is a great opportunity to get exposure to a broad–array of social science research as well as experiment with potential thesis topics or areas of interest. Matt is awesome! He's an excellent teacher, good at breaking down methods and brings a tremendous passion. He also becomes deeply invested in and enthusiastic about student work, which was a huge motivating factor for me! Take it!",
        "best_comment_short": "SS50 is a great opportunity to get exposure to a broad–array of social science research as well as experiment with potential thesis topics or areas of interest.",
        "best_comment_first": "SS50 is a great opportunity to get exposure to a broad–array of social science research as well as experiment with potential thesis topics or areas of interest.",
        "course_id": "213384",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=57e9839709b2285688255696abedd4d24657600af8f0fa1e6c63e50d771d18f5344c3844a4d3384ec9cd1b3db83d5be1&ReportType=2&regl=en-US"
    },
    {
        "course_code": "GENED 1104",
        "course_title_2025": "Science and Cooking: From Haute Cuisine to Soft Matter Science",
        "course_score_mean": 4.31,
        "rec_score_mean": 4.31,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8718,
        "best_gem_comment": "",
        "workload_score_mean": 4.46,
        "best_gem_comment_short": "",
        "best_comment": "This is an interesting class, some really great aspects, some aspects not quite as good, but on the whole I would recommend.The class is split half and half into guest lectures and \"science\" lectures. The guest lectures are wonderful, and unto themselves make this class fully worthwhile to take. Really cool, interesting, passionate chefs with a lot to share. Including a tasty treat here and there. Just based on these guest lectures, this class is incredible.Now, the other half of the class is \"science\" lectures, and this is the aspect that I feel is most lacking. It basically feels like a high school science class. Very formulaic, not very well connected with the guest lectures. Abstractly the \"science\" they teach you is motivated by the lectures, but it is not science that will in any significant way help you cook better. Perhaps this is a necessary sacrifice to be able to offer this as a gened, but I personally got very little out of the \"science\" lectures. Admittedly I do have a science background, but I think even so, this statement stands.The labs were ok –– often quite tasty, but also often fairly disconnected from the actual class. The guest lecturers would share so much interesting information, offer a demonstration or two, and then it would be disappointing to almost entirely ignore what they shared when we went to lab. The assignments were generally fine, though often there would be some mediocrely written questions that would somehow find their way through. ie questions that were not actually solvable given the material taught in the class, or that were ambiguously formulated in a way that didn't really suggest a way to solve. However, while this was a nuisance at times, it was nothing too unbearable. I think the qualm I shared generally do make the course less stressful than it would otherwise be, which may be an advantage in that regards, and so if you solely take this course for the guest lectures you will be well served! But I don't think I would recommend taking this class solely for its \"science\" lectures. Nonetheless, on the whole, very fun class, very cool experience.",
        "best_comment_short": "Abstractly the \"science\" they teach you is motivated by the lectures, but it is not science that will in any significant way help you cook better.",
        "best_comment_first": "This is an interesting class, some really great aspects, some aspects not quite as good, but on the whole I would recommend.The class is split half and half into guest lectures and \"science\" lectures.",
        "course_id": "126638",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b433dffa6bbbd9742d67a0a3b1f472e7413d08dd184461d068d2562f3ccc5fd5af4c2516f5a2fb6e94e45f4b9029024f&ReportType=2&regl=en-US"
    },
    {
        "course_code": "PSY 1018",
        "course_title_2025": "The Science and Psychology of Music",
        "course_score_mean": 4.3,
        "rec_score_mean": 4.35,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.9188,
        "best_gem_comment": "",
        "workload_score_mean": 4.26,
        "best_gem_comment_short": "",
        "best_comment": "I really disliked this class for the following reasons:– Lack of rigor. I took psy 1 and psy 16 before this, and this class did not come close to the level of rigorous treatment of the field found in either of those. In other psych classes, each lecture will be devoted to a topic where you discuss theories and ideas drawing from many different studies that contribute to the topic, and you come away with a solid understanding of some things you didn't know before and where research needs to go next. In psy 1018, each day is devoted to one or two studies that don't have anything super deep to say. (For example, a whole day will be devoted to a study finding that major key + fast tempo are associated with people perceiving the music as happy.) In fewer words, I just didn't learn much in this class. It felt more like high school than college. To be fair, part of the problem is that the research in psychology of music in general is really lacking, so this might be more of a problem with the field than how the course is taught.– Lack of focus on psychology. A TON of time in this course is spent on things that just aren't psych. The main example is the final project, where you write a policy memo recommending some policy related to music. In practice, this means that most of the final project was spent researching things like: how to implement our policy, how much funding is necessary, how to make it politically realistic, etc., rather than the actual psychological questions that underlie it. I was really disappointed with the final project because I wanted a psych class and felt like I got an HKS class instead! This takes up a lot of class time as there were also some days throughout the class where we had a workshop to work on policy memo writing or poster design – very frustrating when you want a class about the brain and music. To a lesser extent, I have the same complaint about the time spent on things like research design and quality. An example is the day at the end of the course where we debated the merits of several studies on music therapy: useful for understanding *methodological* issues but not *psychological* issues in the field. (Very important to talk about in a psych class, but I thought it was over–emphasized). Overall, this class is really only partially about psychology, so be aware of this if you're planning to take the course.– Assignments. Truly none of them are particularly hard, but there are enough to keep you pretty busy. Here they are:–– Reflection reports. There are 5 of these. You do a short music–related activity and then write a 2 page paper connecting your experience to class literature. Kind of interesting, but you really won't learn anything profound from them.–– Critical evaluation of a media article. It's a 4 page paper where you summarize and criticize an article about music and the mind. Probably the best assignment in the class. Though again, this is about research methods far more than psychology.–– Quizzes. There are 2 of these. It's a multiple choice canvas quiz which is very unforgiving (e.g. 3 T\/F questions rolled into one, and you need to get all 3 right to get the point). Requires you to repeat extremely specific information from studies and lectures. He LOVES asking tons of questions about which brain regions have which functions. The bright side is that it is open note\/internet, so you mostly just have to ctrl + F to find the answers. There is absolutely no reason this should be a part of the course.–– Final project. Poster + poster session presentation + memo. (The end of the course really stacks up because you're also doing quiz 2 and reflection report 5 in the midst of all this). And you have to submit the memo to a real politician. Anyway I said what I think about this above so I'll shut up now.tl;dr I found this class really frustrating because I didn't learn much, I especially didn't learn much in the field of psychology, and yet there is plenty of busywork.I think it is very possible that the gripes I have with this class are me–specific. For context, I am a STEM concentrator + musician who is maybe doing a psych secondary but mostly took this class for fun. If you're interested in the class you should totally shop it. But my warning is this: if after a couple weeks in the class you're thinking that the class is still getting started and you're waiting for it to pick up some steam and get more interesting, it won't. Get outta there! If you're going to learn from + enjoy the class, that will happen early.In the spirit of fairness I do have some positive things to say!– The teaching team is actually very wonderful. Like even though I did not like the class, I do really like Mayron, Mehr, and Luciana as people. They are all very flexible and accommodating of whatever you have going on, so just talk to them about whatever you need and they'll figure it out. Mayron is actually a teddy bear, he is so friendly and welcoming and always has a smile on his face and brings a lot of joy and excitement about the subjective.– Music performances and activities in class were very fun!– Ultimately it is a very chill class, especially grade wise.",
        "best_comment_short": "Mayron is actually a teddy bear, he is so friendly and welcoming and always has a smile on his face and brings a lot of joy and excitement about the subjective.– Music performances and activities in class were very fun!– Ultimately it is a very chill class, especially grade wise.",
        "best_comment_first": "I really disliked this class for the following reasons:– Lack of rigor.",
        "course_id": "218517",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2e4a7739669bf01ac83a0abb738e88e7adfe93ddef62fff314351ee8e08199d8087fb35bd90f57e760d066b199bc25e8&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SCRB 10",
        "course_title_2025": "Human Developmental and Regenerative Biology",
        "course_score_mean": 4.29,
        "rec_score_mean": 4.41,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8968,
        "best_gem_comment": "",
        "workload_score_mean": 9.41,
        "best_gem_comment_short": "",
        "best_comment": "Everything you've heard about SCRB10 is true, both the good and the not so good. This class is ENTIRELY based around learning different experimental methods and knowing when to apply them. It is super important to gain a good understanding of all of these methods early on or you will get really lost. While this is a difficult course, it is super rewarding and the content covered in lecture is really interesting. There is a really good mix of lecture content and the experiments covered in class are really cool. There is also an interesting ethical component which encourages students to think critically about the ethics behind these experiments. If you take SCRB10, please, please, please master the experimental methods and do NOT focus on memorizing the specific pathways.",
        "best_comment_short": "It is super important to gain a good understanding of all of these methods early on or you will get really lost.",
        "best_comment_first": "Everything you've heard about SCRB10 is true, both the good and the not so good.",
        "course_id": "125800",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7e4ff11d791b0cbbccd08d591ae9a7ae3b5278fa1cbd81cf2e5c767b167ba25efd825607ce52c1adcccab6d9a1284a90&ReportType=2&regl=en-US"
    },
    {
        "course_code": "CHEM 105",
        "course_title_2025": "Advanced Organic Chemistry",
        "course_score_mean": 4.27,
        "rec_score_mean": 4.27,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.7778,
        "best_gem_comment": "",
        "workload_score_mean": 7.67,
        "best_gem_comment_short": "",
        "best_comment": "This class is difficult but it’s so worth it! I learned an incredible amount and feel like I gained a deeper understanding of all the mechanics behind organic chemistry. Eric is a wonderful professor and clearly cares a lot about the subject matter. Sections are also great and help you practice reading papers, which I didn’t have that much experience in. Overall, highly recommend and do not shy away even though it’s a difficult class!",
        "best_comment_short": "Eric is a wonderful professor and clearly cares a lot about the subject matter.",
        "best_comment_first": "This class is difficult but it’s so worth it!",
        "course_id": "109454",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ac7e9b5d80a0830204d57b5fb21c63008a942e48cd8b33e660225466ca71ee1297a53d10e1b494d3a81d6e0e9c8a6dba&ReportType=2&regl=en-US"
    },
    {
        "course_code": "HISTSCI 1445",
        "course_title_2025": "Medicine and Health in America",
        "course_score_mean": 4.23,
        "rec_score_mean": 4.23,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.8875,
        "best_gem_comment": "",
        "workload_score_mean": 5.93,
        "best_gem_comment_short": "",
        "best_comment": "Great class for pre meds. Definitely take if you are interested. Great engaging lectures and sections. Manageable readings, be prepared to engage with them. You should have strong history skills like working with primary and secondary sources and writing essays. Be prepared to take your midterm (written essay) without having gotten your first paper back – not sure how that works.",
        "best_comment_short": "Great engaging lectures and sections.",
        "best_comment_first": "Great class for pre meds.",
        "course_id": "213244",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3f80195393549b07862555668f5c08a13311e8d98aefaa4eabfa79da23d89fe5264246b1ad390486577bf668a5f3d67c&ReportType=2&regl=en-US"
    },
    {
        "course_code": "BE 131",
        "course_title_2025": "Neuroengineering",
        "course_score_mean": 4.17,
        "rec_score_mean": 4.14,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.88365,
        "best_gem_comment": "",
        "workload_score_mean": 4.71,
        "best_gem_comment_short": "",
        "best_comment": "This is a chill and very cool class––the professor genuinely cares about the subject and his students, the material is really interesting and the professor takes the time to answer questions that don't pertain exactly to class material.  Lectures are pretty typical, but the lab component is one of the best I have taken so far––you get to work on a fascinating project that has exciting results at the end, with very supportive, patient, and helpful lab staff.",
        "best_comment_short": "Lectures are pretty typical, but the lab component is one of the best I have taken so far––you get to work on a fascinating project that has exciting results at the end, with very supportive, patient, and helpful lab staff.",
        "best_comment_first": "This is a chill and very cool class––the professor genuinely cares about the subject and his students, the material is really interesting and the professor takes the time to answer questions that don't pertain exactly to class material.",
        "course_id": "216486",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8a3191ac84b14d1600dc00f1ba78340f12cbbdb08b9c2738defbbcf21018356344deb517a72722a54ed447644722fbb5&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ENG-SCI 225",
        "course_title_2025": "Neuroengineering",
        "course_score_mean": 4.17,
        "rec_score_mean": 4.14,
        "gem_probability_mean": 0.0,
        "sentiment_score_median": 0.88365,
        "best_gem_comment": "",
        "workload_score_mean": 4.71,
        "best_gem_comment_short": "",
        "best_comment": "This is a chill and very cool class––the professor genuinely cares about the subject and his students, the material is really interesting and the professor takes the time to answer questions that don't pertain exactly to class material.  Lectures are pretty typical, but the lab component is one of the best I have taken so far––you get to work on a fascinating project that has exciting results at the end, with very supportive, patient, and helpful lab staff.",
        "best_comment_short": "Lectures are pretty typical, but the lab component is one of the best I have taken so far––you get to work on a fascinating project that has exciting results at the end, with very supportive, patient, and helpful lab staff.",
        "best_comment_first": "This is a chill and very cool class––the professor genuinely cares about the subject and his students, the material is really interesting and the professor takes the time to answer questions that don't pertain exactly to class material.",
        "course_id": "216799",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8a3191ac84b14d1600dc00f1ba78340f12cbbdb08b9c2738defbbcf21018356344deb517a72722a54ed447644722fbb5&ReportType=2&regl=en-US"
    }
]