[{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 223","course_score_mean":4.73,"rec_score_mean":4.6,"gem_score_mean":0.1428571429,"sentiment_score_median":0.6976,"best_gem_comment":"GEM GEM GEM (provided you're interested in sociology or Marx).Rachel is the nicest, best instructor on this planet, and will reduce your readings to the absolute minimum necessary for discussion while also giving you the option to read more if you're interested. Readings are mostly taken from labor sociology books and papers (Cech, Kunda, Braverman), which are fairly standard in difficulty, although the Marx section is a bit denser (but Rachel makes it easier and provides alternative sources in case you find it a bit too hard). You will be doing a non–trivial amount of close reading, so this is not the Expos section for you if you want to just cruise by while not doing the readings, but if you allow it to, it will definitely be a paradigm shift for you in all walks of life that contain work, from your future career to your view of headlines in the present and the near future.There are three essays of increasing length, and Rachel does make grading stricter as the semester progresses, but the amount of feedback you receive makes it completely fine, and holds your hand to an appropriate amount to prep you for college writing. Keep an open mind about your writing, it's not as good or watertight as you remember it ;)Discussions were honestly the best part of this course: this course attracts such a wide variety of people from all walks of life and all political opinions that seminars are both very broad and surprisingly deep, and can get you to extend your idea of work beyond what you know from your own experience. Definitely a contrast with other Expos section, where the same opinion is parroted ad infinitum and the 75–minute sections feel like they take up your whole morning.Rachel is also super flexible and available outside of class time, and is more than willing to talk about things other than the course that you are interested in, whether that is out of sheer curiosity, to advance your paper, to figure out what you want to do in life, etc.I'd be lying if there isn't a voice in my head that is telling me to switch my concentration to sociology.TL;DR: If you're at all tangentially interested in political philosophy or sociology, TAKE THIS EXPOS. Non–trivial amounts of reading (maybe like 50 pages total per reading assignment, spread across 2 or 3 sources), but everything else makes it so, so worth it, and Rachel's incredible. Honestly the best class I took at Harvard this semester.","workload_score_mean":6.09,"best_gem_comment_short":"GEM GEM GEM (provided you're interested in sociology or Marx).Rachel is the nicest, best instructor on this planet, and will reduce your readings to the absolute minimum necessary for discussion while also giving you the option to read more if you're interested.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2ea61beb5394e09f30e6bd9f45a8117ada4fb0f4bfb8ed86ea6addacd2566d04d3acd3746ca989e0ea784af3461dc241&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 236","course_score_mean":4.83,"rec_score_mean":4.73,"gem_score_mean":0.125,"sentiment_score_median":0.93755,"best_gem_comment":"Great class definitely rank it as highest for your expos selection! Raymer is literally the nicest and more caring professor at Harvard this class is a gem!","workload_score_mean":4.92,"best_gem_comment_short":"Raymer is literally the nicest and more caring professor at Harvard this class is a gem!","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2a8e8d9761485e239f92e6d3a5fd052285378873c671f2a8bfaca4d6f02cb19720c342d42669e3ca498a0472479c2e3e&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 221","course_score_mean":4.46,"rec_score_mean":4.83,"gem_score_mean":0.1111111111,"sentiment_score_median":0.9141,"best_gem_comment":"Stay ahead on assignments. This is the BEST expos course, GEM. Professor Mckeon is great and keeps the class engaged.","workload_score_mean":5.38,"best_gem_comment_short":"This is the BEST expos course, GEM.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f27104e8548e92c53db86c3cf2a94a9098908e4b3e8408a36c65539f995970d6378d115a4f991f7b89d3be3ec0ea251a&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 241","course_score_mean":4.7,"rec_score_mean":4.5,"gem_score_mean":0.1111111111,"sentiment_score_median":0.9556,"best_gem_comment":"TAKE THIS EXPOS AND PUT IT AS YOUR NUMBER ONE!!! This is a GEM and I can rave about it on and on. 1) Dr. Saha is an amazing professor. She guides you through EVERY step of the writing process, and her constructive criticism is extremely helpful. I can confidently say that she has made me a better writer. Also, section discussions are interesting and she knows how to keep the conversation from lulling. 2) The material is so interesting!! I'm pre–med and mainly had a general interest\/curiosity in the topic because I didn't really know much about it at all, but I left the class with a newfound passion for the subject and I turned out to be genuinely interested in the material. 2) The workload is relatively light, especially when compared to other Expos classes. Throughout the entire course, we have read mainly a handful of excerpts, with all of them being less than twenty pages each and also were very thought–provoking.  The most reading you'll do is probably when researching sources for your essays.","workload_score_mean":3.4,"best_gem_comment_short":"This is a GEM and I can rave about it on and on.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0b0f4ac544d35cdd71070e715cdfab2887e8e7490f06c8ce95bf3d5040ae1b7ad83281b63e25d294d4930e83e2d39ae3&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 240","course_score_mean":4.54,"rec_score_mean":4.75,"gem_score_mean":0.1,"sentiment_score_median":0.93545,"best_gem_comment":"Great professor! Kind, supportive, accomadating. The readings are incredibly insightful. Definitely a gem EXPOS.","workload_score_mean":3.77,"best_gem_comment_short":"Definitely a gem EXPOS.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=36d27f6eaa6e51ae1385cd72f8680f16c0b19d998af1f97f9c66f54713b46f8fdcf8a4eda47ac52547f93bbc41992e3f&ReportType=2&regl=en-US"}]