[{"course_code":"HIST 1223","useful_title":"The American Century? A History of the United States since World War II","course_score_mean":4.06,"rec_score_mean":4.06,"gem_score_mean":0.0666666667,"sentiment_score_median":0.8591,"best_gem_comment":"This class was definitely *not bad*, but I would think critically about if you really want to take it. If you have already taken AP US History or have a general understanding of US History, then this really will not further your knowledge more than a few Wikipedia articles. Professor Bekemeyer is undoubtedly an excellent lecturer––he almost reminds me of John Green when he's speaking, and definitely highlighted key laws and case studies in class. However, the readings, while very interesting (most were from books published for a general audience), felt disconnected and had too many pages assigned, so many people in section didn't do them, and honestly they did not really contribute much for the exams or writing assignments. Additionally, the grading is rougher than you'd expect for this class––each essay and exam is weighted heavily, and there are no small assignments to get feedback on or try to improve your grade, which makes these assignments incredibly important. On top of this, no rubrics were provided, and the only grading guideline was \"it will be graded holistically.\" While the class did lack in actual substance (unless maybe you knew very little about modern US history), it could have made up for in primary source analysis or historical reasoning, but it really didn't, especially because there were two essays. Besides the lack of clarity for grading, there was no *major* issue with this class; I think it lacked in overall substance and meaning, and is neither a chill history gem or an engaging, fascinating course.","workload_score_mean":4.78,"best_gem_comment_short":"Besides the lack of clarity for grading, there was no *major* issue with this class; I think it lacked in overall substance and meaning, and is neither a chill history gem or an engaging, fascinating course.","course_id":"218586","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8d552670c722ffac07477e76cd6d72b0a7e09dc6cd25bae3a07645774c3a3f16fd78b26d3e5d0ca126974c22ff3d76b0&ReportType=2&regl=en-US"},{"course_code":"HIST 1024","useful_title":"The British Empire","course_score_mean":4.46,"rec_score_mean":4.49,"gem_score_mean":0.0294117647,"sentiment_score_median":0.82515,"best_gem_comment":"Absolute no–brainer class. Super interesting and important material to understand world history. I wish it had spent a bit more time on things like WWII, but it's a great survey. Jasanoff is an engaging lecturer. The readings are interesting if you want to do them and to have engaging discussions in section. The essays do not relate to lectures that much, but you should go to lecture so you get the relevant background info.  Essays are not a cake–walk to do well in but if you are thoughtful and go to OH you will be fine. I think this is a perfect, interesting, not too challenging course. I wouldn't call it a gem just because you have to do some work to get an A, but it should not be too bad.","workload_score_mean":4.42,"best_gem_comment_short":"I wouldn't call it a gem just because you have to do some work to get an A, but it should not be too bad.","course_id":"125049","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3fb0817f55cb79e606c4caa02cc1c686c58dc4099dabff980a8ead227e782ac15bc59240646b85a05ed39bbf30377303&ReportType=2&regl=en-US"}]