[{"course_code":"ECON 980X","useful_title":"Economics of Work and Family  Junior Seminar","course_score_mean":4.25,"rec_score_mean":4.25,"gem_score_mean":0.1428571429,"sentiment_score_median":0.8774,"best_gem_comment":"A fantastic junior seminar. This class will make you appreciate economics as a discipline so much more. Also, Claudia is a gem of a professor; if you’re an Econ student, don’t miss the opportunity to take a class with her.","workload_score_mean":5.36,"best_gem_comment_short":"Also, Claudia is a gem of a professor; if you’re an Econ student, don’t miss the opportunity to take a class with her.","course_id":"108892","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=89df6791356e28a8c2da1f4c36c62103e92ec92a960d5db7078090262a517895dab855fbeedcaac83578eac29c28697d&ReportType=2&regl=en-US"},{"course_code":"ECON 1017","useful_title":"A Libertarian Perspective on Economic and Social Policy","course_score_mean":4.26,"rec_score_mean":4.45,"gem_score_mean":0.0460526316,"sentiment_score_median":0.65245,"best_gem_comment":"Definitely take this class! Probably the easiest Ec elective you are going to find and made getting a secondary in Ec super easy. Not as much of a gem as I was expecting but if you make sure you know the empirical evidence from the readings as well as section and lecture material going into the exams you will do great!","workload_score_mean":2.46,"best_gem_comment_short":"Not as much of a gem as I was expecting but if you make sure you know the empirical evidence from the readings as well as section and lecture material going into the exams you will do great!","course_id":"119951","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=591661fcd5e05041798fcc2bcc899550d8e9ff92e78c9786b510620a750c894ecc85ab09ffa6e3b5aa8a86370362b260&ReportType=2&regl=en-US"},{"course_code":"ECON 1420","useful_title":"American Economic Policy","course_score_mean":4.09,"rec_score_mean":4.11,"gem_score_mean":0.0227272727,"sentiment_score_median":0.42115,"best_gem_comment":"This is a great class!! Not difficult but very rewarding. You learn about lots of interesting economic and policy–oriented topics that are extremely relevant to today's world, and both professors are extremely experienced\/knowledgable. Lectures are interesting and debates between the two professors especially are a gem. Exams are not difficult at all if you follow along section material and do the practice exams beforehand. The policy memo is also a great learning experience. One thing I would say is not ideal is that TFs can be hard to reach and don't host office hours often.","workload_score_mean":4.33,"best_gem_comment_short":"Lectures are interesting and debates between the two professors especially are a gem.","course_id":"123003","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0be92c55f9ce5b7475ff798d672b78fab11808322b50bee835870595be1a3e894ab3877e98a1cfd952f11161dbb3ab36&ReportType=2&regl=en-US"},{"course_code":"ECON 70","useful_title":"Personal Finance Making Better Decisions and Building a Better Financial System","course_score_mean":3.79,"rec_score_mean":3.81,"gem_score_mean":0.0192307692,"sentiment_score_median":0.67775,"best_gem_comment":"this class is super good in providing knowledge that is very practical and applicable to real–life. it is not necessarily easy or a gem though, sometimes the p sets are frustratingly poorly worded\/ difficult\/ nit picky but overall if you try you can get a good grade and learn some really practical info.","workload_score_mean":4.91,"best_gem_comment_short":"it is not necessarily easy or a gem though, sometimes the p sets are frustratingly poorly worded\/ difficult\/ nit picky but overall if you try you can get a good grade and learn some really practical info.","course_id":"218117","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=55711fcf33ecff98c0c2bfc332052da7dda605ef612674f13fa1bd12f51a31e1721176751fd8cd7980a51f1b539d447e&ReportType=2&regl=en-US"}]