[{"course_code":"GENED 1166","useful_title":"Pluralism Case Studies in American Diversity","course_score_mean":4.28,"rec_score_mean":4.18,"gem_score_mean":0.2,"sentiment_score_median":0.89405,"best_gem_comment":"This is a really underrated class! The case studies are really topical and fun to read, and the focus on Asian religions is not something you typically see in many other courses. The discussion–based nature of the course also keeps class interesting. The weekly workload is very light—just readings and one short discussion post. Students take turns leading section, which makes each one unique and exciting. The midterm short paper and final case study are also very manageable and give you the option to write about whatever interests you. The Ethics + Civics distinction can sometimes be daunting, but this class is really accessible and inclusive to students from all backgrounds. Definitely take this gem of a class!","workload_score_mean":3.0,"best_gem_comment_short":"Definitely take this gem of a class!","course_id":"118775","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2c3871491c7ce1fa7c7e605aa052cdffb6b39a47f5642e309e46f82707fdbd7f179d8f4faadcc406718db1b36cbf8aed&ReportType=2&regl=en-US"},{"course_code":"GENED 1074","useful_title":"The Ancient Greek Hero","course_score_mean":3.96,"rec_score_mean":4.11,"gem_score_mean":0.1971830986,"sentiment_score_median":0.7878,"best_gem_comment":"Honestly, this class is what you make of it –– most people can coast by without doing the readings, so the class can be very little work if you want it to be, even though you probably won't end up getting much out of it in the end.  Lectures are basically useless and pretty much serve as a nice study hall so definitely go to section –– this is where you'll get most of the info you need for the course. Depending on your section TF (mine was great) the grading is pretty chill, and the creative exercises are fun!  In conclusion, take this class if you want an easy gem to round out your semester.","workload_score_mean":4.01,"best_gem_comment_short":"In conclusion, take this class if you want an easy gem to round out your semester.","course_id":"113501","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c9f82a5ec89ea1e192219ee7851ef4ff0c51746b515e92afc64a9ef68de5007094d05332b9526df9d7b182a906a5cd08&ReportType=2&regl=en-US"},{"course_code":"GENED 1050","useful_title":"Act Natural","course_score_mean":4.41,"rec_score_mean":4.66,"gem_score_mean":0.1111111111,"sentiment_score_median":0.9059,"best_gem_comment":"This course is an absolute GEM that I highly recommend. Zero acting experience necessary! This class is definitely more oriented towards observing people's habits and physicalities rather than play–acting, which made it more interesting. I felt like I was participating in a social experiment (i.e. similar to The Rehearsal). The lectures are a bit long but you play a lot fun acting games, which allows you to build community with your class and\/or section. There are no exams, papers, or midterm\/final, which definitely makes this course stress–free.","workload_score_mean":3.45,"best_gem_comment_short":"This course is an absolute GEM that I highly recommend.","course_id":"215893","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f03bc69e1875f35e6603010c2ef721e5726b5c4f6c88b95fcc0a4a2741b5182cd7a905c3f706260c5d4fc79796303c9d&ReportType=2&regl=en-US"},{"course_code":"GENED 1148","useful_title":"Moctezuma’s Mexico Then and Now Ancient Empire, Race Mixture, and Finding LatinX","course_score_mean":3.7,"rec_score_mean":3.79,"gem_score_mean":0.1052631579,"sentiment_score_median":0.743,"best_gem_comment":"Is the class a gem? In most regards, yes. There are copious amounts of reading but you do not have to do them, at least not in depth. There are only two assignments, a take home midterm and a final, which are supposed to be 6–7 pages but realistically are 20 pages (albeit a relatively easy 20 pages to write, defining terms and 2 short essays). Lectures are interesting — very unorganized, at times impossible to follow, but the professors are certainly passionate, many lectures feeling like sermons. Great, its a gem, but do you walk away with anything? Maybe. I was very lucky to have Leonardo as my section leader who organized the often times scrambled readings and lectures into coherent lessons. I learned interesting stories about Aztec times and am grateful for a deeper understanding of Mexico’s cultural past, from the colonial days to revolution to present day Mexico, I have gained an understanding of the forces that have shaped today’s Mexico. I’ve walked away with a few interesting anthropological concepts that I doubt I will use in the future but I am grateful to have understood. In short, lecture did very little, the readings ocassionally helped (granted I only skimmed), and section was interesting and informative. Writing the final and the midterm forced me to draw connections and while I at times felt like I was making things up, I think was a valuable exercise (although wayyy too long). Do not take this class if you want a great interesting class — it is not that. If you are looking for a gem, take it. The workload is light and you will walk away having learned a handful of things.","workload_score_mean":3.33,"best_gem_comment_short":"Is the class a gem?","course_id":"112754","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=eb1cb88997cc5bac1c743b400c1a5104acb4490498b60c74061f9a4480bfdead16bf10bf09168706ae751ff3e440dfbd&ReportType=2&regl=en-US"},{"course_code":"GENED 1053","useful_title":"The Global Heart Disease Epidemic Stopping What We Started","course_score_mean":4.21,"rec_score_mean":4.44,"gem_score_mean":0.0972222222,"sentiment_score_median":0.8854,"best_gem_comment":"This course is amazing! I highly recommend it. It is a gem of a GenEd! Rich is extremely knowledgeable and enthusiastic about the subject matter. Go to lecture! Super interesting material. Study the slides\/lecture material and you will be sure to do great on the midterm and final! No trick questions. You do a healthy living challenge that basically leads you to choose a healthy habit (drinking water, sleeping more, exercising, eating healthier, etc.) and track your progress over a few weeks. You will be surprised at your results! This is probably the class I have learned the most from here at Harvard in terms of how to take care of myself and actually implement healthy living changes in my daily life. I find myself telling my family a lot of the things I have learned and sharing some healthy habit tips with them. Super grateful for the opportunity to have taken this class (and to learn CPR!!!)","workload_score_mean":2.83,"best_gem_comment_short":"It is a gem of a GenEd!","course_id":"215875","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a70e6e3347280162fefe71d7d5ca98dac5e4b97b826dbe766d5327ec6cc6d5fa59c2cd4c3834266a314239c961f23f48&ReportType=2&regl=en-US"}]