[
    {
        "course_code": "EMR 1010",
        "course_title_2025": "Topics in Latinx Studies: Latinx Literature and Visual Culture",
        "course_score_mean": 4.8,
        "rec_score_mean": 4.75,
        "gem_probability_mean": 0.3333333333,
        "sentiment_score_median": 0.6588,
        "best_gem_comment": "Absolutely take this class – total gem! You will learn so much with literature, visual arts, and great conversations.",
        "workload_score_mean": 3.2,
        "best_gem_comment_short": "Absolutely take this class – total gem!",
        "course_id": "218600",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=28917618a503e1517eaa39ed934ce2ac993e6a0d5c9eb9cc34bcfcd4f162c288def594d690a0ba786faa45c2597c6122&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ARABIC 131A",
        "course_title_2025": "Upper-Level Modern Arabic l",
        "course_score_mean": 4.57,
        "rec_score_mean": 4.57,
        "gem_probability_mean": 0.25,
        "sentiment_score_median": 0.81445,
        "best_gem_comment": "Ustaadha Aya is a Harvard gem of a teacher! She’s an all star prof who I’m so happy we have with us now. She’s concerned about every aspect of her students’ education and is willing to do her best to make sure they are learning and enjoying what they learn and she is also the kindest! I have only wonderful things to say about her and her constant encouragement throughout the semester which has given me the space to improve my arabic. I’m excited to take arabic with her again next semester…. AT 9 AM so you know I’m not bluffing when I say she’s worth it!",
        "workload_score_mean": 9.83,
        "best_gem_comment_short": "Ustaadha Aya is a Harvard gem of a teacher!",
        "course_id": "121346",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1ca2e9523243e539909d036c3a4c0f13373c7fe58f48afeb5f143e3b6363def4aeae38c681cab1caa45ab09ac5577f04&ReportType=2&regl=en-US"
    },
    {
        "course_code": "ITAL 40",
        "course_title_2025": "Advanced Italian I: Italian Through Cinema: Oral Expression and Performance",
        "course_score_mean": 4.78,
        "rec_score_mean": 4.78,
        "gem_probability_mean": 0.2,
        "sentiment_score_median": 0.9163,
        "best_gem_comment": "This class is so fun––you get to watch movies in italian and chat about them in class and it's just the best. Chiara is a gem, but can be kind of a tough grader but you actually will improve your italian. Final project is so fun (the whole class makes a movie together and it's so silly goofy fun).",
        "workload_score_mean": 7.88,
        "best_gem_comment_short": "Chiara is a gem, but can be kind of a tough grader but you actually will improve your italian.",
        "course_id": "116233",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=aaa4967d7ebfdebd31d8fae238372aa005bbd2121357d95ee3976746198a4638f075861d3de60c49e4e7c07658cfab7b&ReportType=2&regl=en-US"
    },
    {
        "course_code": "HEB 123",
        "course_title_2025": "Dogs: Behavior, evolution, and domestication",
        "course_score_mean": 5.0,
        "rec_score_mean": 5.0,
        "gem_probability_mean": 0.1428571429,
        "sentiment_score_median": 0.9367,
        "best_gem_comment": "TAKE THIS CLASS, a true gem. Erin and Sophie are amazing. it is hard to get into, a lot of people fill out the form to get in, but go for it. There is one final project which is totally manageable, and one or two readings every week. You get to know your classmates so well because the class is so small and hand selected in a cool way. every class is basically a discussion of the readings (basically everyone does different ones and then you all talk about it).",
        "workload_score_mean": 4.11,
        "best_gem_comment_short": "TAKE THIS CLASS, a true gem.",
        "course_id": "220650",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ffc6730b8e151e993722e990466e9bd0e9da034d310c6f0cc1ecf18280b6f6b8a3562119fa8c8beb056a1e9b3b7c6040&ReportType=2&regl=en-US"
    },
    {
        "course_code": "FYSEMR 52Z",
        "course_title_2025": "Attention Deficit Hyperactivity Disorder (ADHD): Myths, Media and Meaning",
        "course_score_mean": 4.38,
        "rec_score_mean": 4.69,
        "gem_probability_mean": 0.125,
        "sentiment_score_median": 0.90905,
        "best_gem_comment": "TAKE THIS COURSE!!! If you have any interest in psychology at all, I highly recommend it. It's a gem for sure, the debates are engaging, and the field trip are really great. Dr. Arnett is so sweet and such a genuine person.",
        "workload_score_mean": 3.42,
        "best_gem_comment_short": "It's a gem for sure, the debates are engaging, and the field trip are really great.",
        "course_id": "224001",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1d96f7f5140e74767daf9347330dce1aac08872409eefdf2136fbed085ed4d6554a8ef63ded89b90d9dcb16da43b4726&ReportType=2&regl=en-US"
    },
    {
        "course_code": "PSY 1813",
        "course_title_2025": "Technology and Mental Health",
        "course_score_mean": 4.74,
        "rec_score_mean": 4.77,
        "gem_probability_mean": 0.1052631579,
        "sentiment_score_median": 0.9198,
        "best_gem_comment": "This is actually an amazing class! Definitely a gem. It's also super interesting to learn about the impacts of technology on human mental health and Professor Singh is really knowledgeable about the topic. You get a lot from the lecture and learn about different mental illnesses and their association with technology. The papers\/projects are very manageable and fun! Would highly recommend to anyone who's interested in learning about technology & mental health.",
        "workload_score_mean": 3.4,
        "best_gem_comment_short": "Definitely a gem.",
        "course_id": "220092",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b66a3b374ed5f0e71c1a08341318c206e9a7536a4e73d47b54129469f8fe647fd1f63907bdd744f7b81d6308ece42d05&ReportType=2&regl=en-US"
    },
    {
        "course_code": "GENED 1025",
        "course_title_2025": "Happiness",
        "course_score_mean": 4.28,
        "rec_score_mean": 4.39,
        "gem_probability_mean": 0.0843373494,
        "sentiment_score_median": 0.9287,
        "best_gem_comment": "Professor Rinard is the best! She is always connecting the sometimes overly intellectual philosophy topics to real world examples and anecdotes from her life to help our understanding. She was super engaging to listen to and I would highly recommend meeting with her to discuss the topics further; she is a wealth of knowledge. I originally took this class just to get the gened requirement out of the way but ended up truly loving the readings and material I learned. If you do the readings, the quizzes are very easy, and I would definitely call this class a gem. TAKE THIS CLASS even if only to hear Prof. Rinard's interesting and amusing lectures! You won't regret having a deeper understanding of finding fulfillment as a human.",
        "workload_score_mean": 4.7,
        "best_gem_comment_short": "If you do the readings, the quizzes are very easy, and I would definitely call this class a gem.",
        "course_id": "218240",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=224a0a2adbe6c9563366a865026ed01444538a4210b76db8639dfbcfb464baa0b208a571a80fa1259b4e099b946f746a&ReportType=2&regl=en-US"
    },
    {
        "course_code": "AFRAMER 197",
        "course_title_2025": "Poverty, Race, and Health",
        "course_score_mean": 4.72,
        "rec_score_mean": 4.83,
        "gem_probability_mean": 0.0833333333,
        "sentiment_score_median": 0.9547,
        "best_gem_comment": "I think you should definitely TAKE THIS CLASSS! Even if you're not interested in medicine or healthcare, you truly learn so much in this class, as our lessons are very much applicable to things going on today. I'd consider this course a gem, to be honest, but you also gain so much from it–– especially a new mindset and perspective on the role of race in our society and how it affects everything. I feel like this should be a mandatory course regardless of your concentration plans. So many people will never learn all that we learned in the course of the semester, and I feel as though they should. Professor Williams is an amazing lecturer and he's so engaging. He's also funny and extremely passionate about the work he does. I'm so glad I took this class. The workload was way more than manageable. Your only assignments are really the three book reports due throughout the course of the semester which are only four pages long and really chill. I'm extremely glad that I took this course freshman year. In classes like these, it is easy to feel hopeless and stuck as it seems like the heartbreaking issues we learn about can't simply be fixed by us. However, Professor Williams would usually end lectures with positive statements about what we CAN do and inspiring stories from successful reform initiatives.",
        "workload_score_mean": 4.67,
        "best_gem_comment_short": "I'd consider this course a gem, to be honest, but you also gain so much from it–– especially a new mindset and perspective on the role of race in our society and how it affects everything.",
        "course_id": "123435",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=273593036d5d19dc977de44cb2c97a6194678b7e8d9bb81c45520947550153fa40cfd907c76e03384c0f86f4084dfdc8&ReportType=2&regl=en-US"
    },
    {
        "course_code": "PHIL 9",
        "course_title_2025": "Empiricists, Scientists, and Charlatans: An Introduction to the Philosophy of Science",
        "course_score_mean": 4.63,
        "rec_score_mean": 4.42,
        "gem_probability_mean": 0.0833333333,
        "sentiment_score_median": 0.9486,
        "best_gem_comment": "amazing course and amazing content and amazing lecturer! only reservation with this course was the grading style –– assignments seemed low–stakes but realistically the grading this semester was a little unstandardized and stressful to navigate (though the TA was sweet and did her best, it was still a bit part of my grievances with the course). hopefully it's rectified in the future as the course actually teaches some very useful concepts and really opened my eyes towards philosophy of science. would encourage anyone going into science\/research or even with a vague interest in it to try, but be careful –– this is far from a gem.",
        "workload_score_mean": 4.11,
        "best_gem_comment_short": "would encourage anyone going into science\/research or even with a vague interest in it to try, but be careful –– this is far from a gem.",
        "course_id": "224386",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=44b55bababc0963552497a57b02277058156f0f0d42519e3ddf32f01814fc1832096cb2a02dab14b0580e2b6e5ad3104&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SLAVIC 132",
        "course_title_2025": "Russia’s Golden Age: Literature, Arts, and Culture",
        "course_score_mean": 4.59,
        "rec_score_mean": 4.76,
        "gem_probability_mean": 0.0769230769,
        "sentiment_score_median": 0.9335,
        "best_gem_comment": "If you are looking for an accessible way to dip your toe into Russian literature, then this is the course for you! Professor Buckler is extremely engaging, and the syllabus is well–curated. You will be guided through the Russian greats with attention to the history as well as the culture. There was good variety too –– we watched an opera, a ballet, and several movies to complement the literature. The midterm oral exam was slightly stressful, but if you were reading along and paying attention in class, you would be able to study without much difficulty. I have taken a LOT of literature courses (senior, humanities major) and this one was excellent. It wasn't a gem, per se, but that meant that people were actually there because they were interested, which was well worth it. Give small departments a try!",
        "workload_score_mean": 5.47,
        "best_gem_comment_short": "It wasn't a gem, per se, but that meant that people were actually there because they were interested, which was well worth it.",
        "course_id": "207566",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7b9d46f02b93135f3998b7b63ec3f780c1179f9e405cc8844c2bd120e57f0b8a61b08cf89e18c3ad20ec5ee240d8be27&ReportType=2&regl=en-US"
    },
    {
        "course_code": "SCRB 145",
        "course_title_2025": "From Cells to Tissues, in Sickness and in Health",
        "course_score_mean": 4.84,
        "rec_score_mean": 4.95,
        "gem_probability_mean": 0.0769230769,
        "sentiment_score_median": 0.9607,
        "best_gem_comment": "SCRB 145 has been my favorite SCRB course I've taken at Harvard. Ya–chieh is an absolute gem of a professor, and her engaging lectures and passion and enthusiasm for the material are so apparent in every class. The class balances lecture material with literature review\/journal club super well, and I've really enjoyed discussing different papers in the stem cell biology field and even participating in debates with my classmates. Sally and Kiwi are super responsive and are so helpful. I cannot say enough great things about SCRB 145 and would recommend to all who are interested in the topic!",
        "workload_score_mean": 3.63,
        "best_gem_comment_short": "Ya–chieh is an absolute gem of a professor, and her engaging lectures and passion and enthusiasm for the material are so apparent in every class.",
        "course_id": "161207",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7a608ca50f9160a5ba62e98df3c84953e9dad2d8216f423e3ab8e92f39d149f084a12c02e9a844bc08f5a8d0daf8adfc&ReportType=2&regl=en-US"
    },
    {
        "course_code": "OEB 104",
        "course_title_2025": "The Mouse in Science and Society",
        "course_score_mean": 5.0,
        "rec_score_mean": 5.0,
        "gem_probability_mean": 0.0666666667,
        "sentiment_score_median": 0.9167,
        "best_gem_comment": "take this class. great way to learn. great material, great professor. Don't cheat yourself by saying oh gem, easy A. Go in the class feel it out and help protect the good classes.",
        "workload_score_mean": 3.53,
        "best_gem_comment_short": "Don't cheat yourself by saying oh gem, easy A.",
        "course_id": "161184",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=075114b61b95e43f52f591f98ec180787b2c8c1743db640347a7b8f54e941d33e7384cadb5f16e8c373d82a736c5ac29&ReportType=2&regl=en-US"
    },
    {
        "course_code": "CHEM 160",
        "course_title_2025": "The Quantum World",
        "course_score_mean": 4.55,
        "rec_score_mean": 4.51,
        "gem_probability_mean": 0.0666666667,
        "sentiment_score_median": 0.8919,
        "best_gem_comment": "This is a gem but you should still try to keep up with the material just because of how interesting it is. In terms of preparation I was a little scared because I hadn't taken physics or linear algebra but all you really need is a good grasp on basic calculus (you dont' really need linear algebra) and some physics (but not really, I took it at the same time as I took PS2) and it should be fine. The psets are not too hard and you only need to finish them every two weeks. The presentation was also not too bad, you just have to prepare it according to the rubric and that was it. The teaching staff is veryyy nice in helping with assignments so def go to OH. Prepare for the final, or at least prepare for it to be very long. It took me like 15+ hours but I think that was abnormal for this year",
        "workload_score_mean": 5.78,
        "best_gem_comment_short": "This is a gem but you should still try to keep up with the material just because of how interesting it is.",
        "course_id": "112976",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3ce6be190ec7a6e1f7f625cf596ed9960fce44540c1c32e8306bbbad85676e08aabd68991fa1a4885dfa096e687fa337&ReportType=2&regl=en-US"
    },
    {
        "course_code": "COMPSCI 1050",
        "course_title_2025": "Privacy and Technology",
        "course_score_mean": 4.72,
        "rec_score_mean": 4.82,
        "gem_probability_mean": 0.04,
        "sentiment_score_median": 0.909,
        "best_gem_comment": "This is one of the least painful courses in the CS department. Waldo makes it fun. Way too many group projects, many on short notice (like group papers assigned on Thursday and due on Sunday). Reading assignments twice per week. Course content is very interesting. It's a good course but don't expect a gem, you have to put in the work.",
        "workload_score_mean": 6.13,
        "best_gem_comment_short": "It's a good course but don't expect a gem, you have to put in the work.",
        "course_id": "125407",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=263f7007260aaddd29c1a2f81fe2645a7650bec77d3f5e598f3bbdcfb48138daa87f1443a1bf5b2ef5773a8bc8f33848&ReportType=2&regl=en-US"
    },
    {
        "course_code": "APMTH 10",
        "course_title_2025": "Computing with Python for Scientists and Engineers",
        "course_score_mean": 4.41,
        "rec_score_mean": 4.46,
        "gem_probability_mean": 0.0357142857,
        "sentiment_score_median": 0.82185,
        "best_gem_comment": "This course is absolutely fantastic! The course staff really care about you and your learning and go above and beyond to make the course content and all aspects of the course as accessible and supportive as possible. They teach you to code well without any background or experience to the point where I started using course concepts and coding for other projects and assignments in my other courses. If you are in engineering, please please take this course for your CS requirement; it's a gem!",
        "workload_score_mean": 7.15,
        "best_gem_comment_short": "If you are in engineering, please please take this course for your CS requirement; it's a gem!",
        "course_id": "213407",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2005b1dacacba2cb55877808da6cb1b8de97503d5772963000c09987362cce8569c1868a372ba1147cbc83c9e8608739&ReportType=2&regl=en-US"
    },
    {
        "course_code": "GENED 1091",
        "course_title_2025": "Classical Chinese Ethical and Political Theory",
        "course_score_mean": 4.43,
        "rec_score_mean": 4.5,
        "gem_probability_mean": 0.0291262136,
        "sentiment_score_median": 0.8858,
        "best_gem_comment": "GEM!!! might start off boring but quickly becomes super fun and engaging. assignment aren't that bad and final project can be groupyou will genuinely learn a lot about life and governance via different chinese philosophers",
        "workload_score_mean": 4.75,
        "best_gem_comment_short": "GEM!!!",
        "course_id": "121778",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1a9192bfbc509b1903965f0b201a39ff982100921af717bc672466d2f79ff1672b3c2b6d18cb8740591c82782ccc6ce7&ReportType=2&regl=en-US"
    },
    {
        "course_code": "GENED 1089",
        "course_title_2025": "The Border: Race, Politics, and Health in Modern Mexico",
        "course_score_mean": 4.4,
        "rec_score_mean": 4.42,
        "gem_probability_mean": 0.0277777778,
        "sentiment_score_median": 0.9013,
        "best_gem_comment": "This class is a very good GENED. If you need a chill gem, this class has few, relatively easy assignments, and you'll still learn a lot from attending lectures. If you're passionate about U.S.–Mexico relations and want to spend time learning about it, the course offers many readings (including optional ones), a crew of supportive teaching staff, and engaging sections for you to fully internalize the concepts.",
        "workload_score_mean": 5.43,
        "best_gem_comment_short": "If you need a chill gem, this class has few, relatively easy assignments, and you'll still learn a lot from attending lectures.",
        "course_id": "204416",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=32f8d92f2b5041b49f148822b30b2bec622e8aa231a95ff9eed777de697d0a50bcf37bf25f6cc469ebc3b3057a1e6e95&ReportType=2&regl=en-US"
    },
    {
        "course_code": "HIST 1265",
        "course_title_2025": "Germany, 1848-1949",
        "course_score_mean": 4.7,
        "rec_score_mean": 4.68,
        "gem_probability_mean": 0.0238095238,
        "sentiment_score_median": 0.91935,
        "best_gem_comment": "***This class is a gem. If you're looking for a gem, then this is a good course for you! The material is interesting and presented in a very surface–level way. If you have a background in history or any social science\/humanities, this class will be way too easy for you. You will be bored, and frustrated at the little time it does take you, and you will feel like you're wasting your time. I wish this same class was taken with a prereq of at least 3 courses in history and lectures and sections were more conceptual and deeper.",
        "workload_score_mean": 4.43,
        "best_gem_comment_short": "***This class is a gem.",
        "course_id": "110285",
        "link": "https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f58ba5520d073ec0caf75e6b01b67e4b940e8d852890f136704827afbb361066ef53d149c94c48a3911b7527f3aeb28f&ReportType=2&regl=en-US"
    }
]