[{"course_code":"GENED 1197","course_title_2026":"Grimm's Fairy Tales: Echoes of the Past, Reflections of the Present","course_score_mean":4.44,"rec_score_mean":4.48,"gem_probability_mean":0.0952380952,"sentiment_score_median":0.9366,"best_gem_comment":"The class is a great way to close the aesthetics gened. Reading the fairy tales is super fun, and they are very useful when you can put them in a cultural, historical, and social context in class. Professor Pirozhenko's lectures can seem a little bit dry as she mainly just reads off the script, but she puts a lot of effort into engaging students with the material in the classroom and facilitates a lot of discussion. She also very clearly cares about the class and its content, making her a great professor for this class overall. Bastian is a gem of a TF; you will be so lucky if you get into his section. I unironically was running to his section every week as it was super engaging and fun. Every section hour flew by really quickly. Overall, the class is very interesting, especially if you have time to put into it. The assignments are super introspective, and you will get a lot out of them if you decide to put effort into them.","workload_score_mean":4.09,"best_gem_comment_short":"Bastian is a gem of a TF; you will be so lucky if you get into his section.","course_id":"224850","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7dcdb6bac420b02322036cb0318250aa3c400fe8cf3cdb1a020f59fa6c4e15cdbdfe2fc07f8c3fcacb1b3dd8a73b21d6&ReportType=2&regl=en-US"},{"course_code":"GENED 1038","course_title_2026":"Sleep","course_score_mean":4.1,"rec_score_mean":4.22,"gem_probability_mean":0.06,"sentiment_score_median":0.83245,"best_gem_comment":"Amazing class. Yes, less of a \"gem\". But it is simply a little more time consuming now – NOT more difficult. I think that is the key thing here: there are just a few more components to this class now, but they only check that you have an absolute basic baseline comprehension of what is going on. So long as you are making an effort below 0, it's perfect and you'll do amazingly. Most of the graded components are just following instructions and you'll get close to 100% on them! Super interesting course material and an easy yet SUPER enjoyable class that I am so grateful I took!!!! Katie McCullar is an AMAZING TF. IF YOU CAN CHOOSE HER, YOU WON'T REGRET IT. She is SO nice.","workload_score_mean":5.73,"best_gem_comment_short":"Yes, less of a \"gem\".","course_id":"212896","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=14506fca41b9b682395cd5390963eefcab51ff6feb32de01201c89c57e64dc8f132b4a1fa9284a3ca65558309f630174&ReportType=2&regl=en-US"},{"course_code":"GENED 1158","course_title_2026":"Water and the Environment","course_score_mean":3.9,"rec_score_mean":4.12,"gem_probability_mean":0.0294117647,"sentiment_score_median":0.8301,"best_gem_comment":"This course is definitely a gem. The professor as well as the TFs are all super nice, especially Chloe. You can get away with not reading but the readings are really important for the midterm. In terms of assignments, you have a short discussion post every week. Throughout the semester, you also have 3 event analyses (2 pages single–spaced each), an art analysis (2 pages single–spaced), and a final project.","workload_score_mean":4.31,"best_gem_comment_short":"This course is definitely a gem.","course_id":"213406","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e478ae27fee826238bc2fa42d1743f762bd3fc7e965d945bebacf822e07524625910dfcff7a027e7c4bcab648ae49757&ReportType=2&regl=en-US"},{"course_code":"GENED 1032","course_title_2026":"What is a Republic?","course_score_mean":3.33,"rec_score_mean":3.2,"gem_probability_mean":0.02,"sentiment_score_median":0.7132,"best_gem_comment":"This class was a gem but it seems like they are starting to crack down on it. The lectures are a bit dry (coming from a STEM person, so take it with a grain of salt) so I'd only recommend this course if you are super interested in history and government.","workload_score_mean":5.36,"best_gem_comment_short":"This class was a gem but it seems like they are starting to crack down on it.","course_id":"120049","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=96625f50c5dd652374f8fdcaeab145a9d5dc84eb197fcb2a5b06bb83d20dfe69f69d1c88fdffd170b3b2517460264a47&ReportType=2&regl=en-US"},{"course_code":"GENED 1046","course_title_2026":"Evolving Morality: From Primordial Soup to Superintelligent Machines","course_score_mean":4.28,"rec_score_mean":4.36,"gem_probability_mean":0.0192307692,"sentiment_score_median":0.90345,"best_gem_comment":"Really interesting actually and definitely a gem. Just go to lectures and listen – the conversations are pretty interesting and just from that and section you'll have a good enough understanding for the papers to get a good grade. Two midterm papers 1 final paper both really easy to write.","workload_score_mean":4.26,"best_gem_comment_short":"Really interesting actually and definitely a gem.","course_id":"203129","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8d3371aaf7afbdd30f40096783b96f55e446ec00b37438b898a4bcf51ec6569e0354cfbe93db633556f28575a571912e&ReportType=2&regl=en-US"}]