[{"course_code":"TURKISH AB","useful_title":"Elementary Modern Turkish II","course_score_mean":4.83,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":0.9635,"best_gem_comment":"","workload_score_mean":8.8,"best_gem_comment_short":"","best_comment":"THIS CLASS IS AWESOME! Please please take this class, you will absolutely LOVE it! The professor is THE BEST, she is always willing to help, offers advice, and makes sure no one is confused in class!!! She is very understanding and her teaching style is the best! The homework helps you a lot in your exams and prepares you well for the oral and final exams! Make sure to put in the effort and you will earn a great grade! I love Professor Meryem!! She is SO enthusiastic about Turkish and she is willing to help you every step of the way and ensures you are walking out of her class with everything clear and understood! I cannot recommend you enough to take this class! : )","best_comment_short":"Please please take this class, you will absolutely LOVE it!","best_comment_first":"THIS CLASS IS AWESOME!","course_id":"159868","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7ff3d8609874ca315b5669a19c946e5e8667bc9f768a3d5ca0a7fa8977c4098ddcb470786bf8da91e194b0428aad4afc&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 225","course_score_mean":4.43,"rec_score_mean":4.57,"gem_score_mean":0.0,"sentiment_score_median":0.96745,"best_gem_comment":"","workload_score_mean":4.08,"best_gem_comment_short":"","best_comment":"Professor Miller is the best! She is very kind and genuinely wants to help her students grow without creating a stressful environment. If you are anxious about the requirement, take her course. Professor Miller is passionate about the plight of domestic workers and that enthusiasm will transfer to you if you don't already have it. This course was very helpful in making me a better writer.","best_comment_short":"She is very kind and genuinely wants to help her students grow without creating a stressful environment.","best_comment_first":"Professor Miller is the best!","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ca30faeda292f38ab623270f18ea136b72e87bcd86715dc4167150758eac3f300d8195b63de5b2a85f86e1bc0311f891&ReportType=2&regl=en-US"},{"course_code":"FRSEMR 23K","useful_title":"Insights from Narratives of Illness","course_score_mean":4.8,"rec_score_mean":4.7,"gem_score_mean":0.0,"sentiment_score_median":0.9774,"best_gem_comment":"","workload_score_mean":4.4,"best_gem_comment_short":"","best_comment":"This course has been an absolute highlight of my semester! I've never found a course that better combines my interest in medicine and literature\/writing. The readings were incredibly interesting and allowed me to see into the decisions and perspectives of physicians and patients. My favorite part of the class was Dr. G, who integrates his personal anecdotes with the lessons from these readings; his thought–provoking questions and insights always reminded me, in his own words, that \"there is always more to learn.\" I came out of every class a better thinker as well as a better idea of what it means to be a good physician\/person, and I would highly recommend anyone interested in medicine, literature, or anything in between to take this class! It's truly amazing!!","best_comment_short":"I came out of every class a better thinker as well as a better idea of what it means to be a good physician\/person, and I would highly recommend anyone interested in medicine, literature, or anything in between to take this class!","best_comment_first":"This course has been an absolute highlight of my semester!","course_id":"117969","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2209b835d526a5675c2c4186c16f875a8ba2735e170c0070d4bc22f9ae38a12839272755cc12465321a843beb512638e&ReportType=2&regl=en-US"},{"course_code":"SPANSH 61PH","useful_title":"Spanish for Public Health","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.9395,"best_gem_comment":"","workload_score_mean":5.08,"best_gem_comment_short":"","best_comment":"This is an amazing class!!!! Profe is really caring, enthusiastic, and passionate about this course. The readings and materials are all very interesting. & worth the read! This class is also a very nice way to balance a tougher work load. Very low–stress class. I definitely recommend!","best_comment_short":"Profe is really caring, enthusiastic, and passionate about this course.","best_comment_first":"This is an amazing class!!!!","course_id":"205383","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4dbca6f605ca5ca2f404b7de40e17802654ea1ea1e4829859578739393e959b9bdab5ff8e44a2d2e35a8c658f0867744&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 232","course_score_mean":4.86,"rec_score_mean":4.93,"gem_score_mean":0.0,"sentiment_score_median":0.95565,"best_gem_comment":"","workload_score_mean":7.38,"best_gem_comment_short":"","best_comment":"Take this class if you're interested in synthetic biology, its applications, and\/or its ethics. The class is so interesting, and Emilie knows what she's talking about. In the beginning of units, readings can get dense and heavy but as long as you understand the main gists of the major readings, it's not too difficult and you can sometimes get away with not doing a few readings. Every assignment that isn't a paper or a presentation is ungraded, so that makes everything super low–stress (at least in my opinion) and assignments never take more than 30 minutes to an hour to do after class. Emilie is also super lenient with deadlines, for both assignments and papers, and she gives amazing feedback. Writing the papers themselves was honestly not bad, but that's only because I really enjoyed the class topic and what I was writing about. I honestly believe that as long as you pick an Expos class with a topic you like\/a topic that GREATLY interests you, it'll be easy for you to do well.","best_comment_short":"I honestly believe that as long as you pick an Expos class with a topic you like\/a topic that GREATLY interests you, it'll be easy for you to do well.","best_comment_first":"Take this class if you're interested in synthetic biology, its applications, and\/or its ethics.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ef2a245d8f1c0e1a87fcaf510cb6f5ca64cb64d5fbce199a3ab64601553df60f7ab24f4f05658c258d88a2e604808c07&ReportType=2&regl=en-US"},{"course_code":"ESPP 173","useful_title":"Water Resources in Developing Countries","course_score_mean":4.55,"rec_score_mean":4.36,"gem_score_mean":0.0,"sentiment_score_median":0.9683,"best_gem_comment":"","workload_score_mean":7.7,"best_gem_comment_short":"","best_comment":"Take this class!!!! It is a gem. One of my favorite classes I have taken at Harvard. It is a very interesting subject without being stressful. Professor Ken is incredibly kind, funny and supportive. You feel that the professor genuinely cares for you. The weekly homework assignments were very easy and the term project is super reasonable.","best_comment_short":"Professor Ken is incredibly kind, funny and supportive.","best_comment_first":"Take this class!!!!","course_id":"219916","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f62b48b56834a6b8e318ff114d30188ba09c59b8d23d545f2f486b95d776c8846675ec3786408c714287a3139ca037af&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 242","course_score_mean":4.8,"rec_score_mean":4.87,"gem_score_mean":0.0,"sentiment_score_median":0.9476,"best_gem_comment":"","workload_score_mean":5.07,"best_gem_comment_short":"","best_comment":"I never expected EXPOS to be my favorite class, but here we are. I absolutely loved Art of the Con this year. I came in interested in startups and entrepreneurship, and I was curious how the syllabus focused frequently on fraudulent founders. But I ended up taking away so much more than that. Ian has crafted an absolute masterclass with his course. From sharing fun facts about ourselves at the start of class to watching documentaries on cons, I felt like I learned so much about my classmates and the world in general. We covered such a broad scope of themes, from ethics and morality to Silicon Valley and entrepreneurship to philosophy and psychology. Ian went above and beyond constantly, even with a surprise you need to wait for until you take the class (no spoilers!) But this course CHANGED. MY. LIFE. So thank you so much Ian and I highly recommend taking this class — you'll meet some of the most interesting people on campus and learn a lot about yourself in the process.","best_comment_short":"From sharing fun facts about ourselves at the start of class to watching documentaries on cons, I felt like I learned so much about my classmates and the world in general.","best_comment_first":"I never expected EXPOS to be my favorite class, but here we are.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4061c02d0ed3e9ef3f9239f235580f70b71bb6593ef208fcbbce6c7512f53168c7a7f07840fe97d54c30f6428f7c4604&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 247","course_score_mean":4.5,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":0.949,"best_gem_comment":"","workload_score_mean":6.17,"best_gem_comment_short":"","best_comment":"This class is challenging but very rewarding. Hudson is an exceptionally kind, generous, and effective preceptor and is always willing to help. He does a create job of creating a sense of community by forming small research groups to provide feedback and having members of the community speak about what they're doing to end mass incarceration. If you are willing to put in time and effort, you will become a much stronger writer and learn to contribute original arguments to complex and important topics. I highly recommend this class, especially if you are even remotely interested in criminal justice, activism, and community–based work.","best_comment_short":"Hudson is an exceptionally kind, generous, and effective preceptor and is always willing to help.","best_comment_first":"This class is challenging but very rewarding.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9a30a72e108bd7310c161793510937591fe9697b15f92d509cd288d8d5e7afcc07a8c1bb71857d28d10570bb02f666eb&ReportType=2&regl=en-US"},{"course_code":"SPANSH 171","useful_title":"Barcelona and the Catalan Culture","course_score_mean":4.58,"rec_score_mean":4.58,"gem_score_mean":0.0,"sentiment_score_median":0.9371,"best_gem_comment":"","workload_score_mean":4.83,"best_gem_comment_short":"","best_comment":"This is hands down one of the best classes I've taken at H (and I'm a spring semester senior). I came in knowing nothing about Barcelona and the Catalan culture and came put really appreciate the city and its people. It gave me a bigger understanding of the culture and origin and also allowed me to understand the debate that exists in Spain better!  Now, I want to go visit the city and not just be a tourist, but really go and appreciate the history and beauty of Barcelona.  The professor is super kind, understanding, helpful, and caring and is very VERY knowledgeable about the topic and super helpful in the final project. The workload is a perfect amount and you can truly enjoy the class and not worry about your grade.","best_comment_short":"The professor is super kind, understanding, helpful, and caring and is very VERY knowledgeable about the topic and super helpful in the final project.","best_comment_first":"This is hands down one of the best classes I've taken at H (and I'm a spring semester senior).","course_id":"109775","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=fe54da4f7f4adc00b3aadf6a6d423ca59ed992308a26613dd743f6ea259f0535bc6ba7ca6d71a471d5179f7845f4ad75&ReportType=2&regl=en-US"},{"course_code":"PSY 1528","useful_title":"Blindspot: Hidden Biases of Good People","course_score_mean":4.9,"rec_score_mean":4.7,"gem_score_mean":0.0,"sentiment_score_median":0.9069,"best_gem_comment":"","workload_score_mean":5.6,"best_gem_comment_short":"","best_comment":"This class is definitely challenging, but super rewarding! You will learn a lot about implicit bias, and Dr. Banaji is an incredible professor. The readings are engaging and the workload is very manageable!","best_comment_short":"This class is definitely challenging, but super rewarding!","best_comment_first":"This class is definitely challenging, but super rewarding!","course_id":"219648","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=508c43d0af74762d46165df5fd5dddeac9e25753145b810ce773654b32907ee8e9b3c80874246c796161f112107c60b2&ReportType=2&regl=en-US"},{"course_code":"ITAL 11","useful_title":"Beginning Italian II - Parliamo Italiano! The Art & Craft of Italy","course_score_mean":4.82,"rec_score_mean":4.64,"gem_score_mean":0.0,"sentiment_score_median":0.9117,"best_gem_comment":"","workload_score_mean":6.27,"best_gem_comment_short":"","best_comment":"Italian 11 is quite fast, but if you pay attention in the course and do what the professor tells you, you'll be fine by the end. Professor Tragni is such a kind soul, and she truly wants you to succeed in the class. I had several instances in which my medical or personal issues stood in the way of completing my assignments\/taking my exams, but she was understanding and helped me out when I was struggling; that kind of support is rare and something I'll remember in my four years here. Italian is not an easy language, especially when you get to the more complex grammatical structures, but if you keep practicing, pay attention, and do your work, you will be successful. Highly recommend Italian 11—great course, great environment, and great professor!","best_comment_short":"Highly recommend Italian 11—great course, great environment, and great professor!","best_comment_first":"Italian 11 is quite fast, but if you pay attention in the course and do what the professor tells you, you'll be fine by the end.","course_id":"125061","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e49ca14a89356163bcdaa0e70f926b754c52ad904eddabab17889918ff1c4856337d9fe9c2726fe67ab3d34c235f66d5&ReportType=2&regl=en-US"},{"course_code":"GOV 1199","useful_title":"Negotiating Post-Soviet Conflict: The Geopolitics of Eastern Europe and the Caucasus","course_score_mean":4.6,"rec_score_mean":4.57,"gem_score_mean":0.0,"sentiment_score_median":0.9425,"best_gem_comment":"","workload_score_mean":6.93,"best_gem_comment_short":"","best_comment":"This is a fantastic and very practice–oriented course. What I really liked about the course was its focus on skill–building: The theoretical constructs from the readings (especially those on negotiation practices) can be directly applied to the negotiation exercises. The course helped me a lot to understand and work on my own weaknesses when negotiating. The guest lectures were interesting and some of the content actually really useful from a negotiation perspective (especially the talks by Alexander Hug and Danny Stoian).  The memos help to actively reflect on one's negotiation strategy and to integrate (and thereby better remember) the main take–aways from the readings. Through the negotiation sessions, you also get to know your classmates much better than in other courses. The readings are very helpful and def worth reading, but I often had the impression that it was fine skimming some of it since they are not the main predictor of doing a good job in the negotiation sessions. Arvid knows how to make the class interesting and entertaining, and Alex did a fantastic job when organizing the negotiation sessions. Both of them, and also the guest lecturers, are genuinely helpful with any questions you might have and keen to help you improve your skills. Overall, I feel like I learned a lot and met super interesting people.","best_comment_short":"Both of them, and also the guest lecturers, are genuinely helpful with any questions you might have and keen to help you improve your skills.","best_comment_first":"This is a fantastic and very practice–oriented course.","course_id":"212603","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c412bb3a11b3335e9216054a9f2b49dee61a81f4998271e5a776a439a0d8e704f611087b18d032f1223a9b788743f065&ReportType=2&regl=en-US"},{"course_code":"ECON 1425","useful_title":"Political Economics","course_score_mean":4.4,"rec_score_mean":4.53,"gem_score_mean":0.0,"sentiment_score_median":0.9269,"best_gem_comment":"","workload_score_mean":5.93,"best_gem_comment_short":"","best_comment":"SHLEIFER is AMAZING!!!! Cares SO much about his students and this class. I honestly learned a lot about political economy and am grateful to have taken this course. Super nice that it only meets once a week, and the readings are honestly not that bad\/long. A lot of the papers are seminal works in econ, so worth actually reading them. The books are interesting as well––I would recommend that with weeks with memos, you start early, as the response papers can sneak up on you. Final project is fun, would also recommend starting early if you can, so you're not scrambling to write the 20 pages, which the first draft is due mid–April.","best_comment_short":"Super nice that it only meets once a week, and the readings are honestly not that bad\/long.","best_comment_first":"SHLEIFER is AMAZING!!!!","course_id":"125716","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4ab99d2e6ce969c7c8bf93acc569e18240e11ed90b9aaa5b97b6e00de324edc8e9fd849280600abbe45848e217060761&ReportType=2&regl=en-US"},{"course_code":"ARABIC 241BR","useful_title":"Advanced Modern Arabic Bridge: Language, Literature, and Culture II","course_score_mean":4.71,"rec_score_mean":4.57,"gem_score_mean":0.0,"sentiment_score_median":0.8938,"best_gem_comment":"","workload_score_mean":7.29,"best_gem_comment_short":"","best_comment":"A great class! It's work but definitely worth it – your Arabic will improve a lot. Students choose the topics for the various units at the beginning of the semester so the course material is super interesting and can be made relevant to your interests.","best_comment_short":"It's work but definitely worth it – your Arabic will improve a lot.","best_comment_first":"A great class!","course_id":"118412","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=10a336bb80a995c0b26606950b5ea5828a044cd5494620bdfc8e27e6251dd617834a438de73db2cea41f5af2fc1fa01a&ReportType=2&regl=en-US"},{"course_code":"ANTHRO 2653","useful_title":"Feminism and Anthropology","course_score_mean":4.8,"rec_score_mean":4.6,"gem_score_mean":0.0,"sentiment_score_median":0.8934,"best_gem_comment":"","workload_score_mean":6.0,"best_gem_comment_short":"","best_comment":"I would suggest everyone with an interest in kinship, gender and sexuality to sign up for this course. Prof. Jabloner is a fantastic instructor and is great to work with to develop research ideas – she even held regular office hours throughout the semester.","best_comment_short":"Prof. Jabloner is a fantastic instructor and is great to work with to develop research ideas – she even held regular office hours throughout the semester.","best_comment_first":"I would suggest everyone with an interest in kinship, gender and sexuality to sign up for this course.","course_id":"213468","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1d4a4327156accd6990bfac072df933205d98f5efe7c044dd86956e3f0fab447b8648bab66d58150e4441971e0030383&ReportType=2&regl=en-US"},{"course_code":"GENED 1037","useful_title":"Experiments that Changed Our World","course_score_mean":4.82,"rec_score_mean":4.71,"gem_score_mean":0.0,"sentiment_score_median":0.9001,"best_gem_comment":"","workload_score_mean":3.88,"best_gem_comment_short":"","best_comment":"This was a very fun and relaxed course! The Max and Phil are great and generate a lot of enthusiasm for the subject matter. I would highly recommend!","best_comment_short":"This was a very fun and relaxed course!","best_comment_first":"This was a very fun and relaxed course!","course_id":"212854","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=56b3f34b2183a2800ae9f5686e64b9411e953abd47f08dc8cacc7176b4c6e8d4b156f0a959a3847d572a2ba9bc4ec224&ReportType=2&regl=en-US"},{"course_code":"NEURO 99","useful_title":"Honors Thesis Research","course_score_mean":4.67,"rec_score_mean":4.53,"gem_score_mean":0.0,"sentiment_score_median":0.9257,"best_gem_comment":"","workload_score_mean":19.42,"best_gem_comment_short":"","best_comment":"If you are taking this course, it is because you are in the final stages of a neuro thesis. Congratulations! The finish line is ahead. Writing a thesis is harder than it seems, but don't let that discourage you. This course is a great way to space out that work and get the help of the neuro advisors and neuro head tutor. Definitely take this course!","best_comment_short":"This course is a great way to space out that work and get the help of the neuro advisors and neuro head tutor.","best_comment_first":"If you are taking this course, it is because you are in the final stages of a neuro thesis.","course_id":"122847","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=13e3bfd40a55042285b2fbcf7cbee27b207d6eea00b2c57fca16a30bb03f0f81af10afc73c9aeafcc7ae3ab717f4783a&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 215","course_score_mean":4.83,"rec_score_mean":4.58,"gem_score_mean":0.0,"sentiment_score_median":0.93595,"best_gem_comment":"","workload_score_mean":4.58,"best_gem_comment_short":"","best_comment":"By FAR the best Expos class out there!!! Dr. Gold is such an incredible teacher and overall a lovely person. The content you learn is important and timely, and makes the writing assignments feel useful and not at all burdensome.  Dr. Gold truly cares about making you a better writer and provides SO much helpful feedback throughout the writing process. I couldn't recommend this course highly enough!","best_comment_short":"Dr. Gold truly cares about making you a better writer and provides SO much helpful feedback throughout the writing process.","best_comment_first":"By FAR the best Expos class out there!!!","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f16f28e66e7d0aa09b1977112fb18e339a8779a03701dd5bc8376997ddbcc1eac14f905b13c0530385baba74d00dc0a0&ReportType=2&regl=en-US"},{"course_code":"BCS BB","useful_title":"Intermediate Bosnian, Croatian, and Serbian II","course_score_mean":4.83,"rec_score_mean":4.83,"gem_score_mean":0.0,"sentiment_score_median":0.8965,"best_gem_comment":"","workload_score_mean":4.67,"best_gem_comment_short":"","best_comment":"Take BCS! Prof. Kuzmic is fantastic and this is a great opportunity to learn something new. Non–heritage speakers need not be afraid of throwing their hats in the ring. It's a very welcoming and encouraging environment.","best_comment_short":"Prof. Kuzmic is fantastic and this is a great opportunity to learn something new.","best_comment_first":"Take BCS!","course_id":"205525","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=03ded531743f4becc0446182c273264dc8c873a48bf535c442cbe8caf19d8c546ac852f2de8fd42d34286932deb66def&ReportType=2&regl=en-US"},{"course_code":"NEURO 105","useful_title":"Systems Neuroscience","course_score_mean":4.86,"rec_score_mean":4.86,"gem_score_mean":0.0,"sentiment_score_median":0.9448,"best_gem_comment":"","workload_score_mean":5.0,"best_gem_comment_short":"","best_comment":"overall, i loved this class. florian is great, lectures are informative but he also makes them fun with jokes etc. tfs are both excellent. grading is pretty lenient which allows you to take in the information without being overly stressed. the whole staff stresses that it is about the overall learning experience and that you should not be too stressed about grades. the one HUGE downfall is that the psets are basically impossible, at least for someone who has not coded (at least i though so). definitely find people to work with or u will be screwed. also do not wait till the last minute like i did","best_comment_short":"florian is great, lectures are informative but he also makes them fun with jokes etc.","best_comment_first":"overall, i loved this class.","course_id":"207528","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8ee30f99a125519d19539302a4781bce84d1818cb310c14daba4d5d0f31226bce0673b07214512aea22011fa8831455c&ReportType=2&regl=en-US"},{"course_code":"MCB 100","useful_title":"Experimental Research in Molecular and Cellular Biology","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.86995,"best_gem_comment":"","workload_score_mean":9.0,"best_gem_comment_short":"","best_comment":"Take this class! It’s a great way to learn what being in a wet lab is like, and it’s nice to get practice working in a research group. You will be in the lab a lot, and will need to coordinate with your group members, so this class helps you develop communication and teamwork skills","best_comment_short":"It’s a great way to learn what being in a wet lab is like, and it’s nice to get practice working in a research group.","best_comment_first":"Take this class!","course_id":"160364","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6eadfd40702e7392df46655e92dab2acb75571057e26f51fa2cbfc169a0ea96a44ee90ce11d0b6dc239c78c7ceda3855&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 248","course_score_mean":4.36,"rec_score_mean":4.4,"gem_score_mean":0.0,"sentiment_score_median":0.91835,"best_gem_comment":"","workload_score_mean":7.64,"best_gem_comment_short":"","best_comment":"This class is a lot of work. But if you put the time into it, you will get so much out of it. Your writing will improve immensely, and you may develop arguments you never thought you could come up with. The most important part of the writing process is the response papers. Make sure you give them the time they require, and ask questions early on. It will make your draft much more effective, your conference much more helpful, and your revision much easier. And go to the writing center! I went for all of my papers, and I always got pointed advice. If nothing else, the writing center will give you peace of mind before you submit your essay. I definitely enjoyed this class, and while Expos may seem intimidating, it's very rewarding.","best_comment_short":"It will make your draft much more effective, your conference much more helpful, and your revision much easier.","best_comment_first":"This class is a lot of work.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=85d644dc24e4a8ee608a7b66f0cab1aa514fb9a2a12eb263fe3dd66015b72d9bb0bd04676cc462d94347a9500b8030f5&ReportType=2&regl=en-US"},{"course_code":"SPANSH 11","useful_title":"Beginning Spanish II","course_score_mean":5.0,"rec_score_mean":4.63,"gem_score_mean":0.0,"sentiment_score_median":0.9349,"best_gem_comment":"","workload_score_mean":4.88,"best_gem_comment_short":"","best_comment":"Loved this class! I genuinely had so much fun and at times forgot that this was an academic course for credit. It felt so much more like just chatting with friends! The assignments are not insanely difficult and the classes and homework leave you well prepared!","best_comment_short":"It felt so much more like just chatting with friends!","best_comment_first":"Loved this class!","course_id":"125058","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0486b5e4ffc925cd1bfd8a8feaa7c5435c6a4883dad7aa484886d7ea5c5cf0c318a477be45efe321cd227964e32aca43&ReportType=2&regl=en-US"},{"course_code":"CHNSE 130XB","useful_title":"Pre-Advanced Modern Chinese for High-Proficiency Learners","course_score_mean":5.0,"rec_score_mean":4.91,"gem_score_mean":0.0,"sentiment_score_median":0.8733,"best_gem_comment":"","workload_score_mean":6.18,"best_gem_comment_short":"","best_comment":"Take this class!!! The teachers are great, content is pretty engaging, and everyone who picks this class is quite enthusiastic which makes for an even better experience :)","best_comment_short":"The teachers are great, content is pretty engaging, and everyone who picks this class is quite enthusiastic which makes for an even better experience :)","best_comment_first":"Take this class!!!","course_id":"124238","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b55d9cc864a24d1d078cb6d9843c2e260d1e31ebef203ddef9053c1e0b8405d1041d98c501778a0f5e75eaa2bf3d795b&ReportType=2&regl=en-US"},{"course_code":"CHNSE BB","useful_title":"Elementary Modern Chinese","course_score_mean":4.86,"rec_score_mean":4.71,"gem_score_mean":0.0,"sentiment_score_median":0.93505,"best_gem_comment":"","workload_score_mean":7.43,"best_gem_comment_short":"","best_comment":"I really recommend this class. I took it as an elective because of my interest in the language, and found it really helpful in establishing a foundation level of Chinese. The teachers are so kind and supportive, and ready to help too.","best_comment_short":"The teachers are so kind and supportive, and ready to help too.","best_comment_first":"I really recommend this class.","course_id":"124237","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d56918bb5376042166ed144a6735f30ae805cf1da5f4e2fc4bb4d033334e1e62c22f7f46c622064c3574ec53c22fa241&ReportType=2&regl=en-US"},{"course_code":"ENGLISH 90LV","useful_title":"Consciousness in Fiction from Austen to Woolf","course_score_mean":4.85,"rec_score_mean":4.85,"gem_score_mean":0.0,"sentiment_score_median":0.939,"best_gem_comment":"","workload_score_mean":5.35,"best_gem_comment_short":"","best_comment":"James Wood is such a great instructor. The readings were really well selected and the instructor is so knowledgeable and passionate about the subject that class was always really fun and enlightening. The instructor does a great job at connecting materials such as religious texts, music, and other writings to the main course materials, showing us important connections we wouldn't have otherwise seen. The class has taught me what makes a piece of fiction great, and I now have a better understanding of the place of realism and of authors like Flaubert, Chekov and Wolf in English and Western literature. The class introduced me to really important works in world literature. Class discussions were always very well moderated and I feel like I've learned from my peers' observations. The course assignments offered me a great opportunity to reflect more deeply about topics such as feminism and anti–Semitism in fiction.","best_comment_short":"The readings were really well selected and the instructor is so knowledgeable and passionate about the subject that class was always really fun and enlightening.","best_comment_first":"James Wood is such a great instructor.","course_id":"118850","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c1efaceaec2ddbcca55ec0945ee2d9e5335188bea46b244671d36b6ec65c25070a9aa6ae9dbdafc0db177232bc39a50b&ReportType=2&regl=en-US"},{"course_code":"ENGLISH 178X","useful_title":"The American Novel: Dreiser to the Present","course_score_mean":4.58,"rec_score_mean":4.73,"gem_score_mean":0.0,"sentiment_score_median":0.9133,"best_gem_comment":"","workload_score_mean":6.15,"best_gem_comment_short":"","best_comment":"Definitely recommend taking this course!! It's not an easy 4th class, because you go through essentially one book a week, and the books are incredible so you shouldn't just skim or definitely not worth just sparknoting. But Professor Fisher's lectures are super good, and the class is such a good way to think deeply about living in general, art and aesthetics, and consciousness\/memory. Super interesting!","best_comment_short":"But Professor Fisher's lectures are super good, and the class is such a good way to think deeply about living in general, art and aesthetics, and consciousness\/memory.","best_comment_first":"Definitely recommend taking this course!!","course_id":"111575","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=57c26eef376d882768770e0b8c6189205253da45887008c704f649e269fbc8d7c71632f44be853ae9815125265abf065&ReportType=2&regl=en-US"},{"course_code":"CHNSE 120B","useful_title":"Intermediate Modern Chinese","course_score_mean":4.63,"rec_score_mean":4.88,"gem_score_mean":0.0,"sentiment_score_median":0.8643,"best_gem_comment":"","workload_score_mean":6.5,"best_gem_comment_short":"","best_comment":"This class is set up very well and ran by a group of very passionate teachers. They push you to be your best and help in countless ways. I would 100% recommend this course.","best_comment_short":"They push you to be your best and help in countless ways.","best_comment_first":"This class is set up very well and ran by a group of very passionate teachers.","course_id":"110940","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=13ce57ee4c754391e97510f7d8af07d71b65c5c77ccc15478c34b595150effc95cdc883d2be6ed9d0a39769926d1da56&ReportType=2&regl=en-US"},{"course_code":"CHNSE 130XB","useful_title":"Pre-Advanced Modern Chinese for High-Proficiency Learners","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.9072,"best_gem_comment":"","workload_score_mean":9.67,"best_gem_comment_short":"","best_comment":"Chinese 130XB is a little tougher than the previous levels but definitely super interesting and very rewarding! The grammar structures are harder and are more focused on formal language, but the instructors still try their best to engage you with the course content. The lectures are centered around different social issues in China, so it's super interesting to be studying and talking about current events in the class too.","best_comment_short":"Chinese 130XB is a little tougher than the previous levels but definitely super interesting and very rewarding!","best_comment_first":"Chinese 130XB is a little tougher than the previous levels but definitely super interesting and very rewarding!","course_id":"124238","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c53a0e11e0cefcbb0990eff9ab4c51256eec509f00f0e6d15a11db5361f2b72cf9aea8586f885752dd1e8e93c40ff428&ReportType=2&regl=en-US"},{"course_code":"COMPLIT 108","useful_title":"Translating World Literature","course_score_mean":4.82,"rec_score_mean":4.91,"gem_score_mean":0.0,"sentiment_score_median":0.88265,"best_gem_comment":"","workload_score_mean":4.91,"best_gem_comment_short":"","best_comment":"Translating World Literature is one of my favorite classes at Harvard. Luke is a wonderful professor and I always really looked forward to coming to class. The readings and discussions we had were super interesting and I got so much out of them. The assignments were very creative, fun, and challenging and I thoroughly enjoyed getting to write my own translations of poetry and literature that appealed to me. If you know another language, I highly recommend taking this class. Your view of language and translation will definitely change for the better!","best_comment_short":"The assignments were very creative, fun, and challenging and I thoroughly enjoyed getting to write my own translations of poetry and literature that appealed to me.","best_comment_first":"Translating World Literature is one of my favorite classes at Harvard.","course_id":"212721","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=5991e4f9e5f110c7be16c542fea1617ee2ef8d89aad2aed1a3c3560a3001cf2ae27816ce24dc10600d48e2754f794dce&ReportType=2&regl=en-US"},{"course_code":"ARABIC 131B","useful_title":"Upper-Level Modern Arabic II","course_score_mean":4.75,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":0.93975,"best_gem_comment":"","workload_score_mean":16.56,"best_gem_comment_short":"","best_comment":"You definitely need to be prepared to devote a lot of time to this course, because the workload is heavy, but if you're struggling Ustadh Amr is very understanding and flexible and he will work with you to make sure you stay on top of it. It really is a wonderful course, and the transition to reading real literature and consuming media not made specifically for an Arabic learner is a huge step forward and a confident boost. Highly recommend, but only if you have the time.","best_comment_short":"It really is a wonderful course, and the transition to reading real literature and consuming media not made specifically for an Arabic learner is a huge step forward and a confident boost.","best_comment_first":"You definitely need to be prepared to devote a lot of time to this course, because the workload is heavy, but if you're struggling Ustadh Amr is very understanding and flexible and he will work with you to make sure you stay on top of it.","course_id":"120127","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c207df7c181ce3bcb83b332be27ab1de4a57df98f3a0ad737a54946b695035c5c511cb26f22dd58b14d6fa6f97619bdf&ReportType=2&regl=en-US"},{"course_code":"RELIGION 47","useful_title":"Christian Ethics and Modern Society","course_score_mean":4.77,"rec_score_mean":4.69,"gem_score_mean":0.0,"sentiment_score_median":0.9448,"best_gem_comment":"","workload_score_mean":4.92,"best_gem_comment_short":"","best_comment":"This class has been top 2 for me of 3 years worth of classes.  Recommend it to the highest degree to students who are Christian and battle with how their faith should be a lens and a lighthouse when thinking and discussing hotly debated topics.  This class was so fun and everyone was entirely invested.  I never thought about how much the reading was (which is not too much) because I was so genuinely interested in the material.  Class discussion is the best; this was the only class where I really felt able to say anything relevant without having to worry about being judged or discriminated.  I wish there was more class time per week.  Professor Lockwood is spectacular and gives very useful background information so you also come away learning concrete material.  He has wonderful input and always facilitates the best discussions.","best_comment_short":"He has wonderful input and always facilitates the best discussions.","best_comment_first":"This class has been top 2 for me of 3 years worth of classes.","course_id":"156433","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4788293e4123a39526a484921ea43510829a09fc687595ff68a0eb2ab24be0d14b134e630d78636eb6c1012a9f3e4785&ReportType=2&regl=en-US"},{"course_code":"EXPOS 40","useful_title":"Public Speaking Practicum","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.9231,"best_gem_comment":"","workload_score_mean":3.83,"best_gem_comment_short":"","best_comment":"You've surely heard all about Expos 40, but I'm here to say that it really does live up to the hype. Having the opportunity to speak in front of your class is an invaluable experience, and the feedback you receive over the course of the semester really helps you rethink your tactics and approach. I feel so much more confident speaking, whether extemporaneously or with rehearsal, and better understand my own tendencies, strengths, and areas to improve upon. Also, it's just so fun to hear what everyone decides to speak on each week and spend time delving into topics of your choosing.","best_comment_short":"I feel so much more confident speaking, whether extemporaneously or with rehearsal, and better understand my own tendencies, strengths, and areas to improve upon.","best_comment_first":"You've surely heard all about Expos 40, but I'm here to say that it really does live up to the hype.","course_id":"125227","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a3b98e75f8b26987fe8f75202f0d33664b96e130c8ac7eb111fe241e36af666e31b7da33250bab2f54d79253bd0a21b8&ReportType=2&regl=en-US"},{"course_code":"TDM 112R","useful_title":"Advanced Acting: Contemporary Texts","course_score_mean":4.89,"rec_score_mean":4.78,"gem_score_mean":0.0,"sentiment_score_median":0.8974,"best_gem_comment":"","workload_score_mean":5.56,"best_gem_comment_short":"","best_comment":"This is an AMAZING class. If you have no acting experience, don't worry –– this class is so accessible, and Marcus and Ashleigh are incredibly supportive, kind, and there to help you succeed. This class definitely requires work: be prepared to memorize, think critically about the best roles for you, etc. –– but it is so rewarding. You will gain a better sense of who you are, what motivates\/drives the world around you, and what acting is really about: acting from yourself\/your life experiences. The class is small and intimate, and everyone becomes friends. I'm so glad I took this class before I graduated.","best_comment_short":"If you have no acting experience, don't worry –– this class is so accessible, and Marcus and Ashleigh are incredibly supportive, kind, and there to help you succeed.","best_comment_first":"This is an AMAZING class.","course_id":"122906","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7afd3201e8e240fe73adda68b34a629693cba2a9b54993ce9dbf18d120ec068c66f8c2087d4b98732c01850cbb261d78&ReportType=2&regl=en-US"},{"course_code":"APCOMP 298R","useful_title":"Interdisciplinary Seminar in Applied Computation","course_score_mean":4.9,"rec_score_mean":4.9,"gem_score_mean":0.0,"sentiment_score_median":0.8455,"best_gem_comment":"","workload_score_mean":4.22,"best_gem_comment_short":"","best_comment":"This class is incredibly chill! But it's much more interesting when people contribute. It's good to come in with one comment or question about the material (even if you didn't understand it).","best_comment_short":"But it's much more interesting when people contribute.","best_comment_first":"This class is incredibly chill!","course_id":"109339","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4ff4d81e5a150f2516cc268b5edc70fd592a553f61223ad166b7c6917a2ef791bea45b11c1dff7f699960de836b7001a&ReportType=2&regl=en-US"},{"course_code":"CHEM 100R","useful_title":"Experimental Chemistry and Chemical Biology","course_score_mean":4.54,"rec_score_mean":4.62,"gem_score_mean":0.0,"sentiment_score_median":0.8738,"best_gem_comment":"","workload_score_mean":5.0,"best_gem_comment_short":"","best_comment":"This class is pretty fun if you take it with your friends. All the TFs are very friendly and knowledgeable. Heidi and the TFs are responsive and accommodating. They give a lot of thorough feedback on assignments and are quick to respond to emails\/questions. The only down–side is that the class is 10 hours\/week, and there are assignments that do require a decent amount of time outside of class. Be prepared to dedicate a good chunk of your week to this class. Heidi is also a pretty strict grader.","best_comment_short":"This class is pretty fun if you take it with your friends.","best_comment_first":"This class is pretty fun if you take it with your friends.","course_id":"123022","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=71e0e1f9bf4d086de3f4a4dd17ad39416535c6745e211b520c8cd6cbf1d5e7e5cba3f8d39bc86592d1105540d5f8848a&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 222","course_score_mean":4.5,"rec_score_mean":4.38,"gem_score_mean":0.0,"sentiment_score_median":0.9137,"best_gem_comment":"","workload_score_mean":5.43,"best_gem_comment_short":"","best_comment":"I LOVED More Than a Game. Every essay is so interesting and Keating is flexible about thesis directions. Keating is one of the best professors I’ve ever had the pleasure to learn from. He cares so much about each student and I bc eats in each students writing progress. Definitely take this class!!","best_comment_short":"Keating is one of the best professors I’ve ever had the pleasure to learn from.","best_comment_first":"I LOVED More Than a Game.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c69d450ac369c7f4c0ee041e871fb189919d3942384ab6d5ca27aa7e92b337ce600f5c1c8319c5122121bb0b0cccb234&ReportType=2&regl=en-US"},{"course_code":"LIFESCI 50B","useful_title":"Integrated Science","course_score_mean":4.58,"rec_score_mean":4.48,"gem_score_mean":0.0,"sentiment_score_median":0.91765,"best_gem_comment":"","workload_score_mean":10.31,"best_gem_comment_short":"","best_comment":"LS50 WILL BE THE DEFINING PART OF YOUR FRESHMAN YEAR if you decide to take this course. This is simply fact. You will find a great community of students and really welcoming teaching faculty who will assist you in every way they can. Some people might describe this class as scarring yourself with knowledge such that you build scar tissue to protect you from the trauma of future classes at Harvard and beyond, but it is important to remember that this metaphorical scar is composed of learning the most wide array of topics possible for an introductory course and that in and of itself is valuable.  It can help narrow down what you are interested in studying or fill in the gaps of a subject you may have felt initially weak in.  Another benefit is that the speed of learning and organization of this class will likely prepare you for rigorous courses that have plentiful resources and study aids down the line since LS50 is much more amorphous in the material it covers. Regardless, you will have to be dedicated to the pursuit of learning and thinking like a researcher over worrying over the granularity of your grades. If you focus on the minutiae of points, this is not the class for you and you will likely feel that the outcome of this class is not worth the work entailed. The perception of difficulty and  challenge within this course is only natural and there are many points throughout the course where no student has a detailed background in what is being taught, creating a more even playing field. Personally, the second semester has been exponentially easier than the first in terms of psets and exams although it's not a complete pushover.  Given that LS50 restricts 5 out of the 8 courses you take within your freshman year, I believe the second semester's lowered difficulty will allow you to take on an additional 1 or even 2 courses. With all that said, this class is definitely not for everyone. If you are not interested in exploring the integration of mathematical and physics based components into biology or chemistry, immediately walk away and run in the other direction. Ls1B and LS1A are much better fits for people interested in pure bio and chem. If you are somewhere wavering in between and wondering why this inclusion of math in biology is important or even remotely interesting, it allows you to dive deep into the mechanics of cells and life that are often taken for granted in typical life science courses and presents a useful paradigm for research questions and modeling of biological systems. Personally, I entered this course much more interested in medicine than research but in exiting, I have grown to appreciate research more in tandem with medicine. Deciding to take this course is a pretty huge decision and one that should not be left up to your ego. It's important to level your expectations by consulting with a previous student or some members of the teaching faculty but even in cases where expectations were not necessarily aligned with the reality of the course, there is a general consensus of feeling extremely rewarded by all this class has to offer.","best_comment_short":"You will find a great community of students and really welcoming teaching faculty who will assist you in every way they can.","best_comment_first":"LS50 WILL BE THE DEFINING PART OF YOUR FRESHMAN YEAR if you decide to take this course.","course_id":"159707","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=58302da63369f8e5375422e81d286e10a71f2fad57897c155d241efee983695b9cc16eb035ac9907e2ae98acf49cd17d&ReportType=2&regl=en-US"},{"course_code":"HAA 42P","useful_title":"Architecture through the Ages: Notre-Dame-de-Paris","course_score_mean":4.6,"rec_score_mean":4.63,"gem_score_mean":0.0,"sentiment_score_median":0.9106,"best_gem_comment":"","workload_score_mean":4.6,"best_gem_comment_short":"","best_comment":"Fantastic HAA course. One of my favorites as a concentrator. Very manageable workload, very interesting course content. Professor Hamburger and the TF Ale are wonderful and very engaging, and really make an effort to get to know each student which is often underlooked. Take this course 100%, even if youre not a concentrator this is a great course to take for the humanities distribution requirement as well since you don't need any background whatsoever for this course.","best_comment_short":"Professor Hamburger and the TF Ale are wonderful and very engaging, and really make an effort to get to know each student which is often underlooked.","best_comment_first":"Fantastic HAA course.","course_id":"215759","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=de976700b5b29e64894dd7c6c7c4c5e0a677929b17c930578e32c17e1552bab44b4f10ab35701a4cb452b7ac65dd7c3f&ReportType=2&regl=en-US"},{"course_code":"CHNSE BB","useful_title":"Elementary Modern Chinese","course_score_mean":4.75,"rec_score_mean":4.75,"gem_score_mean":0.0,"sentiment_score_median":0.8942,"best_gem_comment":"","workload_score_mean":6.29,"best_gem_comment_short":"","best_comment":"The teaching staff is really amazing and supportive, and they are all excellent teachers. Though the coursework is a lot, your Chinese will improve rapidly. The course encourages you to be consistent and intentional with your language learning, and it has been instrumental in helping me on a trajectory towards becoming fluent.","best_comment_short":"The teaching staff is really amazing and supportive, and they are all excellent teachers.","best_comment_first":"The teaching staff is really amazing and supportive, and they are all excellent teachers.","course_id":"124237","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2261616045c191b5b0d2bdbfd8e45ccb9834b7a5a5dd5f8369433c6505731cffa2d806da82dcbbbf1c5c9b6bbd3e4b19&ReportType=2&regl=en-US"},{"course_code":"SOC-STD 98EO","useful_title":"Art, Political Culture, and Civic Life","course_score_mean":4.7,"rec_score_mean":4.8,"gem_score_mean":0.0,"sentiment_score_median":0.87515,"best_gem_comment":"","workload_score_mean":4.9,"best_gem_comment_short":"","best_comment":"This class singlehandedly changed the course of my thesis and inspired me to focus on the topics I love and am passionate about. By far it is the best tutorial\/small discussion based course I have ever been in. The professor (as well as every classmate) was ready to have amazing and deep discussions on topics, and always provided helpful feedback and suggestions for our papers. After giving my presentation on my final paper, I truly believe the feedback I received from both students and the professor helped me put together a better paper. Words can't express how amazing this class was. Not to give myself away, but is one of the few classes where I always made sure to do EVERY readings, because that's how interesting the topics were. It was two hours long, but the pace of discussion and the enthusiasm of my classmates never made it feel like that. One of the few (if not only) classes were a five minute break halfway through; there was always something else to talk about. Take this course if you want to truly learn how to have freedom and creativity with your thesis. With Professor Adatto, every topic is possible!","best_comment_short":"This class singlehandedly changed the course of my thesis and inspired me to focus on the topics I love and am passionate about.","best_comment_first":"This class singlehandedly changed the course of my thesis and inspired me to focus on the topics I love and am passionate about.","course_id":"116288","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8cbc3a4c223a3601d4352534fdf87084c1bf72d1d5d5d12a9e2bf4efad253d834fdc0f2a6d0942f9cea4b1f5dbb38356&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 236","course_score_mean":4.82,"rec_score_mean":4.73,"gem_score_mean":0.0,"sentiment_score_median":0.9558,"best_gem_comment":"","workload_score_mean":3.73,"best_gem_comment_short":"","best_comment":"If you have the slightest interest in immigration and\/or incarceration, you should DEFINITELY take this course. Based on what I've been hearing from my peers, this is actually one of the best expos you can take in terms of both content and workload. Readings are interesting and very light (graphic novels, podcasts, and videos a lot of the time!), and we always have good discussions on them. I'm usually a pretty quiet person when it comes to class discussions, but the environment was very comfortable and Erin is so friendly that I felt comfortable speaking up whenever! There's no \"unnecessary\" busywork, just the core assignments. Erin is very accessible, flexible, and simply the best!!! She feels more like a friend\/mentor, and I loved having her as my preceptor!","best_comment_short":"I'm usually a pretty quiet person when it comes to class discussions, but the environment was very comfortable and Erin is so friendly that I felt comfortable speaking up whenever!","best_comment_first":"If you have the slightest interest in immigration and\/or incarceration, you should DEFINITELY take this course.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=33cb7f57d4b5ca27e0cf40c894650d62d23391e4bc703eb915ece4083b9a035d33c969bb3436beb7692680c6adea739d&ReportType=2&regl=en-US"},{"course_code":"HIST 1029","useful_title":"Early Modern Britain, 1485-1714","course_score_mean":4.69,"rec_score_mean":4.58,"gem_score_mean":0.0,"sentiment_score_median":0.9041,"best_gem_comment":"","workload_score_mean":4.91,"best_gem_comment_short":"","best_comment":"It is a great introductory course for people interested in studying history. The subject matter was specific enough that somebody with a genuine curiosity in the subject would find all lectures really engaging and would appreciate Professor Cratty's enthusiasm in the subject and willingness to answer questions. The essays\/projects of the class were also genuinely fun to complete as they were not simply conventional essays.","best_comment_short":"The subject matter was specific enough that somebody with a genuine curiosity in the subject would find all lectures really engaging and would appreciate Professor Cratty's enthusiasm in the subject and willingness to answer questions.","best_comment_first":"It is a great introductory course for people interested in studying history.","course_id":"218065","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8cfd2caf530e5764ad0f4c69251bcc6f4ed7031427291d17cc29580a52712972b4f1df2b10f75d542171bb64771623a7&ReportType=2&regl=en-US"},{"course_code":"RUSS 112","useful_title":"Fourth-Year Russian: Russian Media and Popular Culture","course_score_mean":4.78,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":0.834,"best_gem_comment":"","workload_score_mean":6.78,"best_gem_comment_short":"","best_comment":"This is a wonderful class (if Svitlana Malykhina is teaching) that I can't recommend highly enough! It's so engaging and guides you to consider aspects of media (graffiti, contemporary music, photography) that are often overlooked and how they interact with Russian culture. Svitlana is an incredible professor and is so dedicated to supporting her students in their learning","best_comment_short":"Svitlana is an incredible professor and is so dedicated to supporting her students in their learning","best_comment_first":"This is a wonderful class (if Svitlana Malykhina is teaching) that I can't recommend highly enough!","course_id":"112854","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3e0a7de20ca673e9af547e3e41636252dad14e1e5ece6dcae1d359228cbd700a305554a258f172aafce7f9baa393ef33&ReportType=2&regl=en-US"},{"course_code":"HEB 1339","useful_title":"The Human Brain in the Animal Kingdom","course_score_mean":4.53,"rec_score_mean":4.58,"gem_score_mean":0.0,"sentiment_score_median":0.86965,"best_gem_comment":"","workload_score_mean":3.28,"best_gem_comment_short":"","best_comment":"Take this class! It is truly focused on your learning, not on how well you can memorize. Erin makes it interesting and fun, and it is a refreshing perspective on the human brain and neuroanatomy and physiology. You also bond with your classmates in a way that doesn't usually happen in stem classes. I loved this class!!","best_comment_short":"Erin makes it interesting and fun, and it is a refreshing perspective on the human brain and neuroanatomy and physiology.","best_comment_first":"Take this class!","course_id":"214351","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=72c20d2c7fbff59c93304a49e1a0aef62e169e1817f308158b6c50e4c72b3e315930aabf333b93753e3124a770e8d6fd&ReportType=2&regl=en-US"},{"course_code":"ARABIC 131B","useful_title":"Upper-Level Modern Arabic II","course_score_mean":4.88,"rec_score_mean":4.63,"gem_score_mean":0.0,"sentiment_score_median":0.9095,"best_gem_comment":"","workload_score_mean":12.38,"best_gem_comment_short":"","best_comment":"You should definitely take this course! I had been off cycle in the Arabic department when I entered and definitely felt that Professor Madi was exceptionally good at addressing my level of Arabic specifically relative to the course. Moreover, he is an exceptionally welcoming and attentive professor; of all the courses that I took to complete my citation, this one was *truly* the most rewarding and fun! If you're debating continuing because you're not sure of your experience with the first two years of Arabic using Kitaab al–Kitaab, this course –– especially with Professor Madi heading it –– is a refreshing departure that really will boost your confidence and ability tremendously.","best_comment_short":"Moreover, he is an exceptionally welcoming and attentive professor; of all the courses that I took to complete my citation, this one was *truly* the most rewarding and fun!","best_comment_first":"You should definitely take this course!","course_id":"120127","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=71d4f3c9f605e27b006fadd529c436743e8fa46633fa33f71c65c5537f36abeb68840123106b98b40c988b8a0823fae6&ReportType=2&regl=en-US"},{"course_code":"OEB 128","useful_title":"From Darwin to Derrida: The Evolution of Meaning and Purpose","course_score_mean":4.45,"rec_score_mean":4.64,"gem_score_mean":0.0,"sentiment_score_median":0.83415,"best_gem_comment":"","workload_score_mean":3.91,"best_gem_comment_short":"","best_comment":"This is a wonderful class! Professor Haig is a truly phenomenal Professor: so kind, so accessible, deeply enthusiastic about his work\/the space, and committed to creating the best learning experience for his students. His book, From Darwin to Derrida, is a fascinating foray into the philosophy of biology and debates about meaning\/purpose in biology; even if you don't have a background in biology, you will learn so much –– there are a multitude of connections between his work and other fields, including communications and CS. It's also a small, intimate class (about ~15 this semester, I believe), so you'll get to know everyone\/feel a sense of community. And the coursework is manageable\/the class is not about grading: it's about learning and critically engaging with the material. I highly recommend this class!","best_comment_short":"Professor Haig is a truly phenomenal Professor: so kind, so accessible, deeply enthusiastic about his work\/the space, and committed to creating the best learning experience for his students.","best_comment_first":"This is a wonderful class!","course_id":"216473","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d0a85f6b33885ba6c50e8339d8b229fb11ee0a659f42145a41604747ca098a9e1a0e25f9f1bf1d05262f5384ecb7844e&ReportType=2&regl=en-US"},{"course_code":"MATH 231BR","useful_title":"Advanced Algebraic Topology","course_score_mean":4.54,"rec_score_mean":4.58,"gem_score_mean":0.0,"sentiment_score_median":0.8996,"best_gem_comment":"","workload_score_mean":13.17,"best_gem_comment_short":"","best_comment":"This was a wonderful course!! Prof. Hopkins is an incredible lecturer, and I highly recommend going to the lectures (no matter who teaches it next semester). Even though is is really busy (being the head of the math dept.), he makes time for his 231 students and his office hours are very fun! Also, Sanath Devalapurkar, our CA, is great; he's super helpful, accessible, and does a good job complementing Prof. Hopkins' perspectives.The material in this class is very beautiful... if abstract homotopy theory is your thing. I'd recommend having a working knowledge of category theory (i.e. going through Riehl's Category Theory in Context ch. 1–4 would be slightly overkill, but the definitions in those chapters shouldn't be unfamiliar), and a good familiarity with the computations of (co)homology.  The material definitely starts off deceptively slow, but by the time we got to spectral sequences, things were moving at a good pace. Just be prepared to be doing algebra and not geometry – that's what Paul Seidel's 18.906 is for (so I've heard). There are tons of typos in the lecture notes\/psets, but as a class, we put the lecture notes on overleaf, so we would all go through and correct things – some students even added substantial exposition of things they found confusing or interesting, which was super helpful! The psets are really interesting though, and aren't a lot of work – I wouldn't get started the day they're due, because it can take some time to think about, but they're not bad at all.Overall, this class has a lot of community, very cool material, and teaches you some useful life skills (like how to use the Serre spectral sequence and the basics of ∞–categories, which are objectively useful life skills in math). Definitely take it!","best_comment_short":"The psets are really interesting though, and aren't a lot of work – I wouldn't get started the day they're due, because it can take some time to think about, but they're not bad at all.Overall, this class has a lot of community, very cool material, and teaches you some useful life skills (like how to use the Serre spectral sequence and the basics of ∞–categories, which are objectively useful life skills in math).","best_comment_first":"This was a wonderful course!!","course_id":"123433","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f8cda519abebedf36d74062ea0ea0cf8a943a692817deac70353d7bf8d970a09be9921b940413a1598b0ec1e42a36fff&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 259","course_score_mean":4.77,"rec_score_mean":4.83,"gem_score_mean":0.0,"sentiment_score_median":0.9041,"best_gem_comment":"","workload_score_mean":5.31,"best_gem_comment_short":"","best_comment":"This is definitely one of the best expos classes you can take the material is super interesting and it's a manageable workload. Also Dr. Zecca is great.","best_comment_short":"This is definitely one of the best expos classes you can take the material is super interesting and it's a manageable workload.","best_comment_first":"This is definitely one of the best expos classes you can take the material is super interesting and it's a manageable workload.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=5db9447702feace61dbb66868eae030bb1f3ccff1209025d1094b8a191b7f386beff5088b1f5567917ecd0f2ac70ed2c&ReportType=2&regl=en-US"},{"course_code":"WOMGEN 98S","useful_title":"Tutorial - Junior Year: Research and Methods","course_score_mean":4.31,"rec_score_mean":4.54,"gem_score_mean":0.0,"sentiment_score_median":0.8247,"best_gem_comment":"","workload_score_mean":6.31,"best_gem_comment_short":"","best_comment":"This is a great course to prepare you for senior thesising and a great opportunity to spend a semester working on a project you are passionate about. I felt so supported, personally and academically, in this class and was given the tools to create a project I cared about and was really proud of.","best_comment_short":"This is a great course to prepare you for senior thesising and a great opportunity to spend a semester working on a project you are passionate about.","best_comment_first":"This is a great course to prepare you for senior thesising and a great opportunity to spend a semester working on a project you are passionate about.","course_id":"122980","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=50a3786838559d06bf68dd303b61c54f79bbd01aa940db59a3bb069d1602dabc60cebe0f30aef2b0bed8150eef3d830b&ReportType=2&regl=en-US"},{"course_code":"ENGLISH CNGS","useful_title":"Fiction Workshop: The Good Stuff","course_score_mean":4.78,"rec_score_mean":4.89,"gem_score_mean":0.0,"sentiment_score_median":0.7712,"best_gem_comment":"","workload_score_mean":7.67,"best_gem_comment_short":"","best_comment":"Moments of resonant belonging are rare in life, but especially in adulthood. As I age and mature, I find myself a little less pliable, elasticity slowly bowing to rigidity. And yet, this class was a belonging space for me and a resounding one at that. In my PhD program my writing had been everything but handled tenderly. I’m under no delusion that my writing doesn’t need work; however, I’ve never been in a space where we are so strongly encouraged to find the good, the cors and to make a piece the best version of itself not your best version. Academia has largely severed my connection with writing although it was my lifeblood as an introverted child working through what I now recognize as trauma. I’ve gradually lost my connection to the sustaining power of this art, compounding my pain. This class has begun to mend that relationship. It’s forced me to see the good in my own work. It’s pushed me to offer myself the same tenderness that I seek to offer others.Within the first few classes, if not the first class, Meng was able to invite us into a space where not only were we affirmed, but so too was our writing. The writing exercises early on both excited and intimidated me. Watching the ink spread on my page gave form and life to my ideas. So many of them have gone untilled, unattended that it seemed impossible to ever watch them flower and fruit. Within the greenhouse of our classroom, as I released my cors into the atmosphere and so did my peers, our gifts collided, thickened, and nourished us all. I’ve learned so much from this class. Let the erotic lead you to the “I.” Continually asking myself, “what comes through the hole?,” diverging from tropes and detouring from the paths our minds try to take us for a more excellent way, and, of course, “tell, don’t show.” But even beyond these, the hardest lesson Meng has taught is the importance (and challenge) of writing the good. the beautiful. the delightful. I must admit, this is a lesson that I will be learning for the rest of my life, but it’s one of which I’m beginning to appreciate the value. I really needed this class. It has done more for me than I can adequately express. Thank you, Meng, for the invitation to join this class and thank you for bringing such an amazing course concept to life for each of us.","best_comment_short":"I’m under no delusion that my writing doesn’t need work; however, I’ve never been in a space where we are so strongly encouraged to find the good, the cors and to make a piece the best version of itself not your best version.","best_comment_first":"Moments of resonant belonging are rare in life, but especially in adulthood.","course_id":"218853","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=789f1714637119d71194235631247a8ad0f279b23f3c7c90d1b535c043865e300f37b09daa6132c3f153990e21701241&ReportType=2&regl=en-US"},{"course_code":"ANTHRO 1883","useful_title":"Where Science Meets Society: Introduction to STS","course_score_mean":4.53,"rec_score_mean":4.5,"gem_score_mean":0.0,"sentiment_score_median":0.937,"best_gem_comment":"","workload_score_mean":4.06,"best_gem_comment_short":"","best_comment":"This class was very interesting in that it really brought how social factors influence the facts that we learn in school and in academia in general. Great conversations and workload. Readings can sometimes be pretty dense but as long as you get the gist from each one that is enough to be able to actively participate. Got a little repetitive and boring in the second half of the semester but overall really enjoyed this class! Anna is amazing and a great facilitator of conversation.","best_comment_short":"Anna is amazing and a great facilitator of conversation.","best_comment_first":"This class was very interesting in that it really brought how social factors influence the facts that we learn in school and in academia in general.","course_id":"213469","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ccf58a05cffa1882feb9cfd2414c1ccfdc287f9a71af722ed08acd4578fdb91dc578e03e893f2035b09d87470259ff1c&ReportType=2&regl=en-US"},{"course_code":"FRENCH 40","useful_title":"Advanced French I: The Contemporary Francophone World Through Cinema","course_score_mean":4.86,"rec_score_mean":4.71,"gem_score_mean":0.0,"sentiment_score_median":0.9013,"best_gem_comment":"","workload_score_mean":3.57,"best_gem_comment_short":"","best_comment":"This course is a great step in the French path. It is interesting and the films are great. Be aware, the film Laurence Anyways is great but it is 3hrs, so just don't procrastinate it. Be sure to discuss in class or else the class will be awkward. The workload is not very heavy! Dre Brisson is so great and kind.","best_comment_short":"Dre Brisson is so great and kind.","best_comment_first":"This course is a great step in the French path.","course_id":"126997","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=db02003d62e6e3a14b9cb259aed661e03fc8dd470badb14a5bd8389aadfde926eabe9aec00d42321650956923f13ac56&ReportType=2&regl=en-US"},{"course_code":"MODGRK 100","useful_title":"Advanced Modern Greek: Introduction to Modern Greek Literature","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.7955,"best_gem_comment":"","workload_score_mean":2.4,"best_gem_comment_short":"","best_comment":"Amazing class! Calliope is wonderful and we had some great discussions.","best_comment_short":"Calliope is wonderful and we had some great discussions.","best_comment_first":"Amazing class!","course_id":"123852","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=722fecb102f3337df4e55bb2e8cd751998915ffe04b73b89e7236a9148156cdb4551fb20900cc4009cdbca2d891a155b&ReportType=2&regl=en-US"},{"course_code":"SOCIOL 1130","useful_title":"Student Leadership and Service in Higher Education","course_score_mean":4.89,"rec_score_mean":4.83,"gem_score_mean":0.0,"sentiment_score_median":0.88975,"best_gem_comment":"","workload_score_mean":4.47,"best_gem_comment_short":"","best_comment":"I would highly recommend Sociology 1130, especially if you've enjoyed other interactive classes like Expos 40 and freshman seminars. Manja and Catherine as a teaching team provide the most welcoming, helpful, and kind environment I have found in a Harvard class. Just as importantly, the group of students is incredibly inspiring, and the class allows you to learn from them throughout. This class really pushed me to reflect more on myself as a leader, my experiences at Harvard, and my goals for the future.","best_comment_short":"Manja and Catherine as a teaching team provide the most welcoming, helpful, and kind environment I have found in a Harvard class.","best_comment_first":"I would highly recommend Sociology 1130, especially if you've enjoyed other interactive classes like Expos 40 and freshman seminars.","course_id":"205039","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f1ad42e13991ec0b808812179e225f97d96f3edb84ffbfeea5110feffe35624c896eba9785d5ce2144538402d4323e91&ReportType=2&regl=en-US"},{"course_code":"CLS-STDY 112","useful_title":"Regional Study: Macedonia","course_score_mean":4.63,"rec_score_mean":4.88,"gem_score_mean":0.0,"sentiment_score_median":0.77815,"best_gem_comment":"","workload_score_mean":3.88,"best_gem_comment_short":"","best_comment":"A well–taught, well–executed class. Prof. Andrews and Sarah did a great job with the course, and you will enjoy the experience immensely. Though the quizzes are a tad obnoxious, the rest of the assignments are fair and enjoyable. The trip is also a nice touch as well. Overall, though a required class for the concentration, CLS–STDY 112 will serve you well and will become one of your highlights of the semester.","best_comment_short":"Prof. Andrews and Sarah did a great job with the course, and you will enjoy the experience immensely.","best_comment_first":"A well–taught, well–executed class.","course_id":"156313","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0806c8f716a3896ad46b1ab1680b230570d1c2106c218bee5a375ebca2b630ee881ca6b72090c5d90038f1f968e18cce&ReportType=2&regl=en-US"},{"course_code":"ENG-SCI 94","useful_title":"Entrepreneurship and Innovation: Practical and Academic Insights","course_score_mean":4.56,"rec_score_mean":4.69,"gem_score_mean":0.0,"sentiment_score_median":0.92995,"best_gem_comment":"","workload_score_mean":3.46,"best_gem_comment_short":"","best_comment":"I would say to take this class. it was so fun and Josh is a great and enthusiastic lecturer. you learn a lot from the case studies and from your peers and it truly has that Harvard MBA class style written all over it. You meet some really cool people and just generally learn what it takes to be successful with your startup. I can say taking this class will directly lead me to making better decisions if I have a company. I think that the grading is pretty good too as 20% get As ,70% A–, and  10% get B+, so I think that most students should be alright. The only problem for me was that I never got my assignments back on time so I don't really know where I fall in the above grading. I think they Got to improve on that.","best_comment_short":"it was so fun and Josh is a great and enthusiastic lecturer.","best_comment_first":"I would say to take this class.","course_id":"217639","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=15e67e6ca28d727fd488e648eb31d8a16956b5ee423f73125fc4c3fac22b5b54b2abfc5d30fb34643b1bdbc4c5a41ad0&ReportType=2&regl=en-US"},{"course_code":"MATH 137","useful_title":"Algebraic Geometry","course_score_mean":4.28,"rec_score_mean":4.17,"gem_score_mean":0.0,"sentiment_score_median":0.8361,"best_gem_comment":"","workload_score_mean":10.04,"best_gem_comment_short":"","best_comment":"This is a nice class, good intro to classical algebraic geometry. Expect a lot of algebra, and less geometry. More algebra than something like algebraic topology. While it's not a prerequisite, I would say it would be helpful to be confident in the fruits and veggies of Math 131 Topology and basic algebra stuff about rings \/ fields.","best_comment_short":"While it's not a prerequisite, I would say it would be helpful to be confident in the fruits and veggies of Math 131 Topology and basic algebra stuff about rings \/ fields.","best_comment_first":"This is a nice class, good intro to classical algebraic geometry.","course_id":"116452","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4d9f0532528bfd076fa45f6e60616897ba60da9c7c14527ef82f9df21e9285549596be8d2e4253813cb8bf8a9e527e44&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 233","course_score_mean":4.85,"rec_score_mean":4.77,"gem_score_mean":0.0,"sentiment_score_median":0.9206,"best_gem_comment":"","workload_score_mean":5.62,"best_gem_comment_short":"","best_comment":"Super interesting course with a very manageable workload – highly recommend if you're interest in bio. I originally didn't like writing very much, but actually enjoyed writing most of these essays – however, the caveat to this is that you must must must start early on your essay. Writing your entire essay the day before it's due is never going to be fun, no matter how good the course is. Other than that, Emilie is a joy to be in class with and is super helpful and accommodating to her students","best_comment_short":"Super interesting course with a very manageable workload – highly recommend if you're interest in bio.","best_comment_first":"Super interesting course with a very manageable workload – highly recommend if you're interest in bio.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2d5bb177061389d27a6066b7ab690a76e90dda1887a3137a10d26adb050b729db5c444e8798ba345e2d3d97c87f3a73b&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 246","course_score_mean":4.93,"rec_score_mean":4.93,"gem_score_mean":0.0,"sentiment_score_median":0.9302,"best_gem_comment":"","workload_score_mean":8.43,"best_gem_comment_short":"","best_comment":"Rank this expos as your first choice!!! You will not regret it. Hudson is what truly makes this class and is very understanding. He makes expos as bearable as possible but still pushes you to become a better writer. Regarding the work, all of the assignments build up to the major essays and is structured to make the writing process easier. Though, what you put into the course is what you get out. One thing that makes this expos different is the engaged portion built into the course which involves several guest speakers who are directly involved with the issue at hand. All of the speakers were great and I enjoyed listening to the work they've done to help solve the mass incarceration crisis in the country.  Overall, this was one of my favorite classes of the year because of the interesting topic and people.","best_comment_short":"All of the speakers were great and I enjoyed listening to the work they've done to help solve the mass incarceration crisis in the country.","best_comment_first":"Rank this expos as your first choice!!!","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=80e56f1688c647c12c2da25e05d71815cfc1a493fa907f99796c7ae18581ac2c3c1a2d3e0b45979f45560de4b48b95a8&ReportType=2&regl=en-US"},{"course_code":"HAA 172P","useful_title":"Artisanal Modernism & the Labor of Women","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.89145,"best_gem_comment":"","workload_score_mean":7.63,"best_gem_comment_short":"","best_comment":"Wonderful seminar in which you not only get to travel to NYC to see some amazing exhibits for free, but also have the chance to improve your writing and close looking skills dramatically while discussing some incredible and underappreciated artworks and artists. Professor Gough seems intimidating but is lovely and supportive. Her passion for the work is palpable.","best_comment_short":"Wonderful seminar in which you not only get to travel to NYC to see some amazing exhibits for free, but also have the chance to improve your writing and close looking skills dramatically while discussing some incredible and underappreciated artworks and artists.","best_comment_first":"Wonderful seminar in which you not only get to travel to NYC to see some amazing exhibits for free, but also have the chance to improve your writing and close looking skills dramatically while discussing some incredible and underappreciated artworks and artists.","course_id":"218177","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7fdd452e2a1681efd5e79f31ae81dbee0f63ab336337940b02cb52c009cfbc9c5a5221708afdda49dc54c646a6dd2621&ReportType=2&regl=en-US"},{"course_code":"HIND-URD 102B","useful_title":"Intermediate Hindi-Urdu","course_score_mean":4.78,"rec_score_mean":4.78,"gem_score_mean":0.0,"sentiment_score_median":0.8944,"best_gem_comment":"","workload_score_mean":5.56,"best_gem_comment_short":"","best_comment":"Richard ji is the funniest, eccentric professor with a great depth of knowledge of the language and culture. It's truly a treat to learn with him and I am consistently encouraged to continue through, even when I feel like I'm at a dead end. All he cares about is our learning in the most authentic of ways.","best_comment_short":"Richard ji is the funniest, eccentric professor with a great depth of knowledge of the language and culture.","best_comment_first":"Richard ji is the funniest, eccentric professor with a great depth of knowledge of the language and culture.","course_id":"159974","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=5ea48e1b41ed8f3512394fe9f87e1c6425e77b03d9a942633931c8ae9cae11bc4dcf62fb39a9479dd83b4f629c4fe364&ReportType=2&regl=en-US"},{"course_code":"CHNSE 123XB","useful_title":"Intermediate Modern Chinese for Advanced Beginners","course_score_mean":4.63,"rec_score_mean":4.84,"gem_score_mean":0.0,"sentiment_score_median":0.83025,"best_gem_comment":"","workload_score_mean":6.28,"best_gem_comment_short":"","best_comment":"fantastic, fantastic course for people who are looking to improve their conversational Chinese — my parents have remarked on my improvement from our facetimes :) and the teachers are so lovely","best_comment_short":"fantastic, fantastic course for people who are looking to improve their conversational Chinese — my parents have remarked on my improvement from our facetimes :) and the teachers are so lovely","best_comment_first":"fantastic, fantastic course for people who are looking to improve their conversational Chinese — my parents have remarked on my improvement from our facetimes :) and the teachers are so lovely","course_id":"143892","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=bba96c531bec37742c5dd0e36bfcbabf154ba509d9e9ecbf95c9abbd77f773b21c1c38949bc72f18049ed6597190766b&ReportType=2&regl=en-US"},{"course_code":"CHEM 154","useful_title":"Advanced Inorganic Chemistry","course_score_mean":4.92,"rec_score_mean":4.75,"gem_score_mean":0.0,"sentiment_score_median":0.7178,"best_gem_comment":"","workload_score_mean":5.36,"best_gem_comment_short":"","best_comment":"Chem 154 is a great class if you enjoyed Chem 40 and are looking to learn more about the *why* to everything you learned in Chem 40. The details aren't skipped and you learn the math behind everything. Prof. Nocera is a good lecturer, and you will definitely learn a lot in this class! Problem sets can be tricky but my TF was always willing to help and exams were pretty straight forward.  Definitely would recommend if you are interested in inorganic chem!","best_comment_short":"Problem sets can be tricky but my TF was always willing to help and exams were pretty straight forward.","best_comment_first":"Chem 154 is a great class if you enjoyed Chem 40 and are looking to learn more about the *why* to everything you learned in Chem 40.","course_id":"126035","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6effb2358f76cdbf63520106d14ba2c8d6b5d79c837815754404caa2f7113b4a3dea0901405f741946279ad58c81a532&ReportType=2&regl=en-US"},{"course_code":"CHNSHIS 113","useful_title":"Life and Death in Late Imperial China: Social History of the 10th to 19th Centuries","course_score_mean":4.7,"rec_score_mean":4.8,"gem_score_mean":0.0,"sentiment_score_median":0.82275,"best_gem_comment":"","workload_score_mean":5.3,"best_gem_comment_short":"","best_comment":"This was the best class I've ever taken at Harvard, hands down. As a cynical history concentrator I had grown tired of the standard way history classes are taught, but Professor Szonyi reinvigorated my love for history. His lecture style is very participatory, there was no class where he was just talking and students were just taking notes; in every single class, 90% of the students participated in the class discussion (which was intertwined with the lectures). My comments actually felt valued by Professor Szonyi and the TF (Chao); it was a nice feeling. Even if you don't think you would be interested in Imperial Chinese history (I get it), after taking this class you will feel so lucky to have learned more about it. Also, for the STEM people out there, you should consider this class too. There were multiple STEM concentrators in the class, and everyone was able to participate fully. Readings are well chosen, and never overwhelming. 10\/10, 5 stars, etc. Essentially, just take this class!","best_comment_short":"As a cynical history concentrator I had grown tired of the standard way history classes are taught, but Professor Szonyi reinvigorated my love for history.","best_comment_first":"This was the best class I've ever taken at Harvard, hands down.","course_id":"120602","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=303a24f822f90724f29553d297a33e054e0b39eec8c88d3602ed0e4c286484554a516a605b7dba38c5ac773c4004f876&ReportType=2&regl=en-US"},{"course_code":"CHNSE 123XB","useful_title":"Intermediate Modern Chinese for Advanced Beginners","course_score_mean":4.87,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":0.9149,"best_gem_comment":"","workload_score_mean":6.13,"best_gem_comment_short":"","best_comment":"Taking Chinese was an AMAZING experience, and I'm so glad I took it for at least one semester during my time at Harvard. Take it with friends in the same section and class will always be fun, the teachers are incredible and I learned so much of the language! I appreciate that content is based around very applicable topics, so everything we learn feels very useful.","best_comment_short":"Taking Chinese was an AMAZING experience, and I'm so glad I took it for at least one semester during my time at Harvard.","best_comment_first":"Taking Chinese was an AMAZING experience, and I'm so glad I took it for at least one semester during my time at Harvard.","course_id":"143892","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9923289e398f4a9ef4cbcbe949cbca0ad384a97bd5ff01487a23cedf792c87552993c367866c73fe6dccbf19db1b17da&ReportType=2&regl=en-US"},{"course_code":"OEB 253R","useful_title":"Evolutionary Genetics Seminar","course_score_mean":4.63,"rec_score_mean":4.75,"gem_score_mean":0.0,"sentiment_score_median":0.8976,"best_gem_comment":"","workload_score_mean":2.71,"best_gem_comment_short":"","best_comment":"John is an amazing facilitator, and such an incredible resource to have if you are interested in population genetics. However, you will get out of this class what you put in. The more extensively you read the paper before each session, the better questions you'll have and more you'll learn! But take it take it !!!! if you want a relaxed but exciting investigation into interesting evo pop gen topics","best_comment_short":"if you want a relaxed but exciting investigation into interesting evo pop gen topics","best_comment_first":"John is an amazing facilitator, and such an incredible resource to have if you are interested in population genetics.","course_id":"131584","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2802d37361cae8a3dbe7efb823200b5ce12feebaee7dcb233de182cb48efea192485681dca0dc1c7c8673f7d173bd273&ReportType=2&regl=en-US"},{"course_code":"KOREAN 120B","useful_title":"Intermediate Korean","course_score_mean":4.75,"rec_score_mean":4.5,"gem_score_mean":0.0,"sentiment_score_median":0.9008,"best_gem_comment":"","workload_score_mean":5.88,"best_gem_comment_short":"","best_comment":"While the course can be hard at time, it is worth the effort since I could clearly see great improvements in my Korean skills. Professor Noh is honestly one of the best teachers. She can explain really complex grammar structures in such a simple manner all while speaking Korean. Also, she makes class so fun through her dynamic and engaging teaching style. I also really liked how this semester we learned more about Korean culture and how to talk about cultural differences. This is a must take class if you want to continue to improve your Korean.","best_comment_short":"While the course can be hard at time, it is worth the effort since I could clearly see great improvements in my Korean skills.","best_comment_first":"While the course can be hard at time, it is worth the effort since I could clearly see great improvements in my Korean skills.","course_id":"124043","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2847e98b6a89bf9332e233bcc5265b9167347e4521eaccf725bc1dabface44a24d7d33e17559ea5d268d4709239a849c&ReportType=2&regl=en-US"},{"course_code":"PHYSICS 143A","useful_title":"Quantum Mechanics I","course_score_mean":4.55,"rec_score_mean":4.59,"gem_score_mean":0.0,"sentiment_score_median":0.8846,"best_gem_comment":"","workload_score_mean":9.33,"best_gem_comment_short":"","best_comment":"Take this course, especially if it's with Professor Louis!! Professor Louis has such an illustrious career in practically every field in physics, and he's done physics education research and it shows! Professor Louis prioritizes student learning over everything else, and he is incredibly accessible and approachable, and will answer any questions you have during lecture or office hours (and will NEVER make you feel dumb). I think the pace and structure of this course is very well thought–out, and because of that, I think that I will retain the knowledge from this course for years to come. In addition, the support in this course is just amazing– there were office hours EVERY DAY, so no matter which day you started the pset on, you could count on getting support that day. The sections were above and beyond in quality – my TF Spencer was able to clarify, explain, and expand upon content covered in lecture, and I always felt prepared for the pset after his section. While the material is complex and difficult to understand (it's quantum mechanics), the course staff do everything in their power to help you. The psets can be quite difficult and time–consuming, but again, with the support from the teaching staff and from your classmates (highly recommend working with others!), they are doable and are very enlightening and satisfying to finish. Exams are similar in style – challenging, but not impossible, and certainly worth it. Don't feel intimidated by quantum mechanics; this class makes it very fun and gratifying to learn!","best_comment_short":"Don't feel intimidated by quantum mechanics; this class makes it very fun and gratifying to learn!","best_comment_first":"Take this course, especially if it's with Professor Louis!!","course_id":"108465","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a27ff63eab0d02df6b221706da361b677e0eadecedf88365c9f42c28d74ddfa66e1152f13260a960dbbdc6a432004efd&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 271","course_score_mean":4.38,"rec_score_mean":4.46,"gem_score_mean":0.0,"sentiment_score_median":0.9274,"best_gem_comment":"","workload_score_mean":5.38,"best_gem_comment_short":"","best_comment":"If you are not looking for something literary, this section is probably not the best fit, but the class is great for those interested in the subject (being Gothic fiction). Pat is a very thorough preceptor and clearly cares a lot about helping her students become better writers. I think my writing improved a lot this semester, but I also found the class to be fairly time–consuming.","best_comment_short":"Pat is a very thorough preceptor and clearly cares a lot about helping her students become better writers.","best_comment_first":"If you are not looking for something literary, this section is probably not the best fit, but the class is great for those interested in the subject (being Gothic fiction).","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=dcf15d1b52ec0f7437de72faa8addd88cd67f0f470c2ecff6f5406948c2da13893c4a7bb3dcdc4ad72aebf5dd077fd5f&ReportType=2&regl=en-US"},{"course_code":"TDM 148P","useful_title":"Koteba: Bamana Performative Traditions","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.8075,"best_gem_comment":"","workload_score_mean":2.83,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS! this class is amazing, it's challenging in the beginning but you learn so much. Jeffrey is an amazing teacher and super nice. Definitely don't miss this one","best_comment_short":"Jeffrey is an amazing teacher and super nice.","best_comment_first":"TAKE THIS CLASS!","course_id":"217582","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1063c178ab0a7c02843525074665d0f905495db078fe5272336f40ecd2172e89ffdf558f67a411e577829e49f87b4eb3&ReportType=2&regl=en-US"},{"course_code":"SPANSH 80TS","useful_title":"Translating Boundaries in Spain","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.8292,"best_gem_comment":"","workload_score_mean":3.13,"best_gem_comment_short":"","best_comment":"Take this class! Its a great opportunity to read interesting texts, improve your grammar, and translate.","best_comment_short":"Its a great opportunity to read interesting texts, improve your grammar, and translate.","best_comment_first":"Take this class!","course_id":"216092","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=95b050290daed357320e831be8c57a45495aed41042c716416b118415a9366702ad4d19f505a597da5584aa1eeb45196&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 272","course_score_mean":4.67,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":0.90545,"best_gem_comment":"","workload_score_mean":7.11,"best_gem_comment_short":"","best_comment":"This is a wonderful course. The feedback is thorough and extremely helpful. I never felt lost in the writing process. Because it's a course that's in more of a niche area, the other individuals in the class seem to be very enthusiastic about the topic as well. This made the class so much fun to be in. The homework was never overwhelming, especially if you begin drafting more than a week in advance. it is very helpful to submit a solid draft the first time!","best_comment_short":"Because it's a course that's in more of a niche area, the other individuals in the class seem to be very enthusiastic about the topic as well.","best_comment_first":"This is a wonderful course.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a64fb06712763ba8933f59262ba61493701a676b7675afb31a1713f8b87f6094a80a34c8594da330b3979abad828aa70&ReportType=2&regl=en-US"},{"course_code":"ISLAMCIV 111","useful_title":"Transforming Tradition: Islamic Education in the Modern Muslim World","course_score_mean":4.75,"rec_score_mean":4.88,"gem_score_mean":0.0,"sentiment_score_median":0.75545,"best_gem_comment":"","workload_score_mean":6.13,"best_gem_comment_short":"","best_comment":"I loved this course! Super cool topic and the professor is really knowledgeable. If you're at all interested in education in the Middle East take the course!","best_comment_short":"Super cool topic and the professor is really knowledgeable.","best_comment_first":"I loved this course!","course_id":"219927","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c5b8abb2163f49681db7a9cd9e03eae65ac5e1dc0fd375860132009d1391577a75cbfb134fe7a1c0f283137e0223666e&ReportType=2&regl=en-US"},{"course_code":"ENG-SCI 112","useful_title":"Thermodynamics","course_score_mean":4.4,"rec_score_mean":4.47,"gem_score_mean":0.0,"sentiment_score_median":0.7182,"best_gem_comment":"","workload_score_mean":5.2,"best_gem_comment_short":"","best_comment":"This course is incredibly personal and engaging. I highly recommend taking this class as an introduction to engineering. If you are studying the natural sciences this is a great engineering class to take to learn about technological implementation of natural sciences. Professor Martin is incredibly kind and made the classroom setting very comfortable and fun.You will gain a strong intuition and thermodynamic mentality towards the technological world, but it does not imbue very strong quantitative thermodynamic skills if that is what you are looking for.","best_comment_short":"Professor Martin is incredibly kind and made the classroom setting very comfortable and fun.You will gain a strong intuition and thermodynamic mentality towards the technological world, but it does not imbue very strong quantitative thermodynamic skills if that is what you are looking for.","best_comment_first":"This course is incredibly personal and engaging.","course_id":"160454","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9832aa54020b8d7b20d992d02781d50b6d1a7f5c75a4aab1a93b0308abedfd41b45afcd46adb43dbea9b5f0242944865&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 219","course_score_mean":4.86,"rec_score_mean":4.71,"gem_score_mean":0.0,"sentiment_score_median":0.923,"best_gem_comment":"","workload_score_mean":5.86,"best_gem_comment_short":"","best_comment":"This class, is by far the best course I have taken in my life. I am probably going to be a STEM major, and I did not know what to expect from this Expos course. I came out of the class as a stronger writer and a better thinker. The issues covered in class, especially around what personhood means, is one of the most fascinating topics I have ever encountered in my short academic life. The discussions in class are also particularly relevant today. The work in the class is by no means easy, but it is certainly the best class to take if you want to take your writing to the next level. Ross is one of the most intelligent, but most importantly, thoughtful and kindhearted professors at Harvard. He will make sure that you are successful in this class if you are willing to put effort into your writing.","best_comment_short":"The work in the class is by no means easy, but it is certainly the best class to take if you want to take your writing to the next level.","best_comment_first":"This class, is by far the best course I have taken in my life.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2125d485cd10496385b36444387f861f7577dc81df890bcaecd9f4b21a7181c958090c273769395069a7d8f8442b12ef&ReportType=2&regl=en-US"},{"course_code":"CHNSE 123XB","useful_title":"Intermediate Modern Chinese for Advanced Beginners","course_score_mean":5.0,"rec_score_mean":4.86,"gem_score_mean":0.0,"sentiment_score_median":0.886,"best_gem_comment":"","workload_score_mean":8.88,"best_gem_comment_short":"","best_comment":"Harvard's Chinese department is incredible, and this class further confirms that for me! The teachers make every class so much fun, and the community is amazing as well. You will quickly progress your Chinese speaking, reading, and writing level, and also gain a deeper cultural understanding.","best_comment_short":"The teachers make every class so much fun, and the community is amazing as well.","best_comment_first":"Harvard's Chinese department is incredible, and this class further confirms that for me!","course_id":"143892","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ce46013956b70ae3384bc88b4765ea0d4fa9ebdec160dbd0f5b15457d30f76ed25cd2a90670addea970d6ce768f1f1d8&ReportType=2&regl=en-US"},{"course_code":"GHHP 70","useful_title":"Global Response to Disasters and Refugee Crises","course_score_mean":4.61,"rec_score_mean":4.55,"gem_score_mean":0.0,"sentiment_score_median":0.86565,"best_gem_comment":"","workload_score_mean":3.79,"best_gem_comment_short":"","best_comment":"Best class I've taken at Harvard. You come away from this class much more open–minded about the messiness of humanitarian situations, and also the importance of crisis response––in everything from disaster evaluation and risk assessment to coupling interventions with longer–term development and facilitating collaboration across sectors. This class pushes you to think like a problem–solver and a leader, and throughout offers opportunities for teamwork, feedback, speaking, and learning generally.  Profs. Kayden and VanRooyen will be among the most eloquent and engaging lecturers you'll ever encounter, and the course material and case studies are very informative and thoughtfully compiled. Sections offer opportunities for interactive discussion and review, and the group assignments truly encourage you to collaborate with your team and learn from each other. You emerge from this class more thoughtful, compassionate, and humbled. A wonderful class; could not recommend it highly enough.","best_comment_short":"Sections offer opportunities for interactive discussion and review, and the group assignments truly encourage you to collaborate with your team and learn from each other.","best_comment_first":"Best class I've taken at Harvard.","course_id":"161268","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6e876f85fc3600e909c75b3c10ae32b5c2e9aeafefa1038a249873ac69f7613bfd2be20d2ab2bd039e075deaa00c45e1&ReportType=2&regl=en-US"},{"course_code":"PHYSICS 175","useful_title":"Laser Physics and Modern Optical Physics","course_score_mean":4.57,"rec_score_mean":4.57,"gem_score_mean":0.0,"sentiment_score_median":0.8931,"best_gem_comment":"","workload_score_mean":9.29,"best_gem_comment_short":"","best_comment":"Take this class if you're thinking of using lasers in (physics) research or if you're just interested in laser technologies, and you want to understand the underlying physics. You can also choose to just read Saleh & Teich instead, but I think the class experience is not bad, even though a good number of lectures were not delivered so clearly. There are good homeworks and Markus (professor) and Anant (TF) are incredibly nice and supportive (they even got ice cream for us at the end)!","best_comment_short":"You can also choose to just read Saleh & Teich instead, but I think the class experience is not bad, even though a good number of lectures were not delivered so clearly.","best_comment_first":"Take this class if you're thinking of using lasers in (physics) research or if you're just interested in laser technologies, and you want to understand the underlying physics.","course_id":"121941","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=adba08d8f770113981c485e7ec05ca05fab3f72c48b76d0cfafdc60fe7d91916d7ab99d840127c717889b277de1fc73b&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 226","course_score_mean":4.6,"rec_score_mean":4.8,"gem_score_mean":0.0,"sentiment_score_median":0.88805,"best_gem_comment":"","workload_score_mean":6.0,"best_gem_comment_short":"","best_comment":"Take this expos! Out of the many expos offerings, I've heard complaints about most of them –– this is one of the rare ones that no one complains about. The class isn't amazing –– you're not going to learn anything life–changing (the way the people in some of the engaged scholarship expos classes say they've been changed) or even particularly love the material (don't think you're suddenly going to learn a lot about ancestry, for example) –– but it's a writing class, so it's not even for that. However, the class is definitely very good –– I liked much of the material and rarely felt out of my depth. Prof. Nee is such a kind teacher, and he's always willing to meet with you to help you figure out how to improve your writing. He always gives very clear feedback and doesn't grade super harshly, so you generally know what you need to do to score well. The material was generally very approachable, and Prof. Nee generally spaces out the work so that you don't have to put in too much time until you have to write your essay draft. Above all, make sure to rank this class high on the lottery and hope you get it!","best_comment_short":"Prof. Nee is such a kind teacher, and he's always willing to meet with you to help you figure out how to improve your writing.","best_comment_first":"Take this expos!","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b22e8ce823d91277bce755d48c1be0e866b9103da68bfc08438f9e3f8fad85b621e4fe8201c647edcc47c9a6ada591f2&ReportType=2&regl=en-US"},{"course_code":"MODGRK AB","useful_title":"Elementary Modern Greek","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.89925,"best_gem_comment":"","workload_score_mean":2.86,"best_gem_comment_short":"","best_comment":"If you're unsure about taking a class on Modern Greek because it sounds like it may be a difficult class\/language, don't worry.  Both Modern Greek AA and AB are not stressful classes at all and are often very fun and something I look forward to. Professor Dourou is very kind and makes learning Greek very enjoyable through fun activities. Both classes also don't take up any exorbitant amount of time for homework, and were usually a 2–3hr time commitment per week for me.","best_comment_short":"Professor Dourou is very kind and makes learning Greek very enjoyable through fun activities.","best_comment_first":"If you're unsure about taking a class on Modern Greek because it sounds like it may be a difficult class\/language, don't worry.","course_id":"159841","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d8a8a212ed760937f22b3d6c204813a9e5555fcd92a62395bf655a1687af7cda99919ec24d40cea572e1e0d46ced5420&ReportType=2&regl=en-US"},{"course_code":"SCRB 50","useful_title":"Building a Human Body: From Gene to Cell to Organism","course_score_mean":4.46,"rec_score_mean":4.5,"gem_score_mean":0.0,"sentiment_score_median":0.9191,"best_gem_comment":"","workload_score_mean":6.04,"best_gem_comment_short":"","best_comment":"omg please take this class!!! literally my favorite class that I've taken at harvard so far. the teaching staff might be the most wonderful people at this college and the labs are interesting. there aren't any exams either!! the 4 take home module assessments are pretty difficult, but you get to work with others and the office hours are SO HELPFUL! definitely try to go to as many as you can for the assessments. again the teaching staff are amazing and really make this course so wonderful. again my favorite class I love it so much.","best_comment_short":"again the teaching staff are amazing and really make this course so wonderful.","best_comment_first":"omg please take this class!!!","course_id":"212882","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3a4741c7975690b257debbabf3454891c2990115b542dd7c04596077620d9b1c81024e1fa8c11bde3c2c2cb6af571c5b&ReportType=2&regl=en-US"},{"course_code":"HISTSCI 97","useful_title":"Tutorial - Sophomore Year","course_score_mean":4.3,"rec_score_mean":4.22,"gem_score_mean":0.0,"sentiment_score_median":0.8163,"best_gem_comment":"","workload_score_mean":5.09,"best_gem_comment_short":"","best_comment":"this class is a great opportunity to gain a more enriched understanding of histsci methods and, if you haven't already taken another histsci class, shows you how to take a research interest or curiosity and turn it into a full–fledged project. in addition, through section and through the sharing sessions, you will leave this class with a wonderful community of histsci peers, so don't be afraid to make friends (with other students as well as with professor harrington and the other amazing tfs)!","best_comment_short":"in addition, through section and through the sharing sessions, you will leave this class with a wonderful community of histsci peers, so don't be afraid to make friends (with other students as well as with professor harrington and the other amazing tfs)!","best_comment_first":"this class is a great opportunity to gain a more enriched understanding of histsci methods and, if you haven't already taken another histsci class, shows you how to take a research interest or curiosity and turn it into a full–fledged project.","course_id":"115419","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1c213302bfa1e14e87d0166997abe123468abbdae5fc67928d9cf769ebaf1c8abf42a6c24514e488ad44cda14d183796&ReportType=2&regl=en-US"},{"course_code":"ANTHRO 1826","useful_title":"Medical Anthropology: Advanced Topics","course_score_mean":4.58,"rec_score_mean":4.56,"gem_score_mean":0.0,"sentiment_score_median":0.71505,"best_gem_comment":"","workload_score_mean":7.88,"best_gem_comment_short":"","best_comment":"Please, please take this class. Professor Kleinman is a foundational figure in medical anthropology, and it is such a privilege to learn from him and the other members of the teaching team, who are fantastic. The anecdotes\/kernels of wisdom that Professor Kleinman imparts makes the class feel like an education in life. There aren't many professors left at Harvard who have been around long enough to observe the transformation of American society, higher education, anthropology, and psychiatry. He holds so much wisdom, and I feel so privileged to have been able to learn from him. Additionally, the course readings are fantastic; I never found it burdensome to read a book a week because the books were so fascinating and enjoyable. Michael is the most wonderful TF I've encountered in the social sciences at Harvard.","best_comment_short":"Additionally, the course readings are fantastic; I never found it burdensome to read a book a week because the books were so fascinating and enjoyable.","best_comment_first":"Please, please take this class.","course_id":"160441","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2f5366830299f22a24f3447de153bb6de718ad7be0c152d16444cad37ada314ca888fca6e948e8d1f6ff1a287430c7e1&ReportType=2&regl=en-US"},{"course_code":"ECON 2530B","useful_title":"International Finance","course_score_mean":5.0,"rec_score_mean":4.88,"gem_score_mean":0.0,"sentiment_score_median":0.7845,"best_gem_comment":"","workload_score_mean":6.5,"best_gem_comment_short":"","best_comment":"Prof. Rogoff and Prof. Stein gave us a diverse and engaging perspective on the field and it's very illuminating to hear their insightful comments and insights on the various topics in class. It exposed me to the pioneering research and helped clarified my research interests for my senior thesis. Would highly recommend for undergrads who are interested in a more \"active research in the field\" oriented perspective! Prof. Stein and Prof. Rogoff are also very kind and understanding in providing guidance and flexibility on the term paper.","best_comment_short":"Would highly recommend for undergrads who are interested in a more \"active research in the field\" oriented perspective!","best_comment_first":"Prof. Rogoff and Prof. Stein gave us a diverse and engaging perspective on the field and it's very illuminating to hear their insightful comments and insights on the various topics in class.","course_id":"120439","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=5d1e7e79c0257cbeff984f9ea0cbb4eb3c5fd846577a285dd5cd53013c98a81f2ad3d33ec1f6a64bbd7e6dd5211cce7d&ReportType=2&regl=en-US"},{"course_code":"STAT 171","useful_title":"Introduction to Stochastic Processes","course_score_mean":4.55,"rec_score_mean":4.45,"gem_score_mean":0.0,"sentiment_score_median":0.9208,"best_gem_comment":"","workload_score_mean":7.89,"best_gem_comment_short":"","best_comment":"This is an incredibly interesting course! The material is really beautiful (at times), and if you have the bandwidth for it, you should definitely consider it!I took this as a fifth class (not the biggest mistake but whatever), and didn't really go to lecture. Subha is a wonderful professor and a kind person, but most of the lectures feel like they come straight from the textbook (a notable exception being the ones on Markov Chain Monte Carlo). This isn't really the worst thing – the textbook is wonderful in my opinion – but it makes the value proposition of a 9am lecture not great. Similarly for sections. That being said, I went to CA office hours regularly (shoutout to David and Christine) and found a ton of support and camaraderie in the class.The psets are a good mix too. I personally like the probability side of the class (i.e. Poisson processes, Brownian motion, Ito calculus) far more than the computational side (Markov chains, Metropolis–Hastings, etc.), so I enjoyed the latter half of the class exponentially more than the front half. The first couple psets are quite bashy, and the fourth pset on MCMC is literally all in R (you should be ready to learn R, because you'll be using it liberally), but the rest are generally fine, and often quite elegant.Finally, the exams are hard, and they're a big chunk of your grade. If I had known how hard, I would have seriously considered not taking the class – unlike the psets, which are almost entirely textbook questions, the exams are hard because you have to apply course concepts in ways that were really never explained or described in lecture\/section. If you're not used to that (for ref., lots of people in the course took stat 210 before this or are upperclassmen stats concentrators), the exams will be hard – I'm a potential math concentrator who took three other math\/stat classes, and they definitely were my hardest exams. Even having them be open–book exams was not nearly as much help as you'd think. If you're down to learn the material, don't let the exams discourage you. Just be warned.","best_comment_short":"Subha is a wonderful professor and a kind person, but most of the lectures feel like they come straight from the textbook (a notable exception being the ones on Markov Chain Monte Carlo).","best_comment_first":"This is an incredibly interesting course!","course_id":"113721","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=be8075ec7c79ba14ad635f3255bc0b2f85f5954ec87e50441b3b1f047044599bbf610b5993d93ae6764eba62a44235fe&ReportType=2&regl=en-US"},{"course_code":"MICROBI 201","useful_title":"Molecular Biology of the Bacterial Cell","course_score_mean":4.8,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.8316,"best_gem_comment":"","workload_score_mean":11.0,"best_gem_comment_short":"","best_comment":"If you're joining a bacterial lab or just interested in bacteriology fundamentals, take this course. I really appreciated the dedication and time that the professors put into the course, making it challenging yet do–able, and I felt so much more knowledgeable and confident after having taken this course. I actually ended up loving the class format, since it made me comfortable with talking through experiments and ideas out loud with others. The classroom environment was encouraging, creative, and rigorous. I cannot recommend this course enough and I will really miss taking this course.","best_comment_short":"I really appreciated the dedication and time that the professors put into the course, making it challenging yet do–able, and I felt so much more knowledgeable and confident after having taken this course.","best_comment_first":"If you're joining a bacterial lab or just interested in bacteriology fundamentals, take this course.","course_id":"126271","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6473249616fa661b1951c0b131959e23d8d8ee5dad479e6ad2baf8d0e6357b4b6008b2e1f8ef82eccbabf44d1f611acb&ReportType=2&regl=en-US"},{"course_code":"EXPOS 40","useful_title":"Public Speaking Practicum","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.7964,"best_gem_comment":"","workload_score_mean":2.67,"best_gem_comment_short":"","best_comment":"Zach is literally the best. He brings so much fun, energy, personal anecdotes, jokes to the table and it is such a joy to be around him. It is so clear he wants the best for his students – giving them extensions, giving them helpful feedback, lifting them up. This class was honestly one of the best at Harvard due to the instructor, the workload, and the engagement of the class","best_comment_short":"It is so clear he wants the best for his students – giving them extensions, giving them helpful feedback, lifting them up.","best_comment_first":"Zach is literally the best.","course_id":"125227","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0e4bd131a4bb6079a2777ba172effdb2c0bd280e47fc0dd9f24b2661018b62182a7b614d10369e54e32b0326f6c85df3&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 273","course_score_mean":4.36,"rec_score_mean":4.36,"gem_score_mean":0.0,"sentiment_score_median":0.9492,"best_gem_comment":"","workload_score_mean":6.45,"best_gem_comment_short":"","best_comment":"This course was fun, engaging, and I could not recommend it enough! Jane Austen may not seem relatable or interesting, but I promise there's so much humor and interesting comment that keeps her work relevant to this day. The second unit is focused on movies and the third on any Austen topic you like, so you don't even have to keep working with Austen's books if you don't want to. There's something for everyone, from politics to romance to literature to history (well, maybe not STEM). One of the great aspects of this course is that it actually does what Expos is supposed to do: it teaches you how to write! You will go over the fundamentals of writing a college essay beyond the 5 paragraph structure. Every assignment has a purpose and will help you hone skills in close reading, analysis, and research. If you invest time into the class, you will definitely progress as a writer regardless of your prior writing abilities. Plus, Dr. Napier is an amazing preceptor and truly cares about feedback and your progress in the class. He's funny, smart, engaging, and super accommodating. The seminar was always a fun experience, and you'll get to know all the other students in the classroom. Expos has a scary atmosphere around it, but I think this course is a great way to fulfill that requirement.","best_comment_short":"Plus, Dr. Napier is an amazing preceptor and truly cares about feedback and your progress in the class.","best_comment_first":"This course was fun, engaging, and I could not recommend it enough!","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=048d80bb20918d45c887a842dc1249e9d444b4d5bcf93580ecb71b8927d4fe18d111a606229cef5df62f7161aae605f7&ReportType=2&regl=en-US"},{"course_code":"ECON 985B","useful_title":"Econ 985: Senior Thesis Research","course_score_mean":4.75,"rec_score_mean":4.75,"gem_score_mean":0.0,"sentiment_score_median":0.73355,"best_gem_comment":"","workload_score_mean":15.0,"best_gem_comment_short":"","best_comment":"If you write a thesis, I couldn't recommend taking Kiran's Ec 985 enough! She is brilliant, engaging, and deeply caring.","best_comment_short":"She is brilliant, engaging, and deeply caring.","best_comment_first":"If you write a thesis, I couldn't recommend taking Kiran's Ec 985 enough!","course_id":"148273","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=76d485a0cad786f802682f18850223c4214beb0f10a068501d35dc8ac750da83e7b0cd1ad97341de0889f8968c6b6a8b&ReportType=2&regl=en-US"},{"course_code":"CHNSE BB","useful_title":"Elementary Modern Chinese","course_score_mean":5.0,"rec_score_mean":4.86,"gem_score_mean":0.0,"sentiment_score_median":0.8012,"best_gem_comment":"","workload_score_mean":6.24,"best_gem_comment_short":"","best_comment":"I learned so much Chinese – it's weird to literally gain the ability to communicate in another language. I recognize that that's the point of a language class, but I think this is the first one I've taken that succeeded in this goal. By the end of the class, I'd walk out of section chatting with my classmates still in Chinese. It's crazy. I often bragged to my friends about how my classmates and I can *literally* speak Chinese now, like hear questions and just answer them without needing to manually translate word by word. Anyway, I loved this class, actually looked forward to it and felt energized after. It is a lot of work, but very worth it to me.","best_comment_short":"Anyway, I loved this class, actually looked forward to it and felt energized after.","best_comment_first":"I learned so much Chinese – it's weird to literally gain the ability to communicate in another language.","course_id":"124237","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d9bd1994578d5ee5de78f553b21b43836cefcae1450c25dafc3b22ccba91527e381af79f5c2385d87ff6fcbf48cc033c&ReportType=2&regl=en-US"},{"course_code":"CPB 99B","useful_title":"Laboratory Research for Honors Thesis","course_score_mean":4.8,"rec_score_mean":4.4,"gem_score_mean":0.0,"sentiment_score_median":0.69,"best_gem_comment":"","workload_score_mean":15.2,"best_gem_comment_short":"","best_comment":"This course is a great opportunity to conduct and write about an independent research project, however, go into it with a good idea about what you are going to write and get as much feedback from professors\/mentors as possible, and as early as possible.","best_comment_short":"This course is a great opportunity to conduct and write about an independent research project, however, go into it with a good idea about what you are going to write and get as much feedback from professors\/mentors as possible, and as early as possible.","best_comment_first":"This course is a great opportunity to conduct and write about an independent research project, however, go into it with a good idea about what you are going to write and get as much feedback from professors\/mentors as possible, and as early as possible.","course_id":"159732","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3cd55c3da45cf941e095c73438c50026c26cc7cb08dc7888b77e1ed5cc45d49cfbdd0e6caa7de3f7519fbfb581b22c9c&ReportType=2&regl=en-US"},{"course_code":"CHNSE 120B","useful_title":"Intermediate Modern Chinese","course_score_mean":4.89,"rec_score_mean":4.89,"gem_score_mean":0.0,"sentiment_score_median":0.84795,"best_gem_comment":"","workload_score_mean":5.67,"best_gem_comment_short":"","best_comment":"The Chinese language program at Harvard is excellent; teachers are very nice and constantly give helpful feedback, assignments are relevant to class material, and quizzes and exams are truly testing concepts learned in class and not unnecessarily difficult.","best_comment_short":"The Chinese language program at Harvard is excellent; teachers are very nice and constantly give helpful feedback, assignments are relevant to class material, and quizzes and exams are truly testing concepts learned in class and not unnecessarily difficult.","best_comment_first":"The Chinese language program at Harvard is excellent; teachers are very nice and constantly give helpful feedback, assignments are relevant to class material, and quizzes and exams are truly testing concepts learned in class and not unnecessarily difficult.","course_id":"110940","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8bb6085e379d4f6f5bb66863070744a6c620685794f17036e0987855a9e1ca1dae73aaf73bbcd44ba475b1a6d2511dfd&ReportType=2&regl=en-US"},{"course_code":"MATH 55B","useful_title":"Studies in Real and Complex analysis","course_score_mean":4.63,"rec_score_mean":4.46,"gem_score_mean":0.0,"sentiment_score_median":0.9155,"best_gem_comment":"","workload_score_mean":17.76,"best_gem_comment_short":"","best_comment":"Math 55B was a very interesting course. First of all, Prof. Auroux is wonderful. He's incredibly accessible and cares about making sure people are doing well. He is going to be in France next year, but I'm sure whoever is teaching 55 in 2022–2023 will be great! The material is really beautiful (although you can certainly have more of a taste for certain things than others), and it feels ever–so–slightly more chill than 55A.The material is honestly quite interesting. Topology – and especially algebraic topology – is a fundamental discipline to basically anything, and Auroux's presentation of complex analysis is very good for getting you to appreciate just how beautiful of a subject it is. Full disclosure, I am not the biggest analysis fan – I liked alg top far more – and I didn't have any experience with real analysis. Yet, often during the two weeks we talked about real analysis, there was a general sentiment of \"yeah this is all stuff we should know.\" The point being: this class is technically an introduction to all these fields, but unless you're ready and willing to make it the center of your spring semester, it won't be a very comfortable introduction.The psets were also generally fun. There were some questions that definitely should have been marked as challenge problems that were simply not, but beyond that they were good. Do start psets early, or at least look at them early – it takes time for things to sit and be mulled over in your head! The exams can be a big source of stress, but I think they were generally easier than in 55A – analysis at this level is often \"done on autopilot,\" in that there's only so many tricks you can try before something ends up working. Overall, try to stay on top of the material – it is much harder than you expect to catch up if you fall behind, speaking from experience.On the other hand, the class environment in 55B is... less than stellar. Your best hope is to find a good group of people to pset with that aren't magnets for drama, but in my case, there was so much drama going on that I didn't go to lecture for a very long time. 55 attracts a very specific kind of person – generally, people who enjoy suffering, or enjoy watching other suffer around them, and people who, as mathematicians, haven't quite mellowed out from the cutthroat, competitive, and prestige–centric attitude that high school math things breed. If I could have taken the class entirely remotely, I probably would have.So, should you take 55B? First, I don't think 55A is a strict prerequisite, but definitely a soft one – the familiarity with group theory is essential for alg top. And as my experience goes, I think there's basically no barrier to entry, save for how much time you're ready to put into it. If you want math to be the center of your spring semester, then go for it. If not, then take 25B or 22B, or whatever is best for you (you'll quickly realize that if prestige is what you're shooting for, your mental and physical wellbeing are high costs to pay for it). In any case, good luck with your decision and whatever you choose to do!","best_comment_short":"The material is really beautiful (although you can certainly have more of a taste for certain things than others), and it feels ever–so–slightly more chill than 55A.The material is honestly quite interesting.","best_comment_first":"Math 55B was a very interesting course.","course_id":"112871","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1af56bc14b1ced2eb0a233db1f648addea9bbe054e39d544db23c3b375ace0acf27ef9d46b1d84a94f9180f2dd3e0854&ReportType=2&regl=en-US"},{"course_code":"EXPOS 40","useful_title":"Public Speaking Practicum","course_score_mean":4.7,"rec_score_mean":4.8,"gem_score_mean":0.0,"sentiment_score_median":0.9244,"best_gem_comment":"","workload_score_mean":3.8,"best_gem_comment_short":"","best_comment":"Your experience is very dependent on who your section leader is. In my case, my section spent the first month of the semester doing a lot of readings \/ TED talk reflections, and small verbal exercises and games in class – neither of which felt applicable to actually improving public speaking skills, and also may have prevented our class from growing comfortable with each other and bonding earlier.  (Based on what I've heard, other sections did a lot more impromptu speaking \/ speaking games early in the semester.) That being said, the actual experience of preparing and giving speeches was fantastic and well–supported throughout, and feedback from peers and from the instructor was invaluable. I had a very good experience overall and grew much more confident not only as a public speaker but as a speech writer, where I felt the most significant improvement was made.","best_comment_short":"I had a very good experience overall and grew much more confident not only as a public speaker but as a speech writer, where I felt the most significant improvement was made.","best_comment_first":"Your experience is very dependent on who your section leader is.","course_id":"125227","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=bb704cf02970e455ec6c2e4f95f4d5d0cfdcc9f3ffbde11a1c3c4bf86f852c69aace575a96b7dd022f2ad3914f058ecf&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 224","course_score_mean":4.92,"rec_score_mean":4.83,"gem_score_mean":0.0,"sentiment_score_median":0.8219,"best_gem_comment":"","workload_score_mean":5.33,"best_gem_comment_short":"","best_comment":"This is probably one of the best expos classes out there. Dr. Miller is really helpful and is always there to answer any questions. However, there were times when students would ask questions  in section about papers, and her answers wouldn't be clear enough. I think that maybe it was her way of allowing us to approach the papers\/topics in our own way.  Her feedback on drafts is super useful, so I would recommend putting in effort into your drafts. This way, revising will be much easier\/approachable.","best_comment_short":"Her feedback on drafts is super useful, so I would recommend putting in effort into your drafts.","best_comment_first":"This is probably one of the best expos classes out there.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=47ec906751fbb3fe5903fdf1245d389eec0b1c868fee6d3384db76840f0b8e6ae913b3d5fcf2f2d21985669e53ead9b1&ReportType=2&regl=en-US"},{"course_code":"MATH 25B","useful_title":"Theoretical Linear Algebra and Real Analysis II","course_score_mean":4.62,"rec_score_mean":4.54,"gem_score_mean":0.0,"sentiment_score_median":0.9158,"best_gem_comment":"","workload_score_mean":15.69,"best_gem_comment_short":"","best_comment":"Math 25b with Wes is a wonderful class. The material is so insanely well taught. Wes's strength is in analysis so he motivates examples and provides intuition really well. The lectures are very good, and he answers all questions during the lectures. However, this results in the fact that most classes end around five minutes over time, and additional videos may be posted if the material isn't completely covered. Also, this class was a 9AM three times a week (with no recordings), so just make sure you're prepared for this. The community is really great, and many students in this class actually did not come from a high school math background but were more so interested in fields that require knowledge of real analysis. Because of this, a collaborative environment was fostered. I think it's really important to find people to pset with, if not the most important. Definitely definitely attend Wes's office hours. He is an amazing professor but also such a kind person, and it's very nice to get to know him! He can also clarify gaps in your knowledge about lecture material. For psets, I think it's more helpful to go to the CAs office hours since you can collaborate with students, but Wes gives great intuition behind how to solve the problems. This class is extremely rewarding, in my opinion, if you put in the time. Because the psets are not graded harshly, it felt that a lot of my energy was spent truly learning the material instead of perfecting pset solutions like in some other classes. Overall, this class is tough but rewarding. Make sure you're interested in this class for some reason, make sure you allocate enough time for the class and think about what you want to gain from this class before taking it!","best_comment_short":"He is an amazing professor but also such a kind person, and it's very nice to get to know him!","best_comment_first":"Math 25b with Wes is a wonderful class.","course_id":"110855","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=12151526ef9fe0b1e774d74a8a42122fd45895342ca817c6996bef5e964ff3d1b3b339f56cd794385da75c6b8038c5cb&ReportType=2&regl=en-US"},{"course_code":"HIST 99B","useful_title":"Senior Thesis Tutorial","course_score_mean":4.38,"rec_score_mean":4.53,"gem_score_mean":0.0,"sentiment_score_median":0.8126,"best_gem_comment":"","workload_score_mean":12.0,"best_gem_comment_short":"","best_comment":"The thesis process was the highlight of my college career. It was the most difficult, most rewarding, and most transformative experience in my time as an undergraduate. Having a clear idea of your topic or argument at the outset is unimportant; rather, desire to think critically and become expertly acquainted with some general area of interest are the only requisites. If you keep these in mind, you will not regret writing the thesis. The seminar is extremely supportive and useful as you progress, and the instructors will answer any and all questions. The History Department puts its full weight behind your enterprise, including providing resources and flexibility to focus on the thesis, in order to ensure your success. I would highly recommend this class to any student that feels serious about some academic interest and wishes to experience the full rigor and richness of academia.","best_comment_short":"I would highly recommend this class to any student that feels serious about some academic interest and wishes to experience the full rigor and richness of academia.","best_comment_first":"The thesis process was the highlight of my college career.","course_id":"159975","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e6885b86ec95635777f8fc5637c966c1da5c4d0193856a3bc738af6cf4e92ae1353b826f3acd3b37d500a89bc5a31b74&ReportType=2&regl=en-US"},{"course_code":"ECON 970","useful_title":"Tutorial - Sophomore Year","course_score_mean":4.63,"rec_score_mean":4.63,"gem_score_mean":0.0,"sentiment_score_median":0.8707,"best_gem_comment":"","workload_score_mean":11.38,"best_gem_comment_short":"","best_comment":"This economics tutorial is phenomenal and is a gem within the sophomore tutorial selections. There are a lot of readings and writing assignments, but such is the case with most other tutorials. If you are on the fence about the law, or just want to take a class to learn a lot about economics and the law, I would highly recommend this class. Every reading was selected with care for the content. Professor Felter provides ample feedback to help you improve as a writer and critical thinker. The discussions every week were interesting. You do not need to be pre–law to take this class, and in my experience, most of the people were on the fence about the law. Professor Felter is an amazing professor, and if you take this class, you will leave the class knowing comprehensively what economics is and what the law is, and what an economic analysis of the law entails.","best_comment_short":"Professor Felter is an amazing professor, and if you take this class, you will leave the class knowing comprehensively what economics is and what the law is, and what an economic analysis of the law entails.","best_comment_first":"This economics tutorial is phenomenal and is a gem within the sophomore tutorial selections.","course_id":"122752","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e7772a11c65b6d29ba74131486beacb3480655dbd625052a92cf63dbfd5b6741a723d107cc0bc68aa1126d053389c831&ReportType=2&regl=en-US"},{"course_code":"LING 73B","useful_title":"Beginning American Sign Language II","course_score_mean":4.22,"rec_score_mean":4.75,"gem_score_mean":0.0,"sentiment_score_median":0.8436,"best_gem_comment":"","workload_score_mean":3.0,"best_gem_comment_short":"","best_comment":"I loved learning ASL with Anbo. I enjoy it much more than the other foreign language classes I have taken and feel I have gained a lot by learning some ASL.","best_comment_short":"I enjoy it much more than the other foreign language classes I have taken and feel I have gained a lot by learning some ASL.","best_comment_first":"I loved learning ASL with Anbo.","course_id":"203513","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ffe917e45a0d5e98ce5fac40c55865c9946d87340c6af6a953a29f63d8e0371f84b70e612f33b444d73c75f78d50ea14&ReportType=2&regl=en-US"},{"course_code":"GENED 1100","useful_title":"The Two Koreas in the Modern World","course_score_mean":4.73,"rec_score_mean":4.73,"gem_score_mean":0.0,"sentiment_score_median":0.9166,"best_gem_comment":"","workload_score_mean":5.48,"best_gem_comment_short":"","best_comment":"First and foremost, if you are thinking about taking this course, you MUST have a strong interest in Korean history. This is not a class about K–pop or modern Korea, this is fundamentally a Korean history class. As with any history course, this class can be very dry at times, even for a student who is enamored by Korean history. Only a super strong love and appreciation for the class material will get you through the dry periods without hating the course and its busy–work assignments. So, if you have a strong interest in Korean history, then I cannot recommend this class enough. The course is fantastic. The readings are informative and thoughtful, the movies are good to watch, Professor Eckert is a decently good lecturer, and Sungik (the TF) was phenomenal. This class completely changed the way I understand Korean politics and Korean culture, and it changed the way I understand the history of East Asia and the legacy of that history in the region today. As a Korean–American, the class also changed the way I understand my family and the struggles my family went through during the 20th century. It was really an amazing history course. My only critique is that a lot of the assignments felt like busy work, but hopefully they cut down on this in future years.","best_comment_short":"Only a super strong love and appreciation for the class material will get you through the dry periods without hating the course and its busy–work assignments.","best_comment_first":"First and foremost, if you are thinking about taking this course, you MUST have a strong interest in Korean history.","course_id":"116999","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=240fd08f91eec7e56580a27a18fd066650b6ac15465828da4b7270333118c1d734df0e57785e1c9c57696904beb05ca3&ReportType=2&regl=en-US"},{"course_code":"CHNSE BB","useful_title":"Elementary Modern Chinese","course_score_mean":4.13,"rec_score_mean":4.38,"gem_score_mean":0.0,"sentiment_score_median":0.92855,"best_gem_comment":"","workload_score_mean":7.5,"best_gem_comment_short":"","best_comment":"IF YOU TOOK BA, TAKE THIS CLASS! I know it can seem a bit intimidating, but there is truly nothing to lose. Every single one of the instructors are incredible, your Chinese will continue to improve dramatically if you put the work in, and class is just really fun! You'll see the benefit to every assignment you do, from homework to dictations – there's no busy work, everything contributes to improving your overall Chinese fluency.  The teachers are the best part: they're amazing in every way.","best_comment_short":"The teachers are the best part: they're amazing in every way.","best_comment_first":"IF YOU TOOK BA, TAKE THIS CLASS!","course_id":"124237","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f6405303a39f65da8b9f9f87ad31267a7c88c943d5ccc5ab038082004a9e501f2714a2de97512e0d396cefc3eef8e17c&ReportType=2&regl=en-US"},{"course_code":"EMR 1020","useful_title":"Topics in Asian American and Pacific Islander (AAPI) Studies","course_score_mean":4.78,"rec_score_mean":4.78,"gem_score_mean":0.0,"sentiment_score_median":0.8905,"best_gem_comment":"","workload_score_mean":4.12,"best_gem_comment_short":"","best_comment":"If Eleanor is teaching this, and you are interested in AAPI studies (or even the vague idea of what that means), you should definitely take this course!The readings are really interesting, the discussions are vibrant, and Eleanor makes a point out of this class not being yet another stressor in our lives. It's very clear how much everyone cares about the material and I think it leads to some beautiful conversations. Moreover, even though I'm not an EMR (or EMR adjacent) concentrator (although I can't say I'm not slightly swayed), I think I learned far more about myself in this class than I have in all my years of middle and high school.  It's a wonderful platform to try and unpack your own experiences, if that's your thing, and it's quite cathartic in that regard!Finally, although I come from a STEM background, I never felt alienated by the class for it. There's lots of people here who had very different backgrounds, opinions, and worldviews, but it was very respectful and encouraging. (For those of you who took the course this year, thanks a lot for that!) If you take this class, I guarantee that you will find interesting things to contribute, and that they'll be things your peers will be glad to get to ponder!","best_comment_short":"There's lots of people here who had very different backgrounds, opinions, and worldviews, but it was very respectful and encouraging.","best_comment_first":"If Eleanor is teaching this, and you are interested in AAPI studies (or even the vague idea of what that means), you should definitely take this course!The readings are really interesting, the discussions are vibrant, and Eleanor makes a point out of this class not being yet another stressor in our lives.","course_id":"218825","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=13fc51fa595e505138ca159b3b0ca9ae712639d14b39fe23e3b41e07dee87b7446e2d15c43a0c4ccc1acc16e86a73a8a&ReportType=2&regl=en-US"},{"course_code":"ANTHRO 1802","useful_title":"Language, Race, and Ethnicity","course_score_mean":4.6,"rec_score_mean":4.6,"gem_score_mean":0.0,"sentiment_score_median":0.79005,"best_gem_comment":"","workload_score_mean":3.8,"best_gem_comment_short":"","best_comment":"The course readings were super interesting, and I loved having some of the authors come as guest speakers. However, this felt more like a lecture than a seminar, which is what I was expecting. While I appreciate that Dr. Garza didn't assume any prior knowledge, it felt like that held us back from really engaging with the texts together.","best_comment_short":"The course readings were super interesting, and I loved having some of the authors come as guest speakers.","best_comment_first":"The course readings were super interesting, and I loved having some of the authors come as guest speakers.","course_id":"219705","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b763cccd0f69e47d55c667c7c604e146ea55ef11b2d88e9eb1d506ccce2cc1b69784bc0c2f1167f450797f19a5710f80&ReportType=2&regl=en-US"},{"course_code":"ENG-SCI 94","useful_title":"Entrepreneurship and Innovation: Practical and Academic Insights","course_score_mean":4.67,"rec_score_mean":4.68,"gem_score_mean":0.0,"sentiment_score_median":0.72905,"best_gem_comment":"","workload_score_mean":4.05,"best_gem_comment_short":"","best_comment":"Take this class! This is one of the best courses that I have taken at Harvard by far. Lerner is such an engaging professors and will make you feel motivated. The cases are super interesting and honestly do not feel like work. The TFs are super experienced and it's very cool to be able to talk to an HBS student regularly. I think that even if you don't like entrepreneurship too much, you would still find this class interesting.","best_comment_short":"The cases are super interesting and honestly do not feel like work.","best_comment_first":"Take this class!","course_id":"217639","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=df09c5d1f1648048d98c13fa89ca65ae7a19099936ca792818e8d98e364779648210b700803a019390a2920f2da5163f&ReportType=2&regl=en-US"},{"course_code":"MATH 243","useful_title":"Evolutionary Dynamics","course_score_mean":4.43,"rec_score_mean":4.52,"gem_score_mean":0.0,"sentiment_score_median":0.8031,"best_gem_comment":"","workload_score_mean":3.05,"best_gem_comment_short":"","best_comment":"This is a great course to take! Don't be scared of the high course number –– it is quite friendly for varying levels of math prowess. Depending on what you want to do for your final project, some subset of probability and statistics, programming (ability to run computer simulations and code up algorithms), and techniques for mathematical proofs\/analytical derivations is helpful to know. This is definitely a course where what you put into it is what you get out of it.","best_comment_short":"Don't be scared of the high course number –– it is quite friendly for varying levels of math prowess.","best_comment_first":"This is a great course to take!","course_id":"119511","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b6fd4219cdd369d585479bb402f975fda41406027dd24c79eb757417095448233f8e3ea21046225cebafdd1f5dc32903&ReportType=2&regl=en-US"},{"course_code":"GOV 94EM","useful_title":"Crime, responsibility, and the law","course_score_mean":4.91,"rec_score_mean":4.91,"gem_score_mean":0.0,"sentiment_score_median":0.87565,"best_gem_comment":"","workload_score_mean":4.91,"best_gem_comment_short":"","best_comment":"Great class if you like to discuss and think deeply about issues of rights, tradeoffs, law, and design of government and legal systems. Really good stuff, Gabe makes it worth soldiering through some dense readings that are really interesting once you understand them","best_comment_short":"Great class if you like to discuss and think deeply about issues of rights, tradeoffs, law, and design of government and legal systems.","best_comment_first":"Great class if you like to discuss and think deeply about issues of rights, tradeoffs, law, and design of government and legal systems.","course_id":"213657","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7af86eff4bd7b28b09f340c111d97f5c849d1a808b3b447e348c98db3f0852fbed3c25f038d206676fad75a5e02408b1&ReportType=2&regl=en-US"},{"course_code":"GOV 62","useful_title":"Research Design, Qualitative, and Mixed Methods","course_score_mean":4.45,"rec_score_mean":4.44,"gem_score_mean":0.0,"sentiment_score_median":0.76085,"best_gem_comment":"","workload_score_mean":7.27,"best_gem_comment_short":"","best_comment":"If you are considering writing a thesis, you MUST take this class. It is a great course with a very engaged teaching staff that has endless knowledge to pass on about your projects. At times, this class can be stressful but all the work that you're doing is working towards your own thesis project so it feels meaningful. I cannot imagine going into my senior thesis without having the experience of this class. They break down the process for you and make an extremely stressful and elusive thing, like a thesis, more understandable and possible. Professor Hagopian is a sweetheart and tries to get to know and help all her students with their individual topics. She is available to talk to you and can point you in the direction of more information. If you are lucky enough to get Aaron as a tf, you will have a great support system throughout the semester. He is also incredibly helpful and made the class a great time.","best_comment_short":"If you are lucky enough to get Aaron as a tf, you will have a great support system throughout the semester.","best_comment_first":"If you are considering writing a thesis, you MUST take this class.","course_id":"108287","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c9a8924ffd9616efbd35b7e0ea7591d1f113fdadc80045bc1e7856b9b6fe70c16faca319e347a8200cd829776967e27a&ReportType=2&regl=en-US"},{"course_code":"ASTRON 5","useful_title":"Astrosociology","course_score_mean":4.31,"rec_score_mean":4.63,"gem_score_mean":0.0,"sentiment_score_median":0.792,"best_gem_comment":"","workload_score_mean":2.32,"best_gem_comment_short":"","best_comment":"I would highly recommend this class! It's a great one to take to fulfill your science distribution requirement or for anyone just remotely interested and who wants a lighter workload! This class is the perfect balance of both an interesting topic AND a light workload. You will feel like you really get something out of the class, without having to go crazy. The assignments are how they should be –– thought–provoking, requiring effort, but never too much. The entire teaching team is so kind and supportive. They truly care about the topic and they make everyone else care! I also love the way the course is taught in a more interactive format –– picture simulations and debates instead of a ton of lecturing! There is a really good balance of different formats so that you never get bored. And sections are built in during class time which is AMAZING – a true time saver.","best_comment_short":"It's a great one to take to fulfill your science distribution requirement or for anyone just remotely interested and who wants a lighter workload!","best_comment_first":"I would highly recommend this class!","course_id":"205519","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c64c333f6c7c4efb7150020f06bfe49cd3b99484607b2dcde1726775ecaec69fa77c12e6a1e28f558cb9026541d322a5&ReportType=2&regl=en-US"},{"course_code":"E-PSCI 133","useful_title":"Atmospheric Chemistry","course_score_mean":4.8,"rec_score_mean":4.7,"gem_score_mean":0.0,"sentiment_score_median":0.8645,"best_gem_comment":"","workload_score_mean":5.6,"best_gem_comment_short":"","best_comment":"Take this class! It was super interesting to learn about the atmosphere and the scientific basis of climate change and air pollution. I feel like I walked away with much deeper understanding of atmospheric chemistry. Daniel is one of the leaders in his field and it was so cool to get to learn from him. He is a very engaging and knowledgable professor. Ellie and Nadia were also great TFs and were very helpful with answering pset questions. The psets were not too long and generally the work load in this class was very manageable.","best_comment_short":"Ellie and Nadia were also great TFs and were very helpful with answering pset questions.","best_comment_first":"Take this class!","course_id":"122093","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7eb58022e2aed2def67ccc431edf70e085db58dab280c533350a2f19839d15d0d713af784a403d4f0e58324c20276018&ReportType=2&regl=en-US"},{"course_code":"PSY 1322","useful_title":"Decisions Big and Small: The Cognitive Science of Making Up Your Mind","course_score_mean":4.74,"rec_score_mean":4.74,"gem_score_mean":0.0,"sentiment_score_median":0.877,"best_gem_comment":"","workload_score_mean":3.48,"best_gem_comment_short":"","best_comment":"This class is really great! You makes countless decisions in your everyday life, and this class will give you the frameworks and models necessary to understand those decisions better. Prof. Ullman is an extremely great lecturer who truly cares about his students and every lecture keeps you on your toes. The class is not much work (~2 hours a week) and I really enjoyed this class and would highly recommend.","best_comment_short":"Prof. Ullman is an extremely great lecturer who truly cares about his students and every lecture keeps you on your toes.","best_comment_first":"This class is really great!","course_id":"212749","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0c13ee0f85c81f1eee2b38d8aa987d64f9e5a5681b8742cbaf114a82e248749785684486854202e04defd526da4ce6f2&ReportType=2&regl=en-US"},{"course_code":"ENG-SCI 292B","useful_title":"Launch Lab\/Capstone 2","course_score_mean":4.44,"rec_score_mean":4.65,"gem_score_mean":0.0,"sentiment_score_median":0.7102,"best_gem_comment":"","workload_score_mean":4.82,"best_gem_comment_short":"","best_comment":"Amazing class, take it! Be adventurous, try anything. Best time to take risks.","best_comment_short":"Amazing class, take it!","best_comment_first":"Amazing class, take it!","course_id":"214580","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1bb3d473686b8fe5d95d656202946fab6fe24231b969521f8b62bc462f2cf2c283f9ecc6f61f63de1bff3a8e54b7a7d5&ReportType=2&regl=en-US"},{"course_code":"SANSKRIT 101B","useful_title":"Elementary Sanskrit","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.8182,"best_gem_comment":"","workload_score_mean":8.43,"best_gem_comment_short":"","best_comment":"Sanskrit 101B does an amazing job building off the concepts from 101A. At the end of the class you look back and go \"woah!\" The amount of hard and soft concepts I learned in Sanskrit  was honestly very impressive. I could never imagine that I could go from not knowing a single bit of Sanskrit or Devanagari (the script) to reading and comprehending passages\/short stories and writing my very own story\/poem! Definitely take Sanskrit! As always, Nell did an amazing job this semester, and could not imagine the class being taught without her. Her expertise, enthusiasm, and flexibility made the class such an enjoyable time.","best_comment_short":"Her expertise, enthusiasm, and flexibility made the class such an enjoyable time.","best_comment_first":"Sanskrit 101B does an amazing job building off the concepts from 101A.","course_id":"119882","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=9f9600a1ec521c60dd2a83ca9e54d4f88d67c246bf6ba585c99007218584368a4a16cab587b2fc20a4073bb4f023a7c5&ReportType=2&regl=en-US"},{"course_code":"SOCIOL 1144","useful_title":"Economic Sociology","course_score_mean":4.63,"rec_score_mean":4.58,"gem_score_mean":0.0,"sentiment_score_median":0.72695,"best_gem_comment":"","workload_score_mean":3.89,"best_gem_comment_short":"","best_comment":"This class is absolutely incredible: it will challenge you, it will keep you thinking, and it will ease you into economics and sociology in a meaningful way. At the helm is someone who cares about your well–being, is incredibly understanding, and illustrates concepts in some of the most inventive ways I have ever experienced. Dr. Leah's classroom presence is unmatched, and it was a joy to experience her course in person because she is full of this contagious energy and passion. The course is an opportunity to grow and be exposed to some very timely discussions: about corruption, competition, brokers, and the functionality of networks. I took just as much away from this course conceptually as I did practically, and I loved every moment of it!","best_comment_short":"Dr. Leah's classroom presence is unmatched, and it was a joy to experience her course in person because she is full of this contagious energy and passion.","best_comment_first":"This class is absolutely incredible: it will challenge you, it will keep you thinking, and it will ease you into economics and sociology in a meaningful way.","course_id":"204172","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2cb12720bfaf577dc29b66215c0ee2617784256b4dbba2e1a9b3b971e8a52bab534f959ec4753e990f9e3c0b90259e16&ReportType=2&regl=en-US"},{"course_code":"FRSEMR 71M","useful_title":"Global Capitalism: Past, Present, Future","course_score_mean":4.92,"rec_score_mean":4.92,"gem_score_mean":0.0,"sentiment_score_median":0.923,"best_gem_comment":"","workload_score_mean":2.42,"best_gem_comment_short":"","best_comment":"This course was LIFECHANGING! Professor Reinert is the absolute best; he engages everyone in the class and is a phenomenal professor overall. The HBS cases were all so different but equally interesting; I learnt a ton! Take this class even if you don’t have an interest in pursuing an economics concentration; it will be the best decision you ever make!","best_comment_short":"Take this class even if you don’t have an interest in pursuing an economics concentration; it will be the best decision you ever make!","best_comment_first":"This course was LIFECHANGING!","course_id":"207817","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=22ce9a4970c104dce9069e92a2245a75715150d5b2b9a686acaafc8630546160c60226596b546531942a69c1af72eb07&ReportType=2&regl=en-US"},{"course_code":"RUSS AB","useful_title":"Elementary Russian II","course_score_mean":4.71,"rec_score_mean":4.71,"gem_score_mean":0.0,"sentiment_score_median":0.6597,"best_gem_comment":"","workload_score_mean":7.14,"best_gem_comment_short":"","best_comment":"This is a great class and I recommend anyone interested in Russian to take it. You will learn so much in a short amount of time, and the Russian language department is very supportive of all the students. I really appreciated the tight–knit section group and we had a lot of fun in class.","best_comment_short":"This is a great class and I recommend anyone interested in Russian to take it.","best_comment_first":"This is a great class and I recommend anyone interested in Russian to take it.","course_id":"159620","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=91223528f5fae081681bafe3220300d46763e1ba2bfa459035a83bae40fa3dd131d712dfe4d61f516d5d8f3790e2dc5c&ReportType=2&regl=en-US"},{"course_code":"ANTHRO 1475","useful_title":"Religious Dimensions in Human Experience: Apocalypse, Sports, Music, Home, Sacrifice, Medicine","course_score_mean":4.33,"rec_score_mean":4.52,"gem_score_mean":0.0,"sentiment_score_median":0.891,"best_gem_comment":"","workload_score_mean":3.65,"best_gem_comment_short":"","best_comment":"This course is perfect for people curious about how religion works in life and society. The readings are very interesting, but long. I struggled to finish them, but skimmed the best I could. Even so, I was still able to contribute what I knew and make connections. Work hard on the midterm! Pedro is a great resource for making sure that your understanding of course concepts is accurate. I enjoyed doing my creative project and would highly recommend that instead of the final since I was able to talk about the course topics that were most interesting to me, the ones that I paid the most attention to over the semester.","best_comment_short":"I enjoyed doing my creative project and would highly recommend that instead of the final since I was able to talk about the course topics that were most interesting to me, the ones that I paid the most attention to over the semester.","best_comment_first":"This course is perfect for people curious about how religion works in life and society.","course_id":"219708","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e58dcd3ccb26d19f5f8c7e6b184cc54a0219ec648baf951850bcfcfac53005531c6cc6661a3cc9bb4382432181886e98&ReportType=2&regl=en-US"},{"course_code":"RELIGION 16","useful_title":"Religious Dimensions in Human Experience","course_score_mean":4.33,"rec_score_mean":4.52,"gem_score_mean":0.0,"sentiment_score_median":0.891,"best_gem_comment":"","workload_score_mean":3.65,"best_gem_comment_short":"","best_comment":"This course is perfect for people curious about how religion works in life and society. The readings are very interesting, but long. I struggled to finish them, but skimmed the best I could. Even so, I was still able to contribute what I knew and make connections. Work hard on the midterm! Pedro is a great resource for making sure that your understanding of course concepts is accurate. I enjoyed doing my creative project and would highly recommend that instead of the final since I was able to talk about the course topics that were most interesting to me, the ones that I paid the most attention to over the semester.","best_comment_short":"I enjoyed doing my creative project and would highly recommend that instead of the final since I was able to talk about the course topics that were most interesting to me, the ones that I paid the most attention to over the semester.","best_comment_first":"This course is perfect for people curious about how religion works in life and society.","course_id":"116585","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e58dcd3ccb26d19f5f8c7e6b184cc54a0219ec648baf951850bcfcfac53005531c6cc6661a3cc9bb4382432181886e98&ReportType=2&regl=en-US"},{"course_code":"MATH QB","useful_title":"Quantitative Analysis for Economics and the Social Sciences II","course_score_mean":4.9,"rec_score_mean":4.8,"gem_score_mean":0.0,"sentiment_score_median":0.86385,"best_gem_comment":"","workload_score_mean":5.4,"best_gem_comment_short":"","best_comment":"This is a fantastic course to take, and I highly recommend this course if you are looking for an introductory mathematics course. The course can be challenging, but there is plenty of support available and willing to help you through any difficulties you encounter. One of the course's advantages is that it blends mathematics with real–world situations like climate change and planning for retirement, into activities and projects that are both engaging and informative. I am very glad I took this course!","best_comment_short":"One of the course's advantages is that it blends mathematics with real–world situations like climate change and planning for retirement, into activities and projects that are both engaging and informative.","best_comment_first":"This is a fantastic course to take, and I highly recommend this course if you are looking for an introductory mathematics course.","course_id":"218230","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0d79252c578a96034d9890dd8123dae8b73079664597b31401ba844b8c67aa26a1198c51ce1cabd361003cbe61731759&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 245","course_score_mean":4.42,"rec_score_mean":4.73,"gem_score_mean":0.0,"sentiment_score_median":0.88135,"best_gem_comment":"","workload_score_mean":7.36,"best_gem_comment_short":"","best_comment":"This class is great if you have no writing experience and want to learn how to make your essays crystal clear and easy to communicate. If you already have your own preferred style of writing, it might be a bit difficult to adjust to the expectations that Julia has. That being said, she does make it clear that she does not grade based on the style of the essay, but rather how effective it is in communicating across the point of the essay. Julia is a great preceptor that puts in a lot of effort to help her students succeed and to answer their questions. At the same time, I get the feeling that she tends to reciprocate the amount of effort that you put in. In other words, if you don't put in effort into your work, she won't put in effort into helping you as well, which is completely fair.  For me at least, I came in with a very rigid writing style, and I had to put in a lot of effort to ensure my essays matched her expectations. But I would say it was quite worth it in the end, for I came out of the class having improved my writing style greatly. Definitely a good expos section to take but definitely not easy in my opinion.","best_comment_short":"Julia is a great preceptor that puts in a lot of effort to help her students succeed and to answer their questions.","best_comment_first":"This class is great if you have no writing experience and want to learn how to make your essays crystal clear and easy to communicate.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=915a7d3826c4e02a8b918d6f896269ab24412455552780968ce6252dc7cfe7ae358ec24ff80833194e51700ceda4eeb8&ReportType=2&regl=en-US"},{"course_code":"MUSIC 189R","useful_title":"Chamber Music Performance","course_score_mean":4.86,"rec_score_mean":4.83,"gem_score_mean":0.0,"sentiment_score_median":0.825,"best_gem_comment":"","workload_score_mean":4.2,"best_gem_comment_short":"","best_comment":"Honestly, the experience from taking this course can be a coin flip. Depending on your chamber group, you may have to end up spending several more hours rehearsing compared to other groups. There will always be pre–made dual degree musician chamber groups that will always sound amazing, but if you just want to enjoy chamber music as a regular Harvard student, it may feel like you're having to catch up. Not that the actual level of performance matters that much towards your grade though. The teachers\/coaches are very helpful and insightful, and getting to hear other groups play can be interesting.","best_comment_short":"There will always be pre–made dual degree musician chamber groups that will always sound amazing, but if you just want to enjoy chamber music as a regular Harvard student, it may feel like you're having to catch up.","best_comment_first":"Honestly, the experience from taking this course can be a coin flip.","course_id":"153042","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b3fcd893a3f03cacb3313a3cd8b79a2a94d0000a6a3153e872938fdba3cc266a47432b96af2484a363821640903c6d64&ReportType=2&regl=en-US"},{"course_code":"CHEM 20","useful_title":"Organic Chemistry","course_score_mean":4.58,"rec_score_mean":4.4,"gem_score_mean":0.0,"sentiment_score_median":0.8724,"best_gem_comment":"","workload_score_mean":10.26,"best_gem_comment_short":"","best_comment":"As a second semester sophomore, I would say this is the best class I've taken here.  Logan is an incredible teacher with a ton of energy, a great sense of humor, a tremendous knowledge of the material (no one ever asked a question he answered poorly), and a tremendous work ethic.  The course materials are excellent: this class had more practice problems than any course I've seen before, and the psets and exams were instructive and fair.  This course consistently attracts a very knowledgeable, dedicated, and friendly teaching staff, which makes learning considerably more enjoyable than in most STEM classes here.Thoughts on Chem 20 vs Chem 17:– Chem 20 was very well organized and the teaching was very coherent; I've heard the same is not true about Chem 17– Chem 20\/30 is considerably more difficult than Chem 17\/27: Chem 17 claims to cover the material in Chem 20\/30 in one semester, but topics are taught much deeper in Chem 20, especially topics related to synthesis (which is practically all of organic chemistry).  This class also tends to attract the chemistry and chem\/phys concentrators as well as people with previous chemistry olympiad backgrounds, while Chem 17 is mostly pre–meds– The grading for Chem 20 is less focused on exams than Chem 17 (where the only grades are from exams), but the grading in both is still very exam heavy (~70% vs ~100%)– The lab component of Chem 20 was not very enjoyable – lab write–ups were excessively long, pre–lab quizzes had almost no relationship to the readings, and the lab staff was much more disorganized than the teaching staff– All around, if you're looking for a difficult but very interesting and well–organized class with a great group of people and a great teaching staff, Chem 20 is the way to go.  If you're just trying to get organic chemistry out of the way, Chem 17 might be a better option","best_comment_short":"This class also tends to attract the chemistry and chem\/phys concentrators as well as people with previous chemistry olympiad backgrounds, while Chem 17 is mostly pre–meds– The grading for Chem 20 is less focused on exams than Chem 17 (where the only grades are from exams), but the grading in both is still very exam heavy (~70% vs ~100%)– The lab component of Chem 20 was not very enjoyable – lab write–ups were excessively long, pre–lab quizzes had almost no relationship to the readings, and the lab staff was much more disorganized than the teaching staff– All around, if you're looking for a difficult but very interesting and well–organized class with a great group of people and a great teaching staff, Chem 20 is the way to go.","best_comment_first":"As a second semester sophomore, I would say this is the best class I've taken here.","course_id":"124312","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ef9be5e4ba0277763a0795e0fb11572c1fc9c07995b693719aae110811510758010a0e97be76c9beac19df142c03d4fb&ReportType=2&regl=en-US"},{"course_code":"PERSIAN AB","useful_title":"Elementary Persian II","course_score_mean":4.17,"rec_score_mean":4.17,"gem_score_mean":0.0,"sentiment_score_median":0.9399,"best_gem_comment":"","workload_score_mean":5.17,"best_gem_comment_short":"","best_comment":"The class goes at a great pace. You learn quickly, but it is not stressful, especially as the instructors are very helpful in class and eager to help outside of class if needed. The regularity of the class is great for cementing skills in the language.","best_comment_short":"You learn quickly, but it is not stressful, especially as the instructors are very helpful in class and eager to help outside of class if needed.","best_comment_first":"The class goes at a great pace.","course_id":"159991","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f78f0c984d2644ea1154ef402601fbb44d0710385e36d0388f8cc89fb3c07f1f2b0fad7f7d813c3b9ef3eaff274087ef&ReportType=2&regl=en-US"},{"course_code":"STAT 100","useful_title":"Introduction to Statistics and Data Science","course_score_mean":4.4,"rec_score_mean":4.47,"gem_score_mean":0.0,"sentiment_score_median":0.8016,"best_gem_comment":"","workload_score_mean":6.95,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS!!! I CANNOT SAY THIS ENOUGH, BUT AN AMAZING CLASS! I learnt more in this class than any other. Loved this course! Probably my favorite class in the college yet. The psets are easy, and the midterm is basically the same as the PSETS. Kelly is an AMAZING professor and person– she teaches really well and really cares about you and your progress. There were probably over 200 people in the class and she made an effort to learn every single one of our names. You don't need any experience with coding or statistics– I had none and ended up learning A LOT.  She takes the class slow and explains everything.","best_comment_short":"Kelly is an AMAZING professor and person– she teaches really well and really cares about you and your progress.","best_comment_first":"TAKE THIS CLASS!!!","course_id":"113431","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=956de2948406ea799aa0adc81929cd123c4dbee60b3ad56b1ccd2def7f64652325eb14a10ef8ce8baffa6c1a1fec3585&ReportType=2&regl=en-US"},{"course_code":"RSRA 298B","useful_title":"Master's Thesis Reading and Research","course_score_mean":4.8,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.6623,"best_gem_comment":"","workload_score_mean":4.4,"best_gem_comment_short":"","best_comment":"Don't stress about it! The course is designed to help you make progress and work through the normal problems that arise in the course of any long–term research project.","best_comment_short":"The course is designed to help you make progress and work through the normal problems that arise in the course of any long–term research project.","best_comment_first":"Don't stress about it!","course_id":"160540","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7aa43f521a446e66397de2dd772e903e88d2c67e85d426062ddeb3676ba9b7f0542773baeb93f2b4a3de0ea294de11f8&ReportType=2&regl=en-US"},{"course_code":"WOMGEN 1225","useful_title":"Leaning In, Hooking Up: Visions of Feminism and Femininity in the 21st Century","course_score_mean":4.7,"rec_score_mean":4.75,"gem_score_mean":0.0,"sentiment_score_median":0.7446,"best_gem_comment":"","workload_score_mean":4.49,"best_gem_comment_short":"","best_comment":"This is a good course to take if you think of yourself as a feminist but don't yet feel well–versed in intersectional feminism. I would recommend this course to anyone looking for an introduction to the field, but don't expect to come out of it as an expert. That being said, it is definitely worth taking a course with Professor Thompson, who is incredibly eloquent, thoughtful, thought–provoking, and inspirational to say the least. I know that most of my peers would say that this class is not to be missed. I would say the assignments are pretty reasonable.","best_comment_short":"That being said, it is definitely worth taking a course with Professor Thompson, who is incredibly eloquent, thoughtful, thought–provoking, and inspirational to say the least.","best_comment_first":"This is a good course to take if you think of yourself as a feminist but don't yet feel well–versed in intersectional feminism.","course_id":"159887","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=17e35b78ef4601ba7fbeed7a2e9d67714beba1e9727e859ed8cf06117a92fa3346ed045ee581ba22f93fa6cec3742638&ReportType=2&regl=en-US"},{"course_code":"GOV 94TR","useful_title":"The Politics of Economic Inequality","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.848,"best_gem_comment":"","workload_score_mean":6.8,"best_gem_comment_short":"","best_comment":"By all means take the class! You will learn a great deal, not just about countries you're familiar with but also about a range of others. Inequality and the politics behind it are both very rich areas, and Prof. Remington does a great job at guiding students into them.","best_comment_short":"Inequality and the politics behind it are both very rich areas, and Prof. Remington does a great job at guiding students into them.","best_comment_first":"By all means take the class!","course_id":"216213","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=111417db0e7657a092b561732f4cd483c3635c56c5c56eff7283d2be419ac1cfd059d13c927d2e1925a148a5c2b9356c&ReportType=2&regl=en-US"},{"course_code":"BIOSTAT 249","useful_title":"Bayesian Methodology in Biostatistics","course_score_mean":4.87,"rec_score_mean":4.64,"gem_score_mean":0.0,"sentiment_score_median":0.7642,"best_gem_comment":"","workload_score_mean":9.5,"best_gem_comment_short":"","best_comment":"This is a really great course if you're interested in Bayesian statistics (which you should be). It's a good amount of work, but it's worth it. If you have the chance to take this with Jeff Miller, do it! He's one of the best profs in the BST department. He's a great lecturer and has great materials.","best_comment_short":"He's a great lecturer and has great materials.","best_comment_first":"This is a really great course if you're interested in Bayesian statistics (which you should be).","course_id":"119853","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=59ec3c7539640e1c5922e20e305254081f642a86e1fd7c4b7618b19068d67c66876f3e27e827205110eb001baed4545e&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 211","course_score_mean":4.7,"rec_score_mean":4.7,"gem_score_mean":0.0,"sentiment_score_median":0.7693,"best_gem_comment":"","workload_score_mean":6.0,"best_gem_comment_short":"","best_comment":"I would really encourage other students to take this class. I found the topic area to be very interesting and also very topical. 1984 was a great read, and I also enjoyed the opportunity to read some of Orwell's essays. Professor Cole is a great instructor who will do his very best to help you improve your written work. I took a lot out of this class and think that a good portion of next year's students would find the same.","best_comment_short":"Professor Cole is a great instructor who will do his very best to help you improve your written work.","best_comment_first":"I would really encourage other students to take this class.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1b5f793cd3443e8205d47a4d23f76219a5e8a155c9e3f980bf7e92f4483547214fe3983776760ab8ee3d6a7dabb0e279&ReportType=2&regl=en-US"},{"course_code":"GOV 1295","useful_title":"Comparative Politics in Latin America","course_score_mean":4.57,"rec_score_mean":4.54,"gem_score_mean":0.0,"sentiment_score_median":0.8555,"best_gem_comment":"","workload_score_mean":7.82,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS. Professor Levitsky is a phenomenal lecturer and you will learn a lot about politics which is not just applicable to Latin America. Make use of office hours and talk to Professor Levitsky, he has some very interesting stories to tell and is always happy to talk to his students. The readings can seem like a lot but they are truly amazing and you will gain a much better understanding of the theories if you commit a couple of hours each week to them.","best_comment_short":"The readings can seem like a lot but they are truly amazing and you will gain a much better understanding of the theories if you commit a couple of hours each week to them.","best_comment_first":"TAKE THIS CLASS.","course_id":"146761","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=612bef1d0cb1213352403057bb2302d4c3bae8924ae580531209f964af942e499aa8d453d89aa1e5d889a728913975dd&ReportType=2&regl=en-US"},{"course_code":"PSY 2553R","useful_title":"Behavioral Insights Group Research Seminar","course_score_mean":4.61,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":0.6519,"best_gem_comment":"","workload_score_mean":6.25,"best_gem_comment_short":"","best_comment":"This is a great class if you want to gain research experience is a close–knit setting.","best_comment_short":"This is a great class if you want to gain research experience is a close–knit setting.","best_comment_first":"This is a great class if you want to gain research experience is a close–knit setting.","course_id":"120559","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1075fbcb16e2af55c593498153867d117c7e958675e202b440ebdecd3636658c5cc4617b5b862992712b50ed6cebead0&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 207","course_score_mean":4.86,"rec_score_mean":4.75,"gem_score_mean":0.0,"sentiment_score_median":0.6474,"best_gem_comment":"","workload_score_mean":5.64,"best_gem_comment_short":"","best_comment":"Religious Pluralism was actually one of my favorite courses this semester. The play we read was amazing, and it was short so it was an easy read, but it had so many places for great analysis. Unit 2 was equally as fun, and even more applicable. We learned about the legal side of religion in America, and then were able You might find yourself agreeing with things you might not have thought you would, and then questioning what you really value, or at the very least you'll definietely get to hear a range of perspectives on pertinent issues. In general the themes we covered in class discussions were interesting, and they pushed people to think and disagree, and rethink, a process I really enjoyed being a part of. Religion is a vessel for larger themes in society and I think this is a great place to bridge those connections.","best_comment_short":"The play we read was amazing, and it was short so it was an easy read, but it had so many places for great analysis.","best_comment_first":"Religious Pluralism was actually one of my favorite courses this semester.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=02063067108c8b3f109e2a03fa1f4a6b4b83e60c9cb73262015bbda0da4588252c2d87eeb38567903f76fc35c905c6fa&ReportType=2&regl=en-US"},{"course_code":"EMR 148","useful_title":"Indigeneity and Latinidad","course_score_mean":4.81,"rec_score_mean":4.81,"gem_score_mean":0.0,"sentiment_score_median":0.66345,"best_gem_comment":"","workload_score_mean":3.69,"best_gem_comment_short":"","best_comment":"Take this class!! Any class with Americo is a gem. He is willing to hear your and everyone's input, especially about concepts surrounding Latinx and Indigenous studies. He really prioritizes participation and effort in assignments and during lectures. The class is meant to be in the style of a seminar, so feel free to jump in with an idea at any time. Personal anecdotes from your life, whether it be about your upbringing or about filling out the race question on surveys, are very much appreciated. This class makes you think about your own identity a lot, which is a great thing. The guest speakers are so nice and bring in so much knowledge, so make sure to ask questions.","best_comment_short":"The guest speakers are so nice and bring in so much knowledge, so make sure to ask questions.","best_comment_first":"Take this class!!","course_id":"218826","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4869b2b0bd86203b74bcd867999184315c86268b741639e9451a78826080694fb330b31d832cf00db9530b718c664871&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 228","course_score_mean":4.27,"rec_score_mean":4.21,"gem_score_mean":0.0,"sentiment_score_median":0.8074,"best_gem_comment":"","workload_score_mean":5.07,"best_gem_comment_short":"","best_comment":"If you're reading the Q guides to find an easy\/cool expos class I would leave this browser right now. To be fair the class was sometimes interesting and we could engage in intellectual conversations within class. BUT, the grading is absolutely awful. It's not because the points weren't being philosophical enough or because the writing was not intellectual enough. It's more because this teacher only accepts ONE style of how to write a paper and if it is not done in that way you're automatically marked off. I remember reading the Q guide and thinking this expos wouldn't be that bad but honestly I was bored 95% of the time (I also like philosophy so isn't that ironic)... and the teacher is so vague with the writing. After you get your first grade on that first paper your stuck in a hole if you didn't get an A. There's legit \"always\" something wrong with the paper no matter how many times the teacher allows you to speak to her. All do respect to the professor (Jen), she is a nice woman and very respectful but I personally did not have a good time in this class and would never tell someone to go through the pain that I went in doing the work in this class. After reading this and you still want to take this expos then best of luck to you !","best_comment_short":"To be fair the class was sometimes interesting and we could engage in intellectual conversations within class.","best_comment_first":"If you're reading the Q guides to find an easy\/cool expos class I would leave this browser right now.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1b9a849aa048d39320413a968c86a22b399980794498df7cfe81de81a540927646f8efa45d964eceedd0d7d5b53db358&ReportType=2&regl=en-US"},{"course_code":"MUSIC 20","useful_title":"Opera","course_score_mean":4.52,"rec_score_mean":4.59,"gem_score_mean":0.0,"sentiment_score_median":0.6988,"best_gem_comment":"","workload_score_mean":3.08,"best_gem_comment_short":"","best_comment":"TAKE THIS CLASS! Lectures are really interesting, and Prof Abbate always plays clips from the Met Opera. The operas are dramatic and fun! It's like taking a class on fairytales – the stories and the characters are super fun to pick apart and learn from. This class isn't a crazy amount of work at all, and you don't need a music theory background. Class is actually really enjoyable and assignments correlate exactly to what is taught in class.","best_comment_short":"It's like taking a class on fairytales – the stories and the characters are super fun to pick apart and learn from.","best_comment_first":"TAKE THIS CLASS!","course_id":"204418","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1ebdb770d0f949237847e7a817c43f6e63e95f0f8b62de02340a698e5d9d29260b09f8a831d3657c2f0c5fae04b0754a&ReportType=2&regl=en-US"},{"course_code":"EXPOS 40","useful_title":"Public Speaking Practicum","course_score_mean":4.55,"rec_score_mean":4.73,"gem_score_mean":0.0,"sentiment_score_median":0.80805,"best_gem_comment":"","workload_score_mean":3.2,"best_gem_comment_short":"","best_comment":"This class should 100% be required. You must take it if you can. Incredibly helpful, the atmosphere\/community is GREAT and I have new friends coming out of it which is so rare!The class really supports speakers of all levels and you definitely shouldn't feel intimidated about your speaking ability going in because you will learn so much. It is amazing experience building and I can't recommend enough. You will feel so much more confident about participating in class and presenting after taking this course. It's just superb.","best_comment_short":"Incredibly helpful, the atmosphere\/community is GREAT and I have new friends coming out of it which is so rare!The class really supports speakers of all levels and you definitely shouldn't feel intimidated about your speaking ability going in because you will learn so much.","best_comment_first":"This class should 100% be required.","course_id":"125227","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4f42b63e646eb6b48301bba89986a102c2f458072a39ee95cee470a6c48f5d2e584c5921ec3495ed0ae89ecadba67df1&ReportType=2&regl=en-US"},{"course_code":"RUSS HB","useful_title":"Russian for Heritage Speakers","course_score_mean":4.57,"rec_score_mean":4.86,"gem_score_mean":0.0,"sentiment_score_median":0.6352,"best_gem_comment":"","workload_score_mean":6.14,"best_gem_comment_short":"","best_comment":"This course is a continuation of Russian Ha. The two course series has been a unique opportunity to fill in many of the gaps in my Russian language knowledge. I now have the vocabulary to speak about grammar, I have learned the major grammatical concepts, including all cases, and I can write in Russian with some confidence that there are minimal errors. I don't know where else I would have gotten the opportunity to  do this, and highly recommend this course to anyone who want to take their home–grown Russian to the next level.","best_comment_short":"I don't know where else I would have gotten the opportunity to  do this, and highly recommend this course to anyone who want to take their home–grown Russian to the next level.","best_comment_first":"This course is a continuation of Russian Ha.","course_id":"219696","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=fe363563e1a784bb229d1eb1a2f5bbb0bd3ec63c9171bfc8e4687b57392494bc373a8546e2cda9e3b63f2d2665967527&ReportType=2&regl=en-US"},{"course_code":"ANTHRO 98B","useful_title":"Junior Tutorial for Thesis Writers in Anthropology","course_score_mean":4.54,"rec_score_mean":4.92,"gem_score_mean":0.0,"sentiment_score_median":0.7083,"best_gem_comment":"","workload_score_mean":4.62,"best_gem_comment_short":"","best_comment":"Great way to fulfill an archaeology elective requirement! Very helpful for your thesis and tailored to you.","best_comment_short":"Great way to fulfill an archaeology elective requirement!","best_comment_first":"Great way to fulfill an archaeology elective requirement!","course_id":"205522","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=babff511e861d67927684760b2604a02699402fc70c34aa48a640db473ca02856bbd3fb1491c3fdf2e035ad149bd2300&ReportType=2&regl=en-US"},{"course_code":"GOV 63","useful_title":"Topics and Resources in Political Theory","course_score_mean":4.6,"rec_score_mean":4.8,"gem_score_mean":0.0,"sentiment_score_median":0.9042,"best_gem_comment":"","workload_score_mean":8.0,"best_gem_comment_short":"","best_comment":"GOV 63 is a great, small–sized, engaging seminar that anyone interested in writing a theory\/philosophy\/social studies thesis should take. You get a broad overview of modern political theory and the relevant debates, and the conversations and readings are quite lively and engaging. Rosen is a wonderful teacher and one of the best at Harvard. A marvelous course – highly recommend it.","best_comment_short":"GOV 63 is a great, small–sized, engaging seminar that anyone interested in writing a theory\/philosophy\/social studies thesis should take.","best_comment_first":"GOV 63 is a great, small–sized, engaging seminar that anyone interested in writing a theory\/philosophy\/social studies thesis should take.","course_id":"108285","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7ac93d833ab3c89b514f43d75b9043026fd3cb69a8522354738bf4a54c702e8d712accee47978a4a5b767cc1f089c9f7&ReportType=2&regl=en-US"},{"course_code":"HIST 1037","useful_title":"Modern Southeast Asia","course_score_mean":4.41,"rec_score_mean":4.37,"gem_score_mean":0.0,"sentiment_score_median":0.76445,"best_gem_comment":"","workload_score_mean":4.78,"best_gem_comment_short":"","best_comment":"Savor every moment in this class! Professor Bose & TFS are truly unique, compassionate, intentional, and understanding. They have a passion for history, particularly emphasizing the visibility of SEA on a global scale, such a pleasure and an opportunity to have learned from them.","best_comment_short":"They have a passion for history, particularly emphasizing the visibility of SEA on a global scale, such a pleasure and an opportunity to have learned from them.","best_comment_first":"Savor every moment in this class!","course_id":"218151","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=45b155475d2c4bee94d2389937db7c78fa2708577f5df5cd423a48b6cd7982993948732221afe5832e8ba347880eb441&ReportType=2&regl=en-US"},{"course_code":"MBB 980M","useful_title":"Functional Neuroimaging of Psychiatric Disorders: Insights into the Human Brain-Mind","course_score_mean":4.64,"rec_score_mean":4.69,"gem_score_mean":0.0,"sentiment_score_median":0.6204,"best_gem_comment":"","workload_score_mean":3.86,"best_gem_comment_short":"","best_comment":"This is a wonderful class with a wonderful instructor!!! You don't need any background in this area (or in related STEM fields, for that matter) –– all the necessary context will be provided to you and you can learn as you go via the readings and class discussions. Moreover, it is a low pressure environment that encourages everyone to share perspectives and ask questions. Not only did I come away from this course with more knowledge about neuropsychiatry and neuroimaging techniques, I am also more excited about medicine and mental health in general. This was my top choice for the MBB seminar lottery and I am so, so glad that I got in. My one piece of advice would be to definitely stay on top of the readings and take the weekly response paper assignments seriously. It will help you get more out of the course and also give you an advantage when deciding on what to write for your final paper!","best_comment_short":"This is a wonderful class with a wonderful instructor!!!","best_comment_first":"This is a wonderful class with a wonderful instructor!!!","course_id":"160759","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=ba37b21609a72defea55fb9cb6eddb3bcd1ac0455b438725794ac3547450d4ab9cde2ab49f4317985ed4a4d606a9ed34&ReportType=2&regl=en-US"},{"course_code":"GENETIC 228","useful_title":"Genetics in Medicine - From Bench to Bedside","course_score_mean":4.9,"rec_score_mean":4.86,"gem_score_mean":0.0,"sentiment_score_median":0.7142,"best_gem_comment":"","workload_score_mean":2.84,"best_gem_comment_short":"","best_comment":"A very engaging course. Not much work besides the 1 week you have to present, but always an interesting lecture to attend at the end of the week. Would highly recommend.","best_comment_short":"Not much work besides the 1 week you have to present, but always an interesting lecture to attend at the end of the week.","best_comment_first":"A very engaging course.","course_id":"121745","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=55398755cd55f338c1daacf4ab0667104465dddb4413a8e806594ebfbc84f7f8903edbabf014bb78010a2e728a74dfac&ReportType=2&regl=en-US"},{"course_code":"APPHY 216","useful_title":"Quantum and Classical Electromagnetic Interaction with Matter","course_score_mean":4.68,"rec_score_mean":4.58,"gem_score_mean":0.0,"sentiment_score_median":0.7172,"best_gem_comment":"","workload_score_mean":8.05,"best_gem_comment_short":"","best_comment":"great lectures, Donhee is passionate about the subject, and the lecture notes are comprehensive","best_comment_short":"great lectures, Donhee is passionate about the subject, and the lecture notes are comprehensive","best_comment_first":"great lectures, Donhee is passionate about the subject, and the lecture notes are comprehensive","course_id":"141253","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=efd603932a734d866be1c970fe7a4b52b128bcd194ca1a77a05e07476b3d7d440f168b821c3df4c06307cdfd02a5b5d4&ReportType=2&regl=en-US"},{"course_code":"BIOSTAT 231","useful_title":"Statistical Inference I","course_score_mean":4.7,"rec_score_mean":4.7,"gem_score_mean":0.0,"sentiment_score_median":0.6318,"best_gem_comment":"","workload_score_mean":10.13,"best_gem_comment_short":"","best_comment":"Rui is the best","best_comment_short":"Rui is the best","best_comment_first":"Rui is the best","course_id":"119845","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=4a79849c6a78599f2bcfcffb71852e4ef2fda8b3bdce5bedcec914fbd2be9d9210afdc97364e2016c733b28b6950055e&ReportType=2&regl=en-US"},{"course_code":"ITAL 30","useful_title":"Upper-Level Italian: Italiano in Verde: Sustainability Issues in the Italian Classroom","course_score_mean":5.0,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.75025,"best_gem_comment":"","workload_score_mean":6.17,"best_gem_comment_short":"","best_comment":"This is a wonderful class in which you learn about several aspects of Italian culture and sustainable living while having fun and meeting great people. Since the sections are generally small, you get very close to the people in them and it is much easier to study something when you are in a friendly environment rather than in a large classroom. Additionally, the course had a great structure for learning grammar and vocabulary, making for a smooth and enjoyable process.","best_comment_short":"This is a wonderful class in which you learn about several aspects of Italian culture and sustainable living while having fun and meeting great people.","best_comment_first":"This is a wonderful class in which you learn about several aspects of Italian culture and sustainable living while having fun and meeting great people.","course_id":"128266","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=faa4be30ec26a4e4c74d64aa1e2fd43a3956b01eb4b919454f84ac8aea27acb961e534b9d5307dbd87e58a732cbc9bc8&ReportType=2&regl=en-US"},{"course_code":"RUSS AB","useful_title":"Elementary Russian II","course_score_mean":4.83,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":0.6369,"best_gem_comment":"","workload_score_mean":10.83,"best_gem_comment_short":"","best_comment":"I found it to be a lot easier than Russian AA, as I felt way more comfortable with reading, writing, and speaking at this point. There's a lot more grammar pushed onto you this semester, so its really important to stay on top of that. You will improve greatly though, your proficiency skyrockets at this point.","best_comment_short":"I found it to be a lot easier than Russian AA, as I felt way more comfortable with reading, writing, and speaking at this point.","best_comment_first":"I found it to be a lot easier than Russian AA, as I felt way more comfortable with reading, writing, and speaking at this point.","course_id":"159620","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=8ba3b4f0d24ddf94ddb800a8c8e08577ef5f0252b9a9ce8b381d4309b98261ceebc51d4e3451b3ff18add08e808e1b85&ReportType=2&regl=en-US"},{"course_code":"GOV 1009","useful_title":"Advanced Geographical Information Systems Workshop","course_score_mean":4.57,"rec_score_mean":4.29,"gem_score_mean":0.0,"sentiment_score_median":0.8172,"best_gem_comment":"","workload_score_mean":4.67,"best_gem_comment_short":"","best_comment":"If you have a background in ArcGIS and know a bit of programming, take this class. It's very low–stress, but very informative. There's a perfect balance between hand–holding and self–exploration (digging through APIs and the ESRI forums). And Jill is an incredible teacher – very patient, funny, and a strong communicator.","best_comment_short":"And Jill is an incredible teacher – very patient, funny, and a strong communicator.","best_comment_first":"If you have a background in ArcGIS and know a bit of programming, take this class.","course_id":"122852","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2bed106897833de4c8f2c1c28a0c9194c772ef16a94d81a597c9a13a9494ef91665ae7d199b5323c45389c08ab447c3e&ReportType=2&regl=en-US"},{"course_code":"SOCIOL 92R","useful_title":"Faculty Research Assistant","course_score_mean":4.5,"rec_score_mean":4.25,"gem_score_mean":0.0,"sentiment_score_median":0.7464,"best_gem_comment":"","workload_score_mean":6.17,"best_gem_comment_short":"","best_comment":"Do a 92r! Find a mentor who shares your research interests and go research! It is a great experience that I recommend everyone does before they graduate.","best_comment_short":"It is a great experience that I recommend everyone does before they graduate.","best_comment_first":"Do a 92r!","course_id":"160534","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=c0c937afe81a9909e08844bee87c331b0896aa54bf0d0195632c2e09d41243a0747fec3c0e652a22558216f8aa7740cb&ReportType=2&regl=en-US"},{"course_code":"SOC-STD 10B","useful_title":"Introduction to Social Studies","course_score_mean":4.36,"rec_score_mean":4.46,"gem_score_mean":0.0,"sentiment_score_median":0.7453,"best_gem_comment":"","workload_score_mean":8.12,"best_gem_comment_short":"","best_comment":"10b is by far the best course I have taken at Harvard and the type of course I wanted to take\/imagined taking here. It is definitely intellectually challenging and requires a lot of time, but I think that level of rigor is necessary for a class to be life–changing like 10b was. 10b is western social theory, but it's also not just that. The texts are diverse and more applicable to the modern world than you'd think, and I often find myself mentally referencing concepts or thinkers we read in 10b when I'm just listening to the news or having conversations with my friends. I have also definitely become a better writer after slogging through six fat essays. Overall, would highly recommend — Social Studies 10a and b make you think, like really think. Even if you think you don't like theory (like I did), I would say it's worth giving it a shot because it has made me smarter, more critical, and more open all at the same time.","best_comment_short":"It is definitely intellectually challenging and requires a lot of time, but I think that level of rigor is necessary for a class to be life–changing like 10b was.","best_comment_first":"10b is by far the best course I have taken at Harvard and the type of course I wanted to take\/imagined taking here.","course_id":"123964","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3808b3ad932b5111129bc7e0dbeeffeab9d427d14df353f5a827f883129c7a8447b0d3e2cf99071c27106d10765cf37d&ReportType=2&regl=en-US"},{"course_code":"RSRA 299B","useful_title":"Master's Thesis Development and Writing","course_score_mean":4.75,"rec_score_mean":5.0,"gem_score_mean":0.0,"sentiment_score_median":0.58555,"best_gem_comment":"","workload_score_mean":7.14,"best_gem_comment_short":"","best_comment":"The emotional payoff of writing a thesis you are proud of is worth a lot, put in the effort. Put in the effort early as well; don't subject yourself to the pain of last–minute work and extensions, however justified it may seem at the time.","best_comment_short":"The emotional payoff of writing a thesis you are proud of is worth a lot, put in the effort.","best_comment_first":"The emotional payoff of writing a thesis you are proud of is worth a lot, put in the effort.","course_id":"160544","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=28129fb278112ac13db57642f520142d2ad41e3894cb59ab5f7afc3580158e1e9c185b7cc10d09349d8fbcfbcfb2a2f8&ReportType=2&regl=en-US"},{"course_code":"MCB 91","useful_title":"Research for Credit in Molecular and Cellular Biology","course_score_mean":4.81,"rec_score_mean":4.75,"gem_score_mean":0.0,"sentiment_score_median":0.5423,"best_gem_comment":"","workload_score_mean":15.47,"best_gem_comment_short":"","best_comment":"I absolutely loved this course because I had a great mentor. A persons experience in lab is very dependent on the people surrounding and supporting them. I was fortunate to have amazing people, which is not something I have had in previous lab work.","best_comment_short":"I absolutely loved this course because I had a great mentor.","best_comment_first":"I absolutely loved this course because I had a great mentor.","course_id":"122529","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=01f8f4f150e6d0b47d16cd118d5b59d84a6dcbfc8f548c4363d2bdc50898c5d50fa54fbd05e41f8236c61c1c8758aff9&ReportType=2&regl=en-US"},{"course_code":"FRENCH 10","useful_title":"Beginning French I: Cross-Cultural Encounters in French","course_score_mean":5.0,"rec_score_mean":4.8,"gem_score_mean":0.0,"sentiment_score_median":0.7906,"best_gem_comment":"","workload_score_mean":5.6,"best_gem_comment_short":"","best_comment":"I definitely recommend this class if you're interested in learning French! Madame Mills is awesome and it was very fun without being too much work.","best_comment_short":"Madame Mills is awesome and it was very fun without being too much work.","best_comment_first":"I definitely recommend this class if you're interested in learning French!","course_id":"126933","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=56b0ae3115dd7c799a6784cb220eb7cff71624846ce2c7fd9970df8f49f0d0ea1b3acea4626e7effe0e002976f789897&ReportType=2&regl=en-US"},{"course_code":"SPANSH 59H","useful_title":"Spanish for Latino Students II: Connecting with Communities","course_score_mean":4.87,"rec_score_mean":4.87,"gem_score_mean":0.0,"sentiment_score_median":0.7264,"best_gem_comment":"","workload_score_mean":4.0,"best_gem_comment_short":"","best_comment":"Take this class!!! This was one of my favorite classes this semester. We got to have a lot of important, fun, and interesting discussions while practicing our Spanish during class. Profesora Parra–Velasco is lovely and really encourages you to critically think about the language and the meaning of \"proper\" Spanish. You will also get to work with the Latinx community in Boston through an organization.","best_comment_short":"Profesora Parra–Velasco is lovely and really encourages you to critically think about the language and the meaning of \"proper\" Spanish.","best_comment_first":"Take this class!!!","course_id":"159938","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=5a8bed60574bbcb4fbb785b1982747b42eaff113cd0e6e52ca7b6fd132a7fcb0429a3dbe4f1930e808f7419aa932c018&ReportType=2&regl=en-US"},{"course_code":"HISTSCI 1472","useful_title":"Mental Health in Crisis: From War Neurosis to Covid-19","course_score_mean":4.67,"rec_score_mean":4.8,"gem_score_mean":0.0,"sentiment_score_median":0.8654,"best_gem_comment":"","workload_score_mean":5.33,"best_gem_comment_short":"","best_comment":"This course was great! This class really broadened my worldview and taught me so much about mental health and trauma in the context of crises and disasters. I love how the course syllabi broke down the different weekly topics (i.e. violence of the state, violence of capitalism, etc.). Professor Abi–Rached was a great lecturer, and it's clear she's passionate about the course. I loved the addition of documentaries and guest speakers\/lecturers! Molly was an exceptional TF that made sure everything ran smoothly; between her flexibility\/accommodation and feedback on assignments, she made sure everyone was in a good position to succeed in this class. Course material was interesting, but Perusall was a slight nuisance at times. I think the requirement for Perusall engagement should be lowered in the future! That way students aren't stressed about a comment limit and can engage with the sources as normal. The written assignments and final project were unique and allowed for students to tap into their creativity. I appreciate that. A rubric would be even more helpful since there was a lot of confusion for me when approaching the change over time essay and final project. Nevertheless, I enjoyed HISTSCI 1472 and would recommend to my peers!","best_comment_short":"Professor Abi–Rached was a great lecturer, and it's clear she's passionate about the course.","best_comment_first":"This course was great!","course_id":"219649","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b39e953842c2db55782a17db3d1b772ea47a5a704c3490a99d1295fa7c178b96573ee00908803f559a2c1dc913c2230b&ReportType=2&regl=en-US"},{"course_code":"MATH 113","useful_title":"Complex Analysis","course_score_mean":4.5,"rec_score_mean":4.42,"gem_score_mean":0.0,"sentiment_score_median":0.7684,"best_gem_comment":"","workload_score_mean":9.93,"best_gem_comment_short":"","best_comment":"Overall, this is a great class –– if you are at all interested in theoretical math and especially if it is still being taught by Dr. Balibanu, definitely take it. This class is accessible to a fairly wide range of math backgrounds, has a good balance of definitions and interesting results (i.e. not too many of the former and plenty of the latter), and the problem solving on the PSets and exams is mostly satisfying. I'll now get into more detail about what I felt were this class' pros and cons.Pros:– Lectures. Dr. Balibanu does an amazing job explaining difficult concepts so that everyone can understand them. Coming from a limited math background (only previous math courses were 21a\/b, with some proof–writing experience), I was somewhat apprehensive about my level of preparation for the class. The most out of place I ever felt was occasionally when she would ask, \"who here has at least heard of concept X,\" to which most of the class excluding me raised their hands. However, she would go on to then clearly explain the concept and how it related to the material at hand. Despite my minimal prior math experience, I found the lectures very clear and easy to follow. This was especially evident when trying to self–teach myself the concepts from textbooks –– the lectures were significantly easier to learn from.– Course content. Obviously this is very subjective, but complex analysis lies at the intersection of many areas of math wherein many interesting results are fairly easily accessible, without needing to get bogged down in too many definitions. The class is at face value an extension of multivariable calculus to the complex numbers, and it provides very nice ways to think about otherwise difficult problems such as the fundamental theorem of algebra, certain real–valued integrals and infinite sums, and the Riemann zeta function. It is clear that the concepts of complex analysis are very useful for future areas in math, but even if you're not planning on continuing to study math, they are also pretty fun to learn\/think about in and of themselves.– Course staff. As previously mentioned, Dr. Balibanu is a great lecturer. She is also generally very accessible in office hours and in Slack, and the TFs are similarly helpful, especially in the resources and review sessions they have before tests.– Grading. The grading for this course is half PSets and half exams. The PSets can be tricky and occasionally take a while, but office hours are great in helping to get through them, and they are graded leniently. The exams are very fair –– the problems are often easier versions of those from the PSets, and lots of points are given just for remembering definitions (btw –– when studying, make sure to know all the results, especially those with names).Cons:– Course materials. Outside of lecture, the only real supplementary course resource is the textbook which, as I previously mentioned, can be difficult to learn from. This is fine if you go to all the lectures and take good notes, but there are no lecture notes\/recordings to help catch you up to speed if you don't (though this was Dr. Balibanu's first iteration of the course, so maybe this will change).– Feedback. The only feedback given is the PSet and exam grades. The exams were graded pretty quickly, which was appreciated. However, the PSets often took many weeks to be returned, which especially mattered given that there were (generally) no PSet solutions available other than by going to TFs during office hours and asking for explanations.– Computational homework problems. The PSets were a mix of conceptual and computational problems. While the conceptual problems were generally good concept review, the computational problems sometimes became tedious and felt like busywork.","best_comment_short":"It is clear that the concepts of complex analysis are very useful for future areas in math, but even if you're not planning on continuing to study math, they are also pretty fun to learn\/think about in and of themselves.– Course staff.","best_comment_first":"Overall, this is a great class –– if you are at all interested in theoretical math and especially if it is still being taught by Dr. Balibanu, definitely take it.","course_id":"113608","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e3fcf59b25cb7523a5778751dbb08c92a4fe7bc67e90061e898cdf99b8caa9c0fc4b5878ad11c978f0e74e92a0ef82db&ReportType=2&regl=en-US"},{"course_code":"HISTSCI 99B","useful_title":"Tutorial - Senior Year","course_score_mean":4.39,"rec_score_mean":4.55,"gem_score_mean":0.0,"sentiment_score_median":0.7835,"best_gem_comment":"","workload_score_mean":14.89,"best_gem_comment_short":"","best_comment":"Writing a thesis was super rewarding and I highly recommend it!!! It also requires a bunch of self discipline, so make sure you set reasonable deadlines for yourself and stick to them.","best_comment_short":"Writing a thesis was super rewarding and I highly recommend it!!!","best_comment_first":"Writing a thesis was super rewarding and I highly recommend it!!!","course_id":"109263","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=55adcb8af437ca2530f221f82577c6b3e8e8f059b153b41e877fb3e8282a6765b0fc56d276dbd66716bab658e256d57f&ReportType=2&regl=en-US"},{"course_code":"CHNSE 120B","useful_title":"Intermediate Modern Chinese","course_score_mean":4.7,"rec_score_mean":4.7,"gem_score_mean":0.0,"sentiment_score_median":0.8909,"best_gem_comment":"","workload_score_mean":6.0,"best_gem_comment_short":"","best_comment":"moves very quickly but is even more rewarding. teachers are super fun and understanding","best_comment_short":"teachers are super fun and understanding","best_comment_first":"moves very quickly but is even more rewarding.","course_id":"110940","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1a11ce22745bb4b72fa8942da7021de96e618ca2d87995134c1a361722e5061c5baa65f6e5af5bbf2ddabfc2417dd4b4&ReportType=2&regl=en-US"},{"course_code":"SPANSH 157","useful_title":"Thinking Beyond the Human: Persons, Things and the Environment in Latin American Culture","course_score_mean":4.67,"rec_score_mean":4.58,"gem_score_mean":0.0,"sentiment_score_median":0.7506,"best_gem_comment":"","workload_score_mean":4.92,"best_gem_comment_short":"","best_comment":"Take this course! It is   a time commitment, the course readings can be long, but Mauro and Profe Sorensen create a great class environment and really help every student on their journey.","best_comment_short":"It is   a time commitment, the course readings can be long, but Mauro and Profe Sorensen create a great class environment and really help every student on their journey.","best_comment_first":"Take this course!","course_id":"218329","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=7083bae42912aa5305a6946fb95b1af3132ebfe0b7e201cd06a52aa8a08b4a548a7553378655dec118c0d6c90a7fe636&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 258","course_score_mean":4.36,"rec_score_mean":4.45,"gem_score_mean":0.0,"sentiment_score_median":0.63185,"best_gem_comment":"","workload_score_mean":6.55,"best_gem_comment_short":"","best_comment":"You should take an expos based on a fun topic. You are going to enjoy writing papers so much more on a topic you enjoy reading about, rather than feeling like you have to take a non–fiction based expos to learn something. My writing got so much better because I loved the short stories, books, and movies we absorbed in this class, whereas my friends had to trudge through a miserable paper because they took a different expos.","best_comment_short":"You are going to enjoy writing papers so much more on a topic you enjoy reading about, rather than feeling like you have to take a non–fiction based expos to learn something.","best_comment_first":"You should take an expos based on a fun topic.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=750cea7610b935fc2a4d110b005883fb98cd7bfe739cc03305b8db66b6292e55f6cb3a2d32c7e62be15efd364c32b674&ReportType=2&regl=en-US"},{"course_code":"ENGLISH 20","useful_title":"Literary Forms","course_score_mean":4.5,"rec_score_mean":4.5,"gem_score_mean":0.0,"sentiment_score_median":0.68625,"best_gem_comment":"","workload_score_mean":6.5,"best_gem_comment_short":"","best_comment":"Take eng20 if it is a requirement, skip it otherwise. It's a good class for basic exposure to lots of different forms, but I didn't feel like knowledge about really any specific form grew greatly as a lot of the class is just student–driven discussion so if you've never analyzed a form before you can feel a bit lost. While I really liked the teaching staff, it did feel pretty chaotic and disorganized most of the time. This class was the most \"english\" class I have taken so far — nearly every other sentence was a reference to a canonical piece that I had not read so I often felt pretty out of my wheelhouse. That being said, it was an environment very open to questions which was nice. The structure of the class was to bring a prepared question to class and that will be the jumping off point for discussion. So often class was just talking about random (although interesting) things that weren't always super central to the text. The assignments were pretty flexible though — up to two creative assignments out of four total. Overall, a perfectly fine class but not my favorite, especially since I often felt kind of ostracized from not having the same background knowledge as everybody else (but that could just be specific to the group I was with and not the class).","best_comment_short":"The assignments were pretty flexible though — up to two creative assignments out of four total.","best_comment_first":"Take eng20 if it is a requirement, skip it otherwise.","course_id":"216063","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=cf0e1e2dd7049b8bc01be61194ef0ff36ad4a7ba8970d180b6ccf7107acc5efc4e2427c5b1e432dea483c1594b80d024&ReportType=2&regl=en-US"},{"course_code":"GOV 1061","useful_title":"The History of Modern Political Philosophy","course_score_mean":4.63,"rec_score_mean":4.59,"gem_score_mean":0.0,"sentiment_score_median":0.6478,"best_gem_comment":"","workload_score_mean":7.26,"best_gem_comment_short":"","best_comment":"The GOV1060 &1061 series is one of the most valuable Harvard offerings. This course is comprehensive and holds its enrollees to high expectations. Take advantage of this opportunity to truly learn the foundations of political philosophy, read great works, and engage in strong discussion sections. I would encourage anyone with an interest in politics and philosophy to take this course!","best_comment_short":"Take advantage of this opportunity to truly learn the foundations of political philosophy, read great works, and engage in strong discussion sections.","best_comment_first":"The GOV1060 &1061 series is one of the most valuable Harvard offerings.","course_id":"115014","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6ef2dd8c1ff8fd18ff679097ed0113bdc98c5a3a2b1cee0ae9bfcf50bb8038abecf48a3fbba9d2874997de91d8452af6&ReportType=2&regl=en-US"},{"course_code":"NEURO 91","useful_title":"Laboratory Research","course_score_mean":4.83,"rec_score_mean":4.62,"gem_score_mean":0.0,"sentiment_score_median":0.6239,"best_gem_comment":"","workload_score_mean":13.49,"best_gem_comment_short":"","best_comment":"Neuro 91 is great since it provides you with course credit thereby freeing up some time in your schedule to really dive into your research! There's only one assignment the entire semester, which is your final report, which is super short and easy to write since at that point you've done so much throughout the semester. Would highly recommend taking this and trying our research in any lab you're interested in!","best_comment_short":"Neuro 91 is great since it provides you with course credit thereby freeing up some time in your schedule to really dive into your research!","best_comment_first":"Neuro 91 is great since it provides you with course credit thereby freeing up some time in your schedule to really dive into your research!","course_id":"122846","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3fd3c3df9e43d4668d79d6582e915c878ad92fa4689cd666656a405804e97f4d0d0f2d50d7bb1fd07f21fe0c521d898f&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 209","course_score_mean":4.5,"rec_score_mean":4.25,"gem_score_mean":0.0,"sentiment_score_median":0.53215,"best_gem_comment":"","workload_score_mean":5.33,"best_gem_comment_short":"","best_comment":"Dr. Quigley is the absolute best, literally take this class just for her. She is so kind and compassionate and you will learn SO MUCH from her. She encourages you to step out of your comfort zone and is so inviting. Her class truly felt like a safe space to learn and grow. The class content itself was engaging, interesting, and intellectually challenging and stimulating. You will learn so much about gender and its intersection with psychology and mental health. I had a really heavy course load this semester and she was so understanding with deadline extensions and just in general. I was initially worried about not having any experience in psychology as I never took a psych class before, but I never felt like I couldn't express my opinions or share my thoughts on psych topics. It truly is a safe space for everyone.","best_comment_short":"The class content itself was engaging, interesting, and intellectually challenging and stimulating.","best_comment_first":"Dr. Quigley is the absolute best, literally take this class just for her.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=330a3d85b39195c230700af16e8947201f51481e326a5a622e06a067646093b0ea06b58c89ababb00866381f0724e5e9&ReportType=2&regl=en-US"},{"course_code":"MATH 157","useful_title":"Mathematics in the World","course_score_mean":4.5,"rec_score_mean":4.33,"gem_score_mean":0.0,"sentiment_score_median":0.58215,"best_gem_comment":"","workload_score_mean":7.39,"best_gem_comment_short":"","best_comment":"Take this class! It's a bunch of fun math problems. The homework are challenging enough so that it's not boring, but not too challenging where it seems impossible when you look at it. Sasha is the best, and the whole course staff is very nice. Going to office hours is very useful. Would highly recommend.","best_comment_short":"Sasha is the best, and the whole course staff is very nice.","best_comment_first":"Take this class!","course_id":"159763","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=5ca3712433ff8144064bff1fc802918446e1bafd98bc660c9e92733345a5d359caf67f9e850bda0a39cec453ce47d2a9&ReportType=2&regl=en-US"},{"course_code":"TDM 90DR","useful_title":"Harvard Dance Project","course_score_mean":4.89,"rec_score_mean":4.78,"gem_score_mean":0.0,"sentiment_score_median":0.62995,"best_gem_comment":"","workload_score_mean":5.22,"best_gem_comment_short":"","best_comment":"If you are even considering the course, take it. LROD is by far the best instructor I have had in 4 years at Harvard and she (and Jessi and the other students) make this course so worthwhile. Be prepared to work hard in the studio and plan ahead for tech week\/performances because they are time consuming, but this is an experience that you will not get anywhere else at Harvard or even outside of Harvard. This was a highlight of my 4 years of college and I wish I could go back in time and take it every year. A kind, supportive community—so much stronger than I expected going in. I made friends through this class while also learning from people, which rarely happens in academics here. I can't even begin to express how happy I am that I took this class. I grew as a dancer and personally, met amazing people, and know that anyone who takes the class will grow from whatever their starting point is.","best_comment_short":"LROD is by far the best instructor I have had in 4 years at Harvard and she (and Jessi and the other students) make this course so worthwhile.","best_comment_first":"If you are even considering the course, take it.","course_id":"160653","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=305811c49d37935c82e687720ac4bd154e70896a455d8e5c1c8d5f7f82e37be526d8445ed2d4c5d9f21071dd34356ffc&ReportType=2&regl=en-US"},{"course_code":"CHNSHIS 246","useful_title":"Modern History of Rural China: Proseminar","course_score_mean":4.82,"rec_score_mean":4.64,"gem_score_mean":0.0,"sentiment_score_median":0.7677,"best_gem_comment":"","workload_score_mean":11.22,"best_gem_comment_short":"","best_comment":"Prof Szonyi is the best instructor I have met at Harvard. He is very knowledgeable, smart, and humorous. I learn a lot from the way he teaches.","best_comment_short":"He is very knowledgeable, smart, and humorous.","best_comment_first":"Prof Szonyi is the best instructor I have met at Harvard.","course_id":"218175","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=1dae4bb101eac056b75ef954902d8458e89f3569956b0dee6694472620444ffbaf052edbdd1dc9ac6c2c75f724c21014&ReportType=2&regl=en-US"},{"course_code":"AFVS 160","useful_title":"Modernization in the Visual United States Environment, 1890-2035","course_score_mean":4.81,"rec_score_mean":4.81,"gem_score_mean":0.0,"sentiment_score_median":0.53095,"best_gem_comment":"","workload_score_mean":4.19,"best_gem_comment_short":"","best_comment":"Professor Stilgoe is amazing and I encourage all students to take a class with him, for his engaging lectures, fascinating institutional knowledge, and kindness. Office hours are right after class and also in my opinion a great part of class that you really need to take advantage of. Awesome. I liked 107 in the fall a little bit better but this one is also great. Take it.","best_comment_short":"Professor Stilgoe is amazing and I encourage all students to take a class with him, for his engaging lectures, fascinating institutional knowledge, and kindness.","best_comment_first":"Professor Stilgoe is amazing and I encourage all students to take a class with him, for his engaging lectures, fascinating institutional knowledge, and kindness.","course_id":"148176","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=d6b6d9307b5054920c8d10a0b24e60a1fd5336ef667ec7571f99fca89033374f738b9a9fa463ee4557c3f880918cfd79&ReportType=2&regl=en-US"},{"course_code":"ENG-SCI 177","useful_title":"Microfabrication Laboratory","course_score_mean":4.86,"rec_score_mean":4.85,"gem_score_mean":0.0,"sentiment_score_median":0.5467,"best_gem_comment":"","workload_score_mean":5.8,"best_gem_comment_short":"","best_comment":"Prof. Hu is fantastic. We were able to take this course in CNS, which was also a privilege.","best_comment_short":"Prof. Hu is fantastic.","best_comment_first":"Prof. Hu is fantastic.","course_id":"109356","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=640b44aaf25502a4be909ce2efad22344e77520c9f1ee1ae7e26a3062896f23496a2d458f143c0d84aa6d0efcee9d03f&ReportType=2&regl=en-US"},{"course_code":"ENG-SCI 277","useful_title":"Microfabrication Laboratory","course_score_mean":4.86,"rec_score_mean":4.85,"gem_score_mean":0.0,"sentiment_score_median":0.5467,"best_gem_comment":"","workload_score_mean":5.8,"best_gem_comment_short":"","best_comment":"Prof. Hu is fantastic. We were able to take this course in CNS, which was also a privilege.","best_comment_short":"Prof. Hu is fantastic.","best_comment_first":"Prof. Hu is fantastic.","course_id":"109357","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=640b44aaf25502a4be909ce2efad22344e77520c9f1ee1ae7e26a3062896f23496a2d458f143c0d84aa6d0efcee9d03f&ReportType=2&regl=en-US"},{"course_code":"APMTH 108","useful_title":"Nonlinear Dynamical Systems","course_score_mean":4.43,"rec_score_mean":4.22,"gem_score_mean":0.0,"sentiment_score_median":0.6221,"best_gem_comment":"","workload_score_mean":11.26,"best_gem_comment_short":"","best_comment":"This class has a lot of components that require time and effort outside class but are very rewarding. Sarah is super flexible and an amazing instructor and really focuses on your understanding of the knowledge. Definitely a good choice for satisfying the Differential Equations req for AM","best_comment_short":"Sarah is super flexible and an amazing instructor and really focuses on your understanding of the knowledge.","best_comment_first":"This class has a lot of components that require time and effort outside class but are very rewarding.","course_id":"121989","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=234f3645499d16a4783de1458492e3dd910b836a07c8e03b141af64e537d631f4a1f69706a3e53687db1c7d86ffbd420&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 213","course_score_mean":4.2,"rec_score_mean":4.2,"gem_score_mean":0.0,"sentiment_score_median":0.68775,"best_gem_comment":"","workload_score_mean":6.6,"best_gem_comment_short":"","best_comment":"This is one of my favorite classes I've taken during my time here. I'm very much not pursuing a career\/concentration in humanities\/politics and actually considered ranking a more STEM–y expos section higher — but I'm super glad I ended up being placed in this course. Prof. Gilbert is super enthusiastic, passionate, and committed to having an open dialogue in the class; he's a really, really excellent teacher. I learned a lot; I challenged myself as a writer and as a person, as did a lot of my classmates. I've also been able to meet so many cool people through the class and had some interesting discussions outside of class since the material is that compelling. Would definitely recommend taking it :)","best_comment_short":"Prof. Gilbert is super enthusiastic, passionate, and committed to having an open dialogue in the class; he's a really, really excellent teacher.","best_comment_first":"This is one of my favorite classes I've taken during my time here.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=df4eb1f29427a39f8f5a94f4a9e09960e6eb8289ce5ba4017e84dbde027dbbe3acac781ea9014df0cd7946907e01dc0b&ReportType=2&regl=en-US"},{"course_code":"CPB 91","useful_title":"Research for Credit in Chemical and Physical Biology","course_score_mean":4.75,"rec_score_mean":4.43,"gem_score_mean":0.0,"sentiment_score_median":0.4926,"best_gem_comment":"","workload_score_mean":16.63,"best_gem_comment_short":"","best_comment":"Research for credit is a great way to spend more time on research during the term, and great for thesis research prep!","best_comment_short":"Research for credit is a great way to spend more time on research during the term, and great for thesis research prep!","best_comment_first":"Research for credit is a great way to spend more time on research during the term, and great for thesis research prep!","course_id":"122591","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=5d9f08caa1c8e342a17e3574a810b7fecaf4e18b508b70ad367e49f4faee52a8053a395387cd84f13edcc7475456dcd9&ReportType=2&regl=en-US"},{"course_code":"VIETNAM BB","useful_title":"Elementary Vietnamese","course_score_mean":4.86,"rec_score_mean":4.71,"gem_score_mean":0.0,"sentiment_score_median":0.6747,"best_gem_comment":"","workload_score_mean":4.29,"best_gem_comment_short":"","best_comment":"I'm saddened and distraught to hear that Professor Binh Nhu Ngo will not be teaching anymore but he certainly made the class what it is at Havard. I think this class was a great way to start the day and to just have fun learning and speaking with your classmates.","best_comment_short":"I think this class was a great way to start the day and to just have fun learning and speaking with your classmates.","best_comment_first":"I'm saddened and distraught to hear that Professor Binh Nhu Ngo will not be teaching anymore but he certainly made the class what it is at Havard.","course_id":"116267","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=0066e2b0a086c3907ba292b5d43f73d2d7664e5145a4f2090ab6bdb4f81e8b15adab0396960a456471308f5a1fb3d62e&ReportType=2&regl=en-US"},{"course_code":"ECON 970","useful_title":"Tutorial - Sophomore Year","course_score_mean":5.0,"rec_score_mean":4.63,"gem_score_mean":0.0,"sentiment_score_median":0.474,"best_gem_comment":"","workload_score_mean":6.5,"best_gem_comment_short":"","best_comment":"Before taking Econ 970, I had heard that sophomore tutorials were time–consuming, difficult, and honestly unenjoyable. I'm surprised to say that it ended up being my favorite class of the semester and one of my favorite I've taken at Harvard. I took Economics of Cities with Andrés Maggi and couldn't recommend it more highly. Andrés cares so much about his students, makes you feel like he genuinely wants you to succeed, and is all around THE BEST. He fostered such a great class environment where everyone was encouraged to participate and we could all joke around together and have a good time as well. I'm truly not a hardo who usually loves difficult classes, but I was pleasantly surprised by this one, even though there was a decent (but definitely manageable) amount of work.TLDR: Take Economics of Cities with Andrés!! He's so knowledgable, understanding, and made this class so much better than I expected it to be.","best_comment_short":"Andrés cares so much about his students, makes you feel like he genuinely wants you to succeed, and is all around THE BEST.","best_comment_first":"Before taking Econ 970, I had heard that sophomore tutorials were time–consuming, difficult, and honestly unenjoyable.","course_id":"122752","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=920acfe9ef877cef66ac85780b679961766766471c9662339a8c594f548175ce375eb85f8b4ffa63a1a693adc7839ed4&ReportType=2&regl=en-US"},{"course_code":"PSY 1812","useful_title":"Intercultural Perspectives on Trauma","course_score_mean":4.44,"rec_score_mean":4.39,"gem_score_mean":0.0,"sentiment_score_median":0.67785,"best_gem_comment":"","workload_score_mean":3.44,"best_gem_comment_short":"","best_comment":"this course is AMAZING!!! and i recommend it with much enthusiasm. mayron is such a kind hearted and knowledgeable professor.  i am so lucky to have been a student in his class. he is patient and understanding, flexible with deadlines, and cares a lot about his students. he is truly incredible. the assignments are easy and this class is LIGHT work. you can literally take it as a fifth class and get an A.","best_comment_short":"this course is AMAZING!!!","best_comment_first":"this course is AMAZING!!!","course_id":"218518","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e062a9f32e178cd2c92165aa256871a2baadf62fe7b01d248c80eed353b74c63c84cd2c8baf93d1cc206ee24880b0059&ReportType=2&regl=en-US"},{"course_code":"HAA 279P","useful_title":"The Object in the Art Museum","course_score_mean":4.43,"rec_score_mean":4.54,"gem_score_mean":0.0,"sentiment_score_median":0.4019,"best_gem_comment":"","workload_score_mean":4.79,"best_gem_comment_short":"","best_comment":"Definitely take this course if you are interested in curation or museums as an institution as a whole. The knowledge and expertise that Makeda and Mary brought to this course was so special and I learned to expand my thinking beyond just art in a theoretical or academic sense and dive into the museum as an institution.","best_comment_short":"The knowledge and expertise that Makeda and Mary brought to this course was so special and I learned to expand my thinking beyond just art in a theoretical or academic sense and dive into the museum as an institution.","best_comment_first":"Definitely take this course if you are interested in curation or museums as an institution as a whole.","course_id":"211197","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=a866225cb1c1a76f88ef8aa050738d51a30e1c596bde6d1b0f967ce155cc23c10d81991278c24d20b5d8f390ea686b7a&ReportType=2&regl=en-US"},{"course_code":"ENGLISH 20","useful_title":"Literary Forms","course_score_mean":4.57,"rec_score_mean":4.48,"gem_score_mean":0.0,"sentiment_score_median":0.44915,"best_gem_comment":"","workload_score_mean":4.22,"best_gem_comment_short":"","best_comment":"For English concentrators, this required course is definitely shaped by the instructor. But overall, the readings across forms are generally interesting and the assignments are not horribly difficult. Do not fear English 20, and try to enjoy the assortment of texts it has to offer you. For non–English concentrators, I'd recommend choosing an English course that speaks to your specific interests rather than this general topic course.","best_comment_short":"But overall, the readings across forms are generally interesting and the assignments are not horribly difficult.","best_comment_first":"For English concentrators, this required course is definitely shaped by the instructor.","course_id":"216063","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=110981c091d099fb47bb235de277213ebb761775bff2d52236aa0dab5a34ec8c0bb50585b53302ad71eb4d6ebbdbc48d&ReportType=2&regl=en-US"},{"course_code":"COMPSCI 50","useful_title":"Introduction to Computer Science (for students unable to take in the fall term)","course_score_mean":4.38,"rec_score_mean":4.27,"gem_score_mean":0.0,"sentiment_score_median":0.4939,"best_gem_comment":"","workload_score_mean":9.78,"best_gem_comment_short":"","best_comment":"This course can be a lot at the outset, but it has a ton of helpful resources that you can utilize to master the basics and then take on the rest of the course with more confidence, so definitely take advantage of them!","best_comment_short":"This course can be a lot at the outset, but it has a ton of helpful resources that you can utilize to master the basics and then take on the rest of the course with more confidence, so definitely take advantage of them!","best_comment_first":"This course can be a lot at the outset, but it has a ton of helpful resources that you can utilize to master the basics and then take on the rest of the course with more confidence, so definitely take advantage of them!","course_id":"152514","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=3ba504998008eaaad4b8a6c9b3c8c84d2b324bc90297ae4950e92bce24f01c968dc6888fe98856c1ccf0e56b502dec8e&ReportType=2&regl=en-US"},{"course_code":"ENG-SCI 95R","useful_title":"Startup R & D","course_score_mean":4.5,"rec_score_mean":4.53,"gem_score_mean":0.0,"sentiment_score_median":0.5994,"best_gem_comment":"","workload_score_mean":7.81,"best_gem_comment_short":"","best_comment":"This class is very much a “get out what you put in” kind of place. You could coast and baloney your way through a semester and end up with nothing to show for it at the end…OR you could invest in your cohort and take advantage of the awesome advice and resources and get a huge leap forward on your company. Treat it and give it time like you would that thesis or hard CS course and RAD will help your company in ways you wouldn’t expect and help develop you as a founder.","best_comment_short":"Treat it and give it time like you would that thesis or hard CS course and RAD will help your company in ways you wouldn’t expect and help develop you as a founder.","best_comment_first":"This class is very much a “get out what you put in” kind of place.","course_id":"109272","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=b5821bd1edba77f93a319bd3eef3f6b733ef99b16c76806d74abb9ba36832dbcf72f88bca39f201973729e897aed4f82&ReportType=2&regl=en-US"},{"course_code":"EXPOS 20","useful_title":"Expository Writing 20 ES06","course_score_mean":4.71,"rec_score_mean":4.43,"gem_score_mean":0.0,"sentiment_score_median":0.29375,"best_gem_comment":"","workload_score_mean":4.0,"best_gem_comment_short":"","best_comment":"This class has given me an appreciation of writing I didn't know I had.","best_comment_short":"This class has given me an appreciation of writing I didn't know I had.","best_comment_first":"This class has given me an appreciation of writing I didn't know I had.","course_id":"116353","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=6cee8ac2b083383f36541c80e6e3454eeefd1d52d2f136ae4ebc85017e2d3bf1d2c874de71ba73bd51fbab2112384020&ReportType=2&regl=en-US"},{"course_code":"BIOSTAT 241","useful_title":"Statistical Inference II","course_score_mean":4.43,"rec_score_mean":4.14,"gem_score_mean":0.0,"sentiment_score_median":0.27095,"best_gem_comment":"","workload_score_mean":9.17,"best_gem_comment_short":"","best_comment":"Only take this course if you are really interested in the theory of inference and enjoy proofs. I took this as someone interested in applications of statistics to real problems, thinking it would be good for me to understand more statistical theory and push myself. In the end, this course did not help me in any way for applied statistics, but made me better at doing theoretical proofs.","best_comment_short":"Only take this course if you are really interested in the theory of inference and enjoy proofs.","best_comment_first":"Only take this course if you are really interested in the theory of inference and enjoy proofs.","course_id":"119855","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=699cc62ff5c1d40f113a267f5767cc09d2fa4a62af49fb44f64c4b060d11226655557e5574be1815feecd192dc413d8c&ReportType=2&regl=en-US"},{"course_code":"TURKISH 120B","useful_title":"Intermediate Modern Turkish II","course_score_mean":5.0,"rec_score_mean":4.6,"gem_score_mean":0.0,"sentiment_score_median":0.0772,"best_gem_comment":"","workload_score_mean":8.33,"best_gem_comment_short":"","best_comment":"This class is challenging and requires dedication but you can learn a lot.","best_comment_short":"This class is challenging and requires dedication but you can learn a lot.","best_comment_first":"This class is challenging and requires dedication but you can learn a lot.","course_id":"110700","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=f915465f8e0698ef6ba7f6e8ded26fd46a4dcb6a66a246446f75c560aa94bf215e3a75d0d8f82843219a0ae45729f2c6&ReportType=2&regl=en-US"},{"course_code":"JAPAN 210B","useful_title":"Reading Scholarly Japanese for Students of Chinese and Korean","course_score_mean":4.83,"rec_score_mean":4.67,"gem_score_mean":0.0,"sentiment_score_median":-0.34,"best_gem_comment":"","workload_score_mean":6.2,"best_gem_comment_short":"","best_comment":"","best_comment_short":"","best_comment_first":"","course_id":"124650","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=669d021b21d5ebef07be3d326a01168ae7ad37e96608c515bc64c2158ce4673ce6bf451c9e06f123bbbda7ef7650e7e9&ReportType=2&regl=en-US"}]
