[{"course_code":"MUSIC 1","course_title":"Introduction to Western Music, from Bach to Beyoncé 001","course_title_2023":"Introduction to Western Music, from Bach to Beyoncé","course_score_mean":4.5,"rec_score_mean":4.36,"gem_score_mean":0.0555555556,"sentiment_score_median":0.8777,"best_gem_comment":"This is, quite simply, the BEST course I've taken at Harvard. Let's break down why.1. MUSIC LISTENING: The music we listen to in this course is sooooo good, and learning to listen to it analytically is honestly super fun and rewarding. I developed a bigger appreciation for classical music but also became able to think about more modern music in a completely new light.2. IT'S NOT MUCH WORK AND NOT STRESSFUL AT ALL: A true gem. INCREDIBLY interesting lectures and course material, great assignments, also a SUPER polished and organized course. And truly, this course is not very difficult or stressful. Still, I was motivated to do well because the teaching staff is so great, which brings me to...3. THE COURSE STAFF: Oh. my. god. I LOVED my TF in this class (Cana McGhee, she's a gem), but the other ones were also SICK. Section was such a joy, had amazing convos, great music listening, and always walked out having Shazam'd at least 2 new songs.4. MICHAEL UY: This man right here, is just, *chef's kiss*. Never have I had a professor so eloquent, enthusiastic, personable, funny, polished, relatable, and SO INTELLIGENT at the same time. Every lecture, every moment of this course was made so enjoyable because of Michael. He also knew everyone's name (I'm talking like 120 people) after the second week. The man cares more than anyone I've ever met.TAKE THIS COURSE. Do it, or else I'll be disappointed in you.","workload_score_mean":3.69,"best_gem_comment_short":"IT'S NOT MUCH WORK AND NOT STRESSFUL AT ALL: A true gem.","course_id":"114594","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=bc3fd3f4e51a7e7b8d69368d05436ac92bf55ca557213f47d51d823ad34522c48b1177ef4ef18ed03ae61f49162b81d1&ReportType=2&regl=en-US"},{"course_code":"MUSIC 2","course_title":"Foundations of Tonal Music I 001","course_title_2023":"Foundations of Tonal Music I","course_score_mean":3.74,"rec_score_mean":3.89,"gem_score_mean":0.0454545455,"sentiment_score_median":0.904,"best_gem_comment":"Take this class if you are actually interested in learning music theory. If you are, this class will teach you A LOT in a very short amount of time. You see the connections between many different genres of music; it is definitely not just classical. That being said, it can be tedious and boring at times, but that is how music theory is. If you just like listening to music and even playing a little of it sometimes, that might not be enough. You will be learning all of the fundamentals. They are fascinating, but they also require memorizing and practicing things which can get quite annoying after a while. The professor is great, the TFs are very helpful, and the projects fun. Does not require a lot of time. Probably no more than 2 hours per week to complete the simple, repetitive workbook exercises. In that sense, this is like a gem. You do have to work for the projects, but they are very fun, and likely more creative than difficult.","workload_score_mean":3.53,"best_gem_comment_short":"In that sense, this is like a gem.","course_id":"118594","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=2a5203404fa859deb5028bf9962a2f0fea3720b8688b905efa35149d0e197e36e3ed02672888921f39dadef59e016a13&ReportType=2&regl=en-US"}]