[{"course_code":"OEB 104","course_title":"The Mouse in Science and Society 001","course_title_2023":"The Mouse in Science and Society","course_score_mean":4.79,"rec_score_mean":4.79,"gem_score_mean":0.0833333333,"sentiment_score_median":0.82355,"best_gem_comment":"Take this class if you're looking for an easy, science–based gem! The professor is supportive and the final project has the potential to be very interesting.","workload_score_mean":2.14,"best_gem_comment_short":"Take this class if you're looking for an easy, science–based gem!","course_id":"161184","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=e6901595c833505f02666ea45eccc35fd7d70705da4626ae0b53c5574c3aa5cbff591532d98b3e68f490022a18625687&ReportType=2&regl=en-US"},{"course_code":"OEB 60","course_title":"Fundamentals of Marine Biology 001","course_title_2023":"Fundamentals of Marine Biology","course_score_mean":4.42,"rec_score_mean":4.49,"gem_score_mean":0.0588235294,"sentiment_score_median":0.8831,"best_gem_comment":"DO NOT TAKE THIS CLASS IF YOU ACTUALLY WANT TO LEARN ANYTHING ABOUT MARINE BIOLOGY! This course was a near–complete waste of my time. I learned almost nothing. The lecture content was as basic as it gets –– I think that this course would have been easily accessible to middle schoolers or even 5th graders. I was really disappointed because I am an OEB concentrator with a significant interest in marine biology and especially corals. I was really looking forward to learning from Dr Hartmann since his specialty aligns very closely with my interests. Looking at the syllabus, I imagined that the course would be taught like some other upper level OEB courses –– I understood that there wasn't a lot of work involved, but I thought that meant the lectures would be really engaging and scientifically oriented, and that we would read and discuss papers, or get into the specific dynamics of various ecosystems. Instead, we spent multiple lectures on ocean zones and far too many lectures on the boggle activities. There were a bunch of random activities which don't contribute to learning at all. The only things I learned during this class came from the guest lectures and reading the textbook. I'm guessing that most of the people who took this course probably are going to give it great feedback because it was a complete Gem of a class –– essentially that there was no work and it was an easy A. If you are looking for this then great, take this class. But you will be bored out of your mind, even if you don't know anything about marine biology.","workload_score_mean":2.45,"best_gem_comment_short":"I'm guessing that most of the people who took this course probably are going to give it great feedback because it was a complete Gem of a class –– essentially that there was no work and it was an easy A.","course_id":"217833","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=cfdb9431251c4c62e6d15170f09fcbf485d1956957361956ee720d1c1390b9d9e5e931fb32ca7332f6475c523ce6695a&ReportType=2&regl=en-US"}]