[{"course_code":"AFRAMER 197","course_title_2025":"Poverty, Race, and Health","course_score_mean":4.72,"rec_score_mean":4.83,"gem_probability_mean":0.0833333333,"sentiment_score_median":0.9547,"best_gem_comment":"I think you should definitely TAKE THIS CLASSS! Even if you're not interested in medicine or healthcare, you truly learn so much in this class, as our lessons are very much applicable to things going on today. I'd consider this course a gem, to be honest, but you also gain so much from it–– especially a new mindset and perspective on the role of race in our society and how it affects everything. I feel like this should be a mandatory course regardless of your concentration plans. So many people will never learn all that we learned in the course of the semester, and I feel as though they should. Professor Williams is an amazing lecturer and he's so engaging. He's also funny and extremely passionate about the work he does. I'm so glad I took this class. The workload was way more than manageable. Your only assignments are really the three book reports due throughout the course of the semester which are only four pages long and really chill. I'm extremely glad that I took this course freshman year. In classes like these, it is easy to feel hopeless and stuck as it seems like the heartbreaking issues we learn about can't simply be fixed by us. However, Professor Williams would usually end lectures with positive statements about what we CAN do and inspiring stories from successful reform initiatives.","workload_score_mean":4.67,"best_gem_comment_short":"I'd consider this course a gem, to be honest, but you also gain so much from it–– especially a new mindset and perspective on the role of race in our society and how it affects everything.","course_id":"123435","link":"https:\/\/harvard.bluera.com\/harvard\/rpv-eng.aspx?lang=eng&redi=1&SelectedIDforPrint=273593036d5d19dc977de44cb2c97a6194678b7e8d9bb81c45520947550153fa40cfd907c76e03384c0f86f4084dfdc8&ReportType=2&regl=en-US"}]